[{"reviewtext": "We love this board.  After reading the reviews I decided this was the perfect personal magnetic/dry erase board for my kids.  I use it in homeschooling, but the kids love playing with it other times.  I use the Melissa & Doug magnetic numbers and letters, and it is just wonderful.  I use expo markers on the board, and they erase pretty well.  I periodically clean the board with white toothpaste and a wet rag (something I learned online).  It refreshes the board from those \"ghost\" marks that can build up on dry erase boards.  It's a wonderful size, both sides are magnetic so both kids can play/learn on it at the same time.  If you're looking for a personal sized magnetic board this is it.  I don't believe you'll be disappointed.", "rating": 5.0, "upvotes": 11.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9007293701701939},{"reviewtext": "We had purchased Melissa & Doug magnets & had some made & went looking for a board.  THIS IS IT!  It is so reasonable and has been in use ever since we received it.  You can spell words, put the Leap Frog base on it to put in letters/animals, numbers, etc.  It is also double sided.  Even though it's not intended they also like to put things under/inside the board.  They can roll things through it.  Highly recommend & every child should have one to put their magnets on.", "rating": 5.0, "upvotes": 17.0, "downvotes": 2.0, "helpfulness": 0.8947368421052632, "phelpindex": 0.8847534907222785},{"reviewtext": "These are great practice cards for the price.  They are made of a heavy card stock, and come with both upper, and lowercase letters.  I first looked at sandpaper letters geared toward montessori teaching, and while they were of higher quality, they were also of a much higher price.  Which if I were using them in a classroom, that would probably be the way to go.  However I am using them at home with my five year old, so they don't need to last forever.The card stock is much heavier than I expected from other reviews, and has held up great to moderate use.  The letters themselves did have excess sand on them, put after a weeks use, they are perfect.  I think the cards are a nice size to hold and trace, build words, or play matching games.", "rating": 4.0, "upvotes": 13.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8358148948735535},{"reviewtext": "I have this game.  Just got done playing it w/ my nephew.  I have not played D&D; since late 80's but picked up the \"new\" basic set on a whim because it had been a long time.After using the quick start manual, my nephew's first question was \"where did you get this game\"? because it was fun.This Basic Set has its limits, but it was a good refresher and easy to get back in the game w/ a new player.I hope this review helps because one reviewer rates the game w/o even mentioning anything about the product or game play.", "rating": 3.0, "upvotes": 34.0, "downvotes": 2.0, "helpfulness": 0.9444444444444444, "phelpindex": 0.7492350135815347},{"reviewtext": "This kit is really great for those just getting started playing Dungeons and Dragons, or for those who want an easier version of a fantasy-based game.  It comes with \"quick start rules\" - a much reduced version of the rules which are easier to follow, as well as ready made characters, character sheets, and a first adventure to get you started.  It also includes an advanced rule book that covers clerics, fighters, rogues, sorcerers, and basic non-scripted game play, a full set of dice, and 4 two-sided map tiles resembling a dungeon to place your minatures on.The minatures that came with my kit are: Redgar the human fighter, Aramil the elven sorcerer, Lidda the halfling rogue, Eberk the dwarven cleric, 2 orc warriers, 2 warrior skeletos, 2 kobold warriors, 2 kobold skirmishers, 1 wolf skeleton, 1 Green Dragon, 1 troglodyte, and 1 dire rat.My group was pretty happy with it, we were able to play without much preparation, but when we wanted to create our own adventures, we ended up buying the Player's Handbook, the Dungeon Master's guide book, and the Monster's Manual so that we could create our own characters and adventures.  The miniatures, however, have been the most useful part!All in all, I would say D&D; is a fun game in the vein of most fantasy writers - especially Tolkien.  It's a nice way to interact with and get to know your friends, and includes a bit of teamwork and creative problem solving on the side.", "rating": 4.0, "upvotes": 13.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9349477078691677},{"reviewtext": "Potential, but needs house rules.Written: Feb 05 '11Product Rating: 2 out of 5 starsPros: -quality pieces, varied quests, cooperativeCons: no strategy, no tactical, repetative combat, annoying encountersThe Bottom Line: Even though this game has potential its not worth it.  There are other games that are more fun.  Under $40? Maybe.--------------------------------------------------------------------------------Full Review:Castle Ravenloft: A D&D; BoardgameMy friends and I bought Castle Ravenloft mainly for the fact that it is a cooperative game where all players work towards an end goal together.  While this is true, the fun factor of the game just isnt there and I will explain why:First, how the game works.  The game comes with about 30 or so \"tiles\" which are cardboard puzzle pieces about 5x5 inches long.  Each of these tiles has a diagram of a hallway, room, or corridor and a grid of squares that is used to measure the movement of your character when exploring.  In this way as you explore you draw from the puzzle pile and attach it to the area you are headed into revealing a new area with new challenges.  So far so good.The game also comes with an adventure guide that describes what you are supposed to be doing while exploring.  It also has you set up the puzzle pile in certain ways so that the event room that holds the quest is placed \"after the 8th draw\" for example.  Additionally it has other factors, some adventures are timed reflecting the sun setting, some have mini boss monsters harass the players, ect. ect.  In this way each time you play there will be some variation.  The adventure guide has some 15 or so different adventures and you are free to create your own.  Still so far so good.Before you start, you choose a character from one of the five available.  Wizard, warrior, rogue, cleric, and ranger.  Then you select powers from each of their individual decks (which is only approx 8 cards each).  You dont get all the powers, you must select which ones you want therefore further making each game different.  There is also a treasure deck and each player starts with one draw from it.  Most treasure cards are expendable one time use items such as a potion of healing or a blessing that lets you use one of your other one-time use powers again.  As you explore each monster that you kill gives you another draw from the treasure deck, as well as an experience point value based on the monster.  By this point we were very excited to play and had high hopes.All of the pieces, markers, and cards were of good quality as can be expected from a wizards of the coast product.  My friends and I are not fans of the style of the art, but do recognize its quality.  We chose an adventure and rolled to see who went first and got underway...Unfortunately from here on out, the game fell terribly short of our hopes that it would be good.  For starters, each time a player explores a new area, a monster card and sometimes an encounter card is drawn.  The games phases state that once you explore a new area you can no longer move or do anything with your character.  This means that the monster(s) that were drawn will always attack first.  This takes strategy out of exploring as the result will always be the same.  Next, if a character does not explore a new area he or she must then draw from the encounter deck and 90% of those cards are detrimental like \"each player on the tile takes 1 damage\" or \"choose a power, you can no longer use that power this adventure\".  Encounter cards are like anti-treasure cards, negative things that happen.  I dont like that each character that doesnt explore a new area must draw an encounter card because sometimes if you are fighting monsters, you dont want to explore a new area thus revealing more that you will have to deal with and that will attack before you can react.Eventually the monsters and encounter cards just grind the players down to 0 hit points where they must use one of their 2 healing surges to revive themselves.  If they have no healing surges left, the game ends in a loss.  There is no way to prevent the grind.  There doesnt seem to be any epic successes or failures for either the players or monsters.  The powers mostly just let you hit things further away from you or hit every monster on a tile, ect.  There just isnt enough variation of things to do on your turn.  Its always like \"I use magic missile.\" over and over.  Moving even seems pointless since the only factor is whether you explore a new area or not thus having to draw from the encounter deck.As you gather xp you can spend it to either level up or to cancel an encounter card drawn for 5 points each.  You can only level up once.  After that there is no character progression aside from treasure which is mostly lackluster from what we saw.In conclusion, we tried the game 2 times after that first time.  Each adventure was different granted, but the constant grind was always the same.  The game has potential!  But in my opinion you must come up with some house rules to make it more strategic and fun.  I suggest:-when a new monster card is drawn by exploring a new tile roll randomly to see on which players turn the monster acts instead of it always being the explorer's turn-let players explore new areas on their movement phase so that they can still do something after they explore-double the hit points of all non-boss monsters to compensate for the above 2 items-dont force players to draw an encounter card if they attack a monster on their turn and do not explore a new areaRecommended:No", "rating": 2.0, "upvotes": 21.0, "downvotes": 5.0, "helpfulness": 0.8076923076923077, "phelpindex": 0.708365276198048},{"reviewtext": "My group of seasoned D&D; players (2nd Edition through 4th Edition) decided to try this out instead of our regular campaign recently.  After playing it for a few hours, we came to the conclusion that the only way to enjoy the game as shipped is to just laugh at the fact that every card draw is most likely either going to kill you or come close to killing you.I have seen it said that this game is \"D&D; Lite\" or that it could be used as a gateway to get people into playing actual D&D.;  That is patently ridiculous.  If anyone who has never played D&D; thought this game was a good representation of it, I highly doubt they would play D&D;, which is actually much less difficult and far more enjoyable than Castle Ravenloft.Now, I know there are people who like a \"challenge\" or who think they are smart and special because they put up with a ridiculously difficult game.  That is fine if you are into that sort of thing, but my group would rather actually enjoy themselves.  After we played we came up with a bunch of house rules that could actually make the game playable.If nothing else, I guess it gives me some dungeon tiles and single-color minis to use.", "rating": 2.0, "upvotes": 11.0, "downvotes": 6.0, "helpfulness": 0.6470588235294118, "phelpindex": 0.7353117897668295},{"reviewtext": "I got the chance to play this board game last night, and I found it to be a much polished follow up to their earlier board game, \"Dungeons & Dragons: Castle Ravenloft Board Game\".  You do not need to own or have plaid Ravenloft to play and enjoy this game.  In fact, I consider this a superior product.First and foremost it comes with a wide variety of plastic miniatures, these are the same soft minis they release for their separate miniatures line meaning they won't chip or break, but also are unsuitable for traditional miniature painting.  They are unpainted, but the plastic color for each is chosen to denote the power and theme of the monster (red for demons, grey for duergar and so forth).The artwork on the tiles is well done, and the tiles themselves are solidly constructed.  There is a huge variety of tokens and cards for all situations in the game, these are all competently put together.  If I had to pick 1 complaint, and it would be minor, it is that there are too many different varieties of tokens, and unless you put together some sort of sorting mechanism (plastic baggies work fine) it's easy to get the things you are looking for lost in a pile of tokens.Gameplay starts by choosing a scenario from the included booklet, which includes everything you need to know to set up this particular adventure.  The scenarios increase in difficulty as you go along, but do not require continuity to play, so if you have a favorite you can jump right there.  Everybody plays, there is no person running this game for the players, it is entirely player driven.  Exploration occurs by drawing random tiles, which are accompanied by monsters and random encounters.One fun touch are environment cards which are ambient effects that remain in play until another is drawn.  These range from an increase in the number of monsters drawn to walls of magma.  Players control the monsters they place, which are driven by simple scripts telling you what they do in clearly defined situations (if they are far away, move them up, if they are near attack, etc, etc.)The rules system will be very familiar to anybody who has played 4th edition D&D;, but simple enough for newcomers to grasp.  Once the game gets going, it quickly cascades giving a real feel of desperation without becoming unmanageable.  The random encounters and events are fairly well balanced, and I found this to be a solid game.Plays between 1 and 5.", "rating": 5.0, "upvotes": 74.0, "downvotes": 4.0, "helpfulness": 0.9487179487179487, "phelpindex": 1.0028416806453453},{"reviewtext": "I had high hopes for this game, as I am a big fan of Fourth Edition D&D; (though if you like 3e, enjoy it! I'm not going to tell you one is better; I'll just tell you which one I prefer). I also enjoy games with modular tiles and such, so I really went into this game biased towards enjoying it.Sadly, all that couldn't rescue this game. It is exceedingly repetitive. Play about 3 turns and you'll get the entire experience this game has to offer - there will be nothing new or exciting for you. The game is hopelessly shallow, based on so much chance that strategy is non-existent. Despite the modular tiles, the game offers virtually no customization.The pieces seem to be well-made, and fortunately it might supply some use for actual D&D;, since the store I bought it from doesn't do returns. However, the quality of the pieces is not matched by the game itself.I really wanted to enjoy this game, so I played 5 whole games and an uncounted number of aborted attempts, before accepting the fact that it simply doesn't work. Extremely disappointing.", "rating": 1.0, "upvotes": 13.0, "downvotes": 20.0, "helpfulness": 0.3939393939393939, "phelpindex": 0.6458933010528114},{"reviewtext": "Lords of Waterdeep is based in the Dungeons and Dragons world. More specifically, in the Forgotten Realms campaign setting.  Unlike the other board games that have been released by Wizards of the Coast over the past few years that are also set in the D&D; world (eg, Wrath of Ashardalon and Conquest of Norrath), this game is pure euro. For all intents and purposes, it is a worker-placement game with a pick-up and deliver mechanic (no, really, it's funner than that might sound!).The idea behind the game is the following: Each player takes on the role of a lord of Waterdeep - one of several actors who essentially controls the politics and economy of the City of Splendor (as Waterdeep is known). To increase their influence, they hire adventurers to complete quests on their behalf. For example, you might hire a few rogues to infiltrate one of the many guilds composing Waterdeep's market economy. The more quests you complete, the better you do in the game - the player who completes the most (and most valuable) quests, wins.Game playThe game play blends the theme with the mechanics almost seamlessly. The game plays over eight rounds, and each round players take turns assigning their agents to different buildings. Each building procures the player something, but most commonly a collection of adventurers. Adventurers come in four flavors: clerics, rogues, fighters, and wizards (in other words, classic D&D; archetypes). After assigning agents to a building and collecting its benefits, a player can complete one quest per turn. To complete a quest, you must return a certain type and amount of adventurers to the general stock. In return, you earn victory points - and sometimes gold and more adventurers, or even advantages that last throughout the duration of the game.That's basically how the game plays. There area a few extra things, however, worth noting. First, the game begins with several basic buildings that allow players to procure all necessary resources: the four types of adventurers, quest cards, money, and intrigue cards (more on this in a second). But players who visit the Builders' Hall can also build a new building for that turn. This creates more spaces and resources for players to use and collect, and also provides a benefit for whoever built that building: whenever another player assigns an agent to that building, the owner receives a reward, as well.Intrigue cards allow players to mess with each other more directly than simply blocking one another when assigning agents to buildings. Sometimes they allow you to steal adventurers from other players, while other times you can force them to complete a quest before moving on to their own, more lucrative quest cards. Perhaps most importantly, when you play a quest card, you do so by assigning an agent to Waterdeep Harbor. At the end of each round, everyone who assigned an agent here, that is, played an intrigue card, gets at least one more turn to assign agents to buildings. This mechanic forces players to be in each others' faces.Finally, at the start of the game, players receive a Lord of Waterdeep card that indicates their particular character. Each character is typically associated with a specific type (or types) of quest cards. For example, a lord may be associated with both Skullduggery and Piety (odd combination, but it happened to me with the character Nindil Jalbuck - an evil doppelganger of an otherwise honest and philanthropic halfling). For each quest of that type you complete, you earn bonus points at the end of the game.Why we love this gamea. Lords of Waterdeep is easy to learn and pick up, and it goes quite fast. Our games clocked in at around 45-60 minutes. My current gaming group starts around 2200 and we usually poop out sooner rather than later. This means games that are quick to pick up and play, but strategically fun, are a boon. What's more, with the Lord of Waterdeep cards, each player starts out with a clear goal that helps shape their strategy.b. I like the theme, a lot. I've never played D&D; as an RPG, but I've enjoyed the literature and the D&D; Adventure Games (we own both Wrath of Ashardalon and The Legend of Drizzt). This game evokes the D&D; world in a very unique way. Although I wish the adventurers were something other than classic euro-cubes for thematic reasons (I insist that everyone call the cubes wizards, clerics, fighters, and rogues, and not purple, white, orange, and black cubes!), it still works: you get the idea that you are hiring people to go do stuff for you. Fun, dungeony, high fantasy stuff. I dig it. It just does not feel like a cube-pusher to me. Along with the theme, there's actually quite a bit of flavor text (and incredible artwork) on the cards and in the rules book that make it even more fun (and yes, I read my flavor text, out loud, too, when completing a quest!).c. Although you keep track of victory points as you complete quests, you never quite know who wins until the end of the game, because it's only then that the Lord of Waterdeep cards are revealed. This means that the run-away front runner will not necessary win - and if they do, at least everyone else feels like they're still in the game and has a chance up until the bitter end!d. Finally, this is a good game for all numbers of players (2-5) for which we've played (2 and 4). Strategy changes slightly between player counts, but, in our experience, anyway, the core feel and tactics of the game remain constant between 2 and 4 players - a rather rare and well done feat, in my opinion.In short, Lords of Waterdeep is absolutely fun. I want to note, also, that within my gaming group, I am the only one with any D&D; background or, shall we say, enduring and obsessive high fantasy/sci-fi interest. But that did not seem to matter: everyone loved the game and the theme, and this is one of the few games that got a call back from my gaming group.", "rating": 5.0, "upvotes": 29.0, "downvotes": 2.0, "helpfulness": 0.9354838709677419, "phelpindex": 0.9541252114326304},{"reviewtext": "I'm a D&D; gamer from quite a ways back, and I had my doubts about this game. I checked out the new 4th edition tabletop game when it first came out, and over a brief period of time it fell out of favor with me. D&D; 4e can be a fun game, but it lost something for me in all the focus on tactical combat. The more recent D&D; board game entries from Wizards of the Coast seemed like they took tabletop D&D; and turned it into a simple board game.The 4e connection to Lords of Waterdeep is what worried me. As it turns out, there is no tabletop D&D; to be found in this game. Instead, it takes the city of Waterdeep as the setting, and allows you to be a secret ruler sending out adventurers on quests to collect victory points.As a tabletop D&D; gamer, I instantly found an attraction to this game soon after learning how to play. The thought of being the person in charge of gathering adventurers and sending them out to do my bidding was very appealing to me; finally I would get a sense of how it feels to be on the other side of the adventure. Sure, I've run games as the Dungeon Master before, but the Lords of Waterdeep are essentially non-player characters; extras in the background that the players don't get to interact with very often. To make these powerful extras take centerstage as playable characters was an exciting prospect to me.As a board game collector, I was extremely impressed with the packaging. After you have punched out all the cardboard pieces and followed the guide provided in the instructions, everything is sorted and organized to facilitate fast setup. Every group of tokens, meeples, cards, and tiles is separated into their own tightly constructed compartment. Once the board is placed on top and the box closed, there is little fear that the pieces will be a headache-inducing jumble and/or damaged from handling when next you open it up to play. It is this kind of attention to detail that can win big points with me, as there are a number of other board games I own that do not have sorted compartments in the box. This usually results in me putting pieces into ziploc sandwich baggies to help avoid having to sort everything out every time I want to play. With Lords of Waterdeep, I open the box and get into playing the game a lot sooner, and the condition of the game pieces is maintained while the game is transported and stored.As a board game player, this is a basic resource gathering game that has the backing of a D&D; setting. The artwork is gorgeous, the flavor text ties in very well with the lore of Waterdeep, and it plays super fast. The wooden pieces are a nice break from the plastic parts and cardboard standees of other games. After reading the rules and test playing once, I never had to go back to the rule book in subsequent plays. Everything is laid out visually, with relatively little game mechanic text. What effects or instructions that are listed on the cards and tiles are very clear and easy to understand, and you can tell at a glance what resources you and your opponents need to complete their quests. The designers stated they wanted to create a board game where you could figure out how to play from just looking at the board. I feel they have succeeded in their attempt. The game only plays for 8 rounds, and most of the time this will be accomplished in about an hour, maybe and hour and a half max, even with 5 players. Although at full 5 players your victory point scores will likely be lower than in a 3-person game, the challenge of working your resources against four other \"Lords\" can be quite fun.So why not a 5-star review? This is a pretty basic resource Euro-game, and there is little in the rules regarding interactions with other players other than trying to stop them from collecting resources and/or victory points. There is no mention of being able to strike alliances with the other \"Lords\", make trades, and other such activities that really make a player try to work with the other players to accomplish their goals in an attempt to win. It is this one aspect that I feel makes a Euro-game really soar in enjoyment; you are competing with each other, but you cannot win on your own. With Lords of Waterdeep, the rules are very basic and straight-forward, and win conditions do not require you to work with your opponents at all. The allusion in the rule book to a possible expansion containing a sixth faction is nice, but if it only offers a new faction and does not expand the game with new gameplay options then I would feel the potential for this game's future will have been squandered.Don't get me wrong; this is a fast and fun resource game. I find the packaging and quality of the game parts to be worth the price, if only to vote with my dollars for such packaging and quality in future products. That it also plays well is a rare find. However, D&D; for me shines in it being a role-playing game where the players actually role-play their characters, and I'll likely experiment with offering trades and alliances to encourage players to aid and/or backstab each other. After all you are the Lords of Waterdeep, the most powerful people in the city. Why not play the part for a little while?", "rating": 4.0, "upvotes": 12.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.801793396816967},{"reviewtext": "I play a lot of games, mostly Euros but also a dash of party games and Ameritrash.Lords of Waterdeep is a worker placement game.  If you're looking at buying this you probably already knew that.  It's fairly easy to teach and learn and it plays fast.  It's also pretty good across the spectrum of players.LoW's theme rests almost entirely on the flavor text on the cards.  I've never been a D&D; player, but I've been told that D&D; players really like the flavor text on the cards, that it helps immerse them in the game.  This is exactly why I'm giving the game three stars despite all the positives.This game, if you ignore the flavor text, has almost zero theme.  It's pushing cubes around, collecting, redeeming them for points, rinse, repeat.  Now, lots of Euros have this.  I happen to enjoy many of those games.  The problem here is that LoW is specifically trying to sell a theme and, for me and at least some other players, it does not deliver.The cubes in this game are supposed represent people.  This is the crux of why I don't buy the mechanic=theme one iota.  In Stone Age, for example, you send a \"worker\" out to collect things such as food, stone, wood or gold.  Makes total sense to me.  And I don't even think Stone Age is even that thematic when put up against Ameritrash games.  In LoW you are \"recruiting\" cubes . . . um, I mean \"wizards\" or something like that . . . to fulfill tasks.  So the \"workers\" in LoW are recruiters.  Sorry, doesn't work for me.I won the very first game of LoW game I played.  I knew exactly why I won - I used an Intrigue card as one of my last plays to cripple the leader while at the same time had enough resources to jump forward (from fourth place no less) well ahead of everyone else.  Loved playing it.  But I could say the same thing about ANY of my favorite Euro board games.  Which brings me to the only thing I truly love about this game: the take that/screwage Intrique cards.  Other than that, this game is just about like any other game.LoW is a game I enjoy playing and would probably never turn down a game.  It is, however, bland.  I'm not alone in having this opinion.  If you're not a D&D; fan and/or you prefer games to have more theme than flavor text then you might feel the same.It's clear many people love this game and I understand why.  One of the major selling points for LoW is that it plays fairly quickly for its genre.  This can be a major selling point for a family or game group.  This is one reason I don't feel I need to own this game - someone else can own it and bring it to game night.Know what kind of player you are.  LoW might be a great game for you.  It is not for me.  I haven't played it yet, but I'm looking at picking up the Manhattan Project which also has screwage and, allegedly, theme.  We'll see.Edit:I see that my review is getting most negs.  With that in mind:There is a flaw here that game fans should be able to accept and not neg this review.  In most worker placement games your workers actually do something - they collect, buy, etc.  The \"recruitment\" mechanism in LoW is a degree of separation that simply does not exist in most other worker placement games.  As a result, one could re-theme LoW even faster than other such type games.  You could quickly change D&D; flavor text to managing sports teams or the corporate world, both of which involve recruiting.When a game's theme is that interchangeable, that you can quickly change flavor text and have a brand new game with the exact same mechanisms  - that's a flaw.  That's an indication of lack of theme in the worst way.  It also shows a huge amount of dishonesty on the part of the fanboys that a reviewer can't write these things without having the review dinged.  LoW has many positive attributes which I have pointed out. Theme is not one of them.  It shows a clear lack of objectivity to ding a review that is simply pointing out the obvious truth.", "rating": 3.0, "upvotes": 29.0, "downvotes": 20.0, "helpfulness": 0.5918367346938775, "phelpindex": 0.9406279531241833},{"reviewtext": "This remake is based off the late 70's early 80's Dungeon board game which I feel had the best dungeon layout (maze) and creatures\\treasures. They also improved it by placing various helpful charts on the board itself and made things a lot easier and less of an effort to do (such as keeping track of unbeaten creatures).This is basically a game of getting loot and making it out of the Dungeon with enough of it to win the game (before the other players do). Your hero enters a room, fights a monster and if your hero wins you get a treasure. When you have enough treasure to win the game you must head back to the entrance and make it there alive. .This is a great fundamental introductory to Dungeons & Dragons for kids.It teaches two things. Strategy and basic math. If you have kids (girls and boys), they will all have fun playing it. (Its not just a boys game). Pictures on the pawns depict female elves, wizards etc and my daughter loves it.The pictures for the monsters are well done too. Snakes, Spiders, Orcs, Werewolves, Dragons....There is also optional solo rules for single player gaming.Other reviewers complain about the cheap quality but I didn't really think so. Based on certain other products maybe so but I simply didn't see it. Our cat chewed on a player pawn and nothing happened to it! The board is solid and folds out and all the cards and artwork are top rate.Highly recommend this game and its very well done.", "rating": 5.0, "upvotes": 31.0, "downvotes": 1.0, "helpfulness": 0.96875, "phelpindex": 0.9941051072706955},{"reviewtext": "This is a very cute, well-made doll.  Just be advised that you need to purchase the animals (and book if you want that) separately.", "rating": 4.0, "upvotes": 13.0, "downvotes": 1.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.7362107538780609},{"reviewtext": "This is a great toy to use to familiarize yourself with the rhombic triacontahedron, especially if you buy the six-color edition. Actually, I recommend buying two, because that way you'll have 10 pieces of each color.  This allows for symmetrically 3-coloring the \"ball\" as well as 5-coloring and 6-coloring it, which are all interesting problems.  There are also some nice but less symmetrical 4-coloring patterns you can make.My whole family has been enjoying playing with this toy.", "rating": 5.0, "upvotes": 15.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8901857366891268},{"reviewtext": "In a rush, I bought this toy for my 5 year old grandson's birthday.  He is intrigued with mechanical things and I love magnets.  However, when I got the toy, the warning was 'not for children under 14' because it contained rare earth magnets.  And, if it was thrown, it might be damaged and should be disposed of.  That immediately excluded my grandson.  I still think it is a facinating toy, but I haven't opened it.  Therefore, my ratings are not terribly relevant.  But, my review couldn't be summited without them.", "rating": 3.0, "upvotes": 9.0, "downvotes": 5.0, "helpfulness": 0.6428571428571429, "phelpindex": 0.7329563763719117},{"reviewtext": "We bought our son this product for Christmas after he became enthralled with it at the local toy store.  He loves that you can drop it, the pieces scatter and then he has a blast finding all the pieces and putting it back together.  As he gets older, I am sure he will enjoy making all kinds of fun creations with this great learning toy.Shortly after he got it we did lose a piece.  I e-mailed the company and told them what had happened, hoping I could buy a replacement piece and not have to replace the entire ball.  They sent me a replacement piece (free of charge) along with a nice letter and a thank you for my business.Kudos to Ball of Whacks for providing such excellent customer service and for marketing such a great toy for young and old.", "rating": 5.0, "upvotes": 35.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9153245462622774},{"reviewtext": "My sister bought this book for my five-year-old daughter.  I thought she was too young for it, so set it aside for about 6 months.  While it took quite some time to lay out the story, it was worth every second.  She really loves her book, took it to school and went to each of the classrooms to read it.  One teacher called me and asked for the information so that she can do it with her entire first grade class.  It's a great idea and was a great gift!", "rating": 5.0, "upvotes": 15.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8765808145325933},{"reviewtext": "I thought this would actually be reprinted and bound, but the pages in the book were (it looked like it, anyway) the actual pages we had mailed in.  The pictures bled through the pages and there were visible lines everywhere.  Maybe it would have been better to do it online, but I think we could have probably done a much better \"publishing\" job here at home.", "rating": 1.0, "upvotes": 16.0, "downvotes": 13.0, "helpfulness": 0.5517241379310345, "phelpindex": 0.5645040546705382},{"reviewtext": "My son made an illustory book. He did a great job with it and when it was returned, it was great to receive, but they had just cut the actual page he colored, printed the text with a computer and bound those actual pages together! I was quite shocked. He had published his own, beautiful book with [...] and it is much, much nicer, plus it's his own handwriting (or it could be typed). I love the idea, but with all the book publishing companies out there now, so they need to do a much better job with the publishing.", "rating": 2.0, "upvotes": 7.0, "downvotes": 9.0, "helpfulness": 0.4375, "phelpindex": 0.6530454266900501},{"reviewtext": "I know this is meant for children, but I decided to buy it for myself.  I am  writing stories about my childhood that I am sending to my grandchildren.  It is a wonderful way for them to get to know a little about me and have something to keep to remember me by.  I love it.", "rating": 5.0, "upvotes": 16.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8261290052136174},{"reviewtext": "My 5-year-old enjoyed making her book.  I did not realize, however, that the sheets we mailed in would be the same sheets bound into the book. I guess I thought they would be color copied and bound.  Because they are the same sheets, the marker bled through the back of each sheet and looks pretty cheap.  We also had a misspelled word.  I would have done it online if I had known. It is definitely fun to do, and quite educational, but it wasn't quite what we had in mind. I may be too picky.  I guess for under $[...], this is what you would expect.1/6/10: After contacting the company, they paid for the return, correction, and archive of the original book.  Great customer service and finished archived product!!", "rating": 2.0, "upvotes": 14.0, "downvotes": 8.0, "helpfulness": 0.6363636363636364, "phelpindex": 0.6890099574720866},{"reviewtext": "My Granddaughter age 9 had so much fun making up her own story, she is still working on the art and then we will have it printed.", "rating": 5.0, "upvotes": 16.0, "downvotes": 6.0, "helpfulness": 0.7272727272727273, "phelpindex": 0.8390993987365173},{"reviewtext": "We bought this for my son, who loves to write books of his own. When he received the finished version of this book, he was so proud and wanted to write more books. The finished product makes a great gift for grandparents and other loved ones. It also inspires a love of reading and writing in children. What a wonderful do-it-yourself project for children!!!", "rating": 5.0, "upvotes": 25.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.854277383245613},{"reviewtext": "My 8 year old daughter is not the princess/fairy/doll type of girl.  She'd much prefer to write a short story, complete with her own illustrations.  After having a few completed masterpieces sitting about the house, my daughter lamented that she wished she could have it published 'like a real book'.  So my search began, and ended, with this product.  She received it as a Christmas gift, and almost immediately began working on her story (titled 'I'm a Superhero!').  Following the simple, clear instructions in the package, we were able to send off our manuscript for publication.  It did take a little bit to receive the completed product back; in fact, I even emailed the manufacturer to inquire about it as I was worried it may have gotten lost.  Never fear, though, it arrived shortly afterward, and my daughter was thrilled with the hardcover book which she had written, illustrated and designed (by choosing the book color, fonts, etc.)  I love the 'About the Author' page too, and it's so worth it get it printed with your child's picture.  Imagine her face when she sees it!  We even purchased a second one to give to her on her birthday, and this time we tried the internet option.  The advantage here is that you can make the text of each page as long as you want, instead of the rather restrictive 20-word limit per page on the mail-in version.  The drawback, though, is that the drawings will not have that kid-drew-it innocense since the illustrations are also made on the computer.  Having done both versions, I think we'd stick with the internet version from now on, so she can write more and more complex stories as she gets older.  For a child who loves to write and draw, what better gift could they receive than the ability to publish their very own hardcover book?  Something that they - and you as the parent - will cherish for years to come!", "rating": 5.0, "upvotes": 15.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 1.0036210263018672},{"reviewtext": "They include a set of markers and paper.  Be aware of the extra fees associated with writing on too many pages.  Read all their papers carefully and count everything.  They added on fees, contacted me by mail which slowed down the process, and they should allow more pages for the price.  My daughter did this years ago, and now at 11 she did again and still loves this.  This is a great idea and I am not sure if anyone else offers such a product.  The first book went smoothly.  The second book they spelled her name wrong, and the return process was really awful.  They reprinted the book, and although they fixed the typos throughout the book (ones that my daughter didn't spell incorrectly, ones they did), the condition of the book when they shipped it back was beaten up a bit on the spine, but I don't want to go through the process of returning again based on the experience the first time.  If they improve their customer service with the typos, improve the marker set, and shipping situation, this company would do much better.  I doubt I would do this again even though my daughter loved it.", "rating": 4.0, "upvotes": 7.0, "downvotes": 5.0, "helpfulness": 0.5833333333333334, "phelpindex": 0.8625201875908732},{"reviewtext": "I had gotten this card game for my grandchildren who love to play games, but the questions in this game are just stupid and we didn't even finish one round.  An example would be, \"Would you rather eat eye balls from an aligator or from an elephant?\"  This was not a fun game for our family at all.....maybe if you were all drunk, you might find humor in it, but I would not recommend it to anyone.", "rating": 1.0, "upvotes": 10.0, "downvotes": 10.0, "helpfulness": 0.5, "phelpindex": 0.593344167700489},{"reviewtext": "My son has been asking me for bendaroos for the longest time so i got him these since they are pretty much the same thing. i believe the only difference is that the wikkistix have an adhensive quality that lets them stick to glossy books or other shiney surfaces. the book included is very amusing and give kids creative ways to use the wikkistix. for example there is a page with under water  scenery with seaweed and such and you use the wikkistix as if they are seaweed and create other under water critters or scenery. my son wraps them around his pencils, toys, and uses them in other books. overall he has a lot of fun with them and it allows him to express some creativity. the other day he made me \"heart balloons\" with them. my 2yo mimics what he does and they can play together easily without fighting over them since there are many.", "rating": 4.0, "upvotes": 20.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8381394519945387},{"reviewtext": "Every year I buy my daughter at least three board games: one for Christmas, one for Three Kings Day and one for her birthday.  It has become a tradition we both enjoy.  I purchased TTR after reading excellent recommendations from other gamer parents on Boardgamegeek.  I was not disappointed.The game components are well made and beautiful, and the box is designed to store them well.  This is very important, as the game has lots of pieces: cards, colorful plastic trains and wooden marker tokens.Each turn lets you make decisions, play is never merely mechanical.  Each time you play you will be able to choose one of three different actions: claim a train route, collect train cards or gather destination tickets.  Each of those actions implies further decisions:  Do you take a red train or a blue train?  The short Duluth or Phoenix?  Risk the big payoff tickets or keep only the safer, smaller points destinations?The instructions are simple enough for non-gamers and children, but game play is engaging for all levels of play.  The game accommodates both laid back and cutthroat gaming styles.If your family games you should add this to your collection.  If you are new to gaming and need a place to start, this is a fine first buy.", "rating": 5.0, "upvotes": 187.0, "downvotes": 16.0, "helpfulness": 0.9211822660098522, "phelpindex": 0.9519711835169288},{"reviewtext": "I had read several reviews on this game and had very high hopes for it. Everyone said it was an amazing game and if you were to ask my boyfriend, he would highly agree with it being amazing. I think the key to this game is having more than two people, which is what has made it less fun for me to play.  We kind of developed our own rules for making it a two player game (we only take 10 destination cards instead of the whole pile).  Otherwise our scores were in the negative.We have played it probably a dozen times and it makes more and more sense the more you play it. It is kind of in the genre of the game \"Risk\" but with Trains.  Now, mind you, my opinion is not my boyfriends opinion.  He has been noted to be up until 1am playing \"the Train Game\" by HIMSELF.  He is 40 years old and He LOVES this game and will play it incessantly.  So, he would say it is the best game he has ever played (and his game collection is close to 20+ board games) and mine could be slightly tilted because every time we hang out, Ticket to Ride is part of the plan :) It is the birthday gift that keeps on giving.***I am revising my previous statement. We didn't understand all of the rules properly and we were playing the game incorrectly.  Now that we figured it out, I would highly recommend it.  Much better when you understand the directions!", "rating": 4.0, "upvotes": 9.0, "downvotes": 2.0, "helpfulness": 0.8181818181818182, "phelpindex": 0.8965308132194816},{"reviewtext": "Beautifully designed and nicely made but simple to play?  I don't think so.  It has way too many pieces and far too many choices, and frankly I'm not sure that I understand the goal -- which isn't what is expressed in the rules.  I have done a number of those train rides and the routes don't actually go where some of the existing AMTRAK trains (and Canadian Trains) go.  Versimilitude is valuable.  My opinion is that it needs to be simplified and modified...although my opinion is obviously in the minority.  My 8 and 10 year old grandsons liked it but we played with rules that we made up to suit our idea of how it should be played.  And then we spent 10 minutes sorting out the pieces, the cards, and replacing everything in the box.  Mix the cards up and you are doomed!", "rating": 2.0, "upvotes": 5.0, "downvotes": 83.0, "helpfulness": 0.056818181818181816, "phelpindex": 0.6942861267743802},{"reviewtext": "This is a great game. If your paragon of boardgames is still Monopoly, then you are in for a pleasant surprise. Far superior games are now available. There is a quiet revolution in boardgaming happening right now.Ticket to Ride is one of the best of these new games. My wife and I love this game. It is very engaging, and pretty short. It gets tense toward the end. It plays well with 2 players as well as 3 to 5 players. It's also great for kids, to teach the geography of the US. This game won the coveted Game of the Year award (the German \"Spiel des Jahres\" award) for 2004, and it certainly deserves it.Note: There is a possibility for some competitive, cutthroat playing but we don't play it that way.If you like this game, also check out these others, which are also listed on Amazon:Settlers of CatanCarcassonne", "rating": 5.0, "upvotes": 19.0, "downvotes": 1.0, "helpfulness": 0.95, "phelpindex": 0.9287834291709773},{"reviewtext": "For anyone who is not a \"Gamer\" the name \"Ticket to Ride\" doesn't really mean anything beyond a Beatles song.  However if you mention it in Europe and many other parts of the world you might get a very different reaction.About a year ago I got interested in Board Games and after much research I found that Ticket to Ride was always mentioned as the Most Popular Game on all the gaming websites.  They call it a \"Gateway Game\", which means it is a Euro game that will appeal to non gamers, but at the same time it is a good enough game that gamers like to play it as well.I was still a bit hesitant to buy it as I am not a big \"Train\" person.  But after reading many many reviews, I realized that this game must be something really good and I broke down and ordered it.I can tell you that anytime anyone wants to play Ticket to Ride now I am always ready to play.  It doesn't take long to learn how to play, but it is one of those games that you learn new stratgies as you play it.Ticket to Ride is usually my first choice now to introduce non gamers to Euro-style games.  I have yet to meet anyone who didn't like playing Ticket to Ride.I think if a poll was taken throughout the world, Ticket to Ride would probably be #1 even though it is not well known in the US.  Once you play it you won't want to go back to playing Monopoly.... there really is no comparison... they are on two different levels.Do yourself a favor and get this game and see for yourself.", "rating": 5.0, "upvotes": 11.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9582030807533826},{"reviewtext": "This book is geared for older children and even adults.  The stories are good but not appreciated by most young children.", "rating": 3.0, "upvotes": 1.0, "downvotes": 19.0, "helpfulness": 0.05, "phelpindex": 0.6596246134753643},{"reviewtext": "Package was left in a snow storm and box is now warped.  Let Amazon know, but never heard back.Game is great to play and plan on keeping it around for along time.  However, it is pricey and disappointed that I will forever have a warped box.  :'-(", "rating": 1.0, "upvotes": 1.0, "downvotes": 32.0, "helpfulness": 0.030303030303030304, "phelpindex": 0.5395589301376452},{"reviewtext": "PROS: Easy game to learn, Educational for US. Geography, Moderate luck factor.CONS: Not recommended for avid game players. Only moderate strategy.Ticket to ride is fun, it's got some strategy to it, but I've played better. In fact, the European version adds a few more variants that greatly improve on the game. I would recommend this game for beginners. For highly competitive game board fanatics, one or two plays of this version and you'll move on. Best just to skip to the European version.", "rating": 3.0, "upvotes": 49.0, "downvotes": 9.0, "helpfulness": 0.8448275862068966, "phelpindex": 0.7297383639419509},{"reviewtext": "So far, not so good. This game seems to have lots of complicated rules and no strategy. We will try it again - if we can work up our nerve to slog through it once more. It is my hope that we have missed something; it sounded so good when we read about it.", "rating": 2.0, "upvotes": 3.0, "downvotes": 9.0, "helpfulness": 0.25, "phelpindex": 0.6229945415439083},{"reviewtext": "Everything came much faster than was stated, game was in perfect condition so I really couldn't ask for more. More than satisfied. Thank you very much.", "rating": 1.0, "upvotes": 0.0, "downvotes": 38.0, "helpfulness": 0.0, "phelpindex": 0.5134844023888194},{"reviewtext": "The game's enjoyment really comes from taking on the personas of the characters - kind of like a mini roleplaying game - and getting into the action that way.  You're actually working to beat \"the game\", and not really competing against each other.  That's part of what makes this game so creative.The best part of the game is that one player can end up as \"The Traitor\" and actually be working against the other players without their knowledge, advancing the cause of the \"Dark Side\" in the shadows.  There are 'loyalty' cards dealt out at the beginning of the game; all of them say \"LOYAL\" except for one.  We always include ONE more loyalty card than there are players, that way, someone probably is the traitor, but not necessarily.I remember the first time I was the traitor - it was so exciting!  I mean, I was just so into that game, trying to pretend like I was helping, and instead going to a location where I could burn through my good cards without anyone realizing it.  Then, when I blew my cover, I made a really bad play, intending to harm the other players, and ended up killing off my character!  I just wanted to cry.  (Well, not REALLY.)  Anyway, this is a great game.  Takes about 1 1/2 to 2 1/2 hours with four people (but that's with 4 kids running around and lots of snack breaks.)The other thing about this game is that it is just BEAUTIFUL.  I mean, every time we open it I just marvel at the level of detail and the beauty of it.  (And it smells good, too!)  This game is expensive, but when you open the box and play it, you'll know why.  It FEELS like a $[...] game; nothing cheap or cheesy about it.", "rating": 5.0, "upvotes": 31.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9908170110721282},{"reviewtext": "Most boardgames based on legends and tales seem to quickly lose their fantastical feel as the players are forced into learning complex (or overly simplistic) strategies. And all too often these strategies and modes of play are only loosely aligned with the tale they are based on, thus dropping the player right out of the fantasy and into the \"boredgame\" syndrome. However, Shadows Over Camelot neither loses its fantastical feel nor disconnects the elements of play from the rich Arthurian history. Its designers should be hailed for their brilliant use of characters with unique strengths, relevant and interesting quests, wonderful artwork and incredible game play balance. Their use of positive and negative player actions, a secret \"traitor\" character and the constant pressure of ever encroaching enemies is exiciting and challenging. They have successfully captured some of the \"funnest\" attributes of fantasy gaming, while offering a strategic challenge that had our group clapping and shouting at hard-won victories. It was easy to learn, but will take some time to master - one of the attributes any great game should possess. Our hats (and helms) are off to the Days of Wonder folks. Great stuff!", "rating": 5.0, "upvotes": 62.0, "downvotes": 2.0, "helpfulness": 0.96875, "phelpindex": 0.957460399460445},{"reviewtext": "Sunday Game Night always starts out with table topics...wild bunch of 20-40 year olds...would love a table topics sex edition!!", "rating": 5.0, "upvotes": 10.0, "downvotes": 5.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.8029302119285017},{"reviewtext": "I purchased this item after reading the other reviews thinking that it would be a good way to get to know friends better, but after reading some of the cards it seemed like most of the cards asked the same questions or rearraged the wording on most.I was disapointed with the cards, and returning them was even more fun... I had to pay $9.00 to ship them back to the company and a over month later was still waiting on the refund, I finally had to email the company to find out what was taking them so long and they emailed me back saying that they had to charge a restocking fee in order to issue me a refund although the package was only opened, not used. I'm still waiting on my refund and won't order from this company again. Overall it has cost me over $20.00 to try and return this product.", "rating": 1.0, "upvotes": 23.0, "downvotes": 7.0, "helpfulness": 0.7666666666666667, "phelpindex": 0.6165037506063691},{"reviewtext": "This is a nice product and a nice gift.  A definate must have esp. when you have guests or when you just want to have some fun with your friends and family.  Makes a nice gift and the box is so pretty you can leave it sit out so you can enjoy it all the time.", "rating": 5.0, "upvotes": 19.0, "downvotes": 3.0, "helpfulness": 0.8636363636363636, "phelpindex": 0.8261207035693021},{"reviewtext": "item arrived on time, this is the 4th one we've bought. Great gift item. Lots of fun to play and stir up interesting conversation.", "rating": 5.0, "upvotes": 10.0, "downvotes": 1.0, "helpfulness": 0.9090909090909091, "phelpindex": 0.8084161175590411},{"reviewtext": "I bought one for my son who loves to read. This one is not as easy to lose as a regular bookmark. It uses an LR1130 button battery. You will need a watch screw driver to open the compartment. It beeps when the time is up. You can set it up as a countdown, count up or cumulative (adds up the time every time you pause and start again). It also is a regular digital clock when timer is not being used. Bubble wrapped. Made in China.Setting the clock for the first time:-Press and hold Mode button until all 4 digits blink.-Press Hrs and Mins to correct time-Press Mode once to setSorry there is no alarm clock function. Alarm (or I should say, beeping) is only for the countdown timer.Pros:- Fun- CuteCons:- Do not lose the instruction. Setting the clock, or setting the timer may be tricky if you forget how to do it.- Top heavy and thicker than a regular bookmark- On setting up the timer, once you make an error by putting a wrong time (if you want 30 minutes but somehow you pressed the hour button), you cannot go backward unless you reset. To reset, you hold the Hour and Min button at the same time for a couple of seconds. Then the timer will go back to zero. Dont worry, it will not reset the clock, just the timer.", "rating": 4.0, "upvotes": 18.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8782461177138958},{"reviewtext": "Very enjoyable game that pokes fun at the various fantasy clich&eacute;s in books, movies, role playing games, etc.  The people who will get the most out of this are the devoted fantasy fans--others might be overwhelmed at first.  However this is soon settled as you get into the pace of the game.Players play one of four characters: a brash warrior-maiden, a sneaksy little halfling, a snooty priestess, and a wizard with his psychotic bunny rabbit familiar.  It's a little like a collectable card game in some ways:  each character has a unique deck with its own special strengths and weaknesses.  For example, the priestess has lots of cards that heal her, so it's hard to damage her much.  This adds to the fun and interestingness of the game.  However you don't have to go through the agony (and the investment) of actually collecting the cards, which is always a plus in my book.More socially conservative parents might want to shy away from this, as the game centers around the characters drinking, gambling, cheating, and backstabbing one another.  (And they probably wouldn't get half the jokes anyway.)  But otherwise, this is a good dive into how fun and wacky a good card game can be.", "rating": 5.0, "upvotes": 35.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9558372875174025},{"reviewtext": "The game is fun for a very casual gaming crowd.  I had purchased this game with expectations of a little more depth and strategic possibilities within the different character classes.  From the looks of it the four characters included contain very similar cards thus limiting the number of ways one can achieve victory.I've played it a few times and it feels like luck of the cards drawn is the main factor in determining the victor.The game is easy to learn quickly even if many of the players are new and plays relatively quickly.  It's no Carcassonne, Arkham or Catan.  It works if you want a light hearted game that can be learned quickly and played in small group in a short time period.", "rating": 3.0, "upvotes": 5.0, "downvotes": 7.0, "helpfulness": 0.4166666666666667, "phelpindex": 0.7565075036947545},{"reviewtext": "My kids just received this Thanksgiving day as a gift and I am now ordering them for every child I know.  It is such a cute idea.  Santa sends the elf to watch the children and then the elf reports to Santa every night and comes back to a different spot in the house.  My kids wake up with a running start to see who can find the elf first.  The kids must name the elf and they really enjoyed that as well.  It is such a nice tradition to help make the Christmas Season even more fun and special.  I know it will be with our family for a very long time.", "rating": 5.0, "upvotes": 173.0, "downvotes": 28.0, "helpfulness": 0.8606965174129353, "phelpindex": 0.8862610662529402},{"reviewtext": "We got this as a gift recently. At first glance it sounded like a good idea, until I read the story.1. The elf \"watches\" your kids and then tattletales on them to Santa. Really? We teach our children not to tattletale. I don't like the idea of anything, real or imaginary being a dedicated tattletale.2. Religion. The elf makes sure you do your prayers. This is a non starter, we are not a religious family, so this book is basically written for Christians, but that seems to be the theme for the whole book.3. Santa is a bad enough idea (he is not \"real\" in our family, just a mythical figure for fun, like Frosty). But this elf is a tangible object and he is supposed to fly back to Santa every night and tattletale on your kids. This is insulting my myself and my kids.This story is basically just a reinforcement of the Santa mythos, \"do good or else you get no toys\". I teach my kids to do good for good sake and the golden rule. I don't want them to think they have to pretend to be good just for a reward or because some magic person is watching them. 'Be careful the elf, Santa or god(s) are watching you!'is a horrible thing to teach kids.The best fun we had with the elf was the fact that is is freaky looking and my four year old is scared to death of it in a Chucky sort of way. So we beat it up and play fetch with it with the dog just to make her laugh and not to fear it. After the holiday season I think I will just toss the elf in the garbage and donate the book.So in short, want to instill fear into your children, buy this product. Otherwise respect their intelligence and invent something new - not just the repackaged Santa story. I'm sure the inventors have made millions on this crap, don't add to it.", "rating": 2.0, "upvotes": 3.0, "downvotes": 11.0, "helpfulness": 0.21428571428571427, "phelpindex": 0.7600077797024793},{"reviewtext": "I was very disappointed with this product.  The premise was very cute, however, the story was an issue for me.  I am not a fan of ever telling a child that he or she is bad which this book does.  I teach my children that attitudes, behaviors, words, actions etc can be bad but people are not bad.  I also was not crazy about promoting the commercialism of Christmas which this story does.  Between labeling children as \"good or bad\" and telling children that if they are \"good\" Santa will bring them whatever they want doesn't support my values.  If I had read the story before giving it to my child, I never would have given it to him.  Lucky for me he had zero interest in the story or searching for the elf each morning, so I promptly resold the entire kit.  Perhaps a rewrite of this book to reflect current day values and terminology is in order!  I plan to focus on the true meaning of Christmas.", "rating": 1.0, "upvotes": 63.0, "downvotes": 25.0, "helpfulness": 0.7159090909090909, "phelpindex": 0.6182149827372017},{"reviewtext": "We received our little elf last night, and I am pretty disappointed. The quality is very poor for such a price. His little hat has yellow glue seeping through the white band around the head. His hair is totally rubbed off on the front, and his left cheek has also been rubbed off. It's the quality I would expect if I bought from Goodwill and not Amazon.I know Amazon has an amazing return policy, but honestly, returning it would break my boys' hearts since they already named and registered him.The book is okay but also not the quality I expected.", "rating": 3.0, "upvotes": 8.0, "downvotes": 4.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.7446927223003585},{"reviewtext": "As soon as we opened the box, my 3 year old daughter said it was scary.  I decided to let her warm up to it so I just put it on the mantle and read her the book.  When I was done, she said she didn't like the elf and asked me if it could go to Santa's house and not come back here.  I think it's a really cute idea, but maybe if the elf doll was a little...cuter looking(?) it would work better.  That or she just doesn't like the idea of a doll watching her all the time, not sure I blame her on that one.", "rating": 3.0, "upvotes": 57.0, "downvotes": 18.0, "helpfulness": 0.76, "phelpindex": 0.7443793987977796},{"reviewtext": "The story is cute, well written and has great graphics.  The Elf though is poorly made.  I can not see this guy lasting more than a couple of years.  His hat is already falling apart.  The whole thing seems poorly constructed and not worth $30.  I would buy the book without the elf and then find an elf somewhere else.  Probably save half the money!", "rating": 1.0, "upvotes": 10.0, "downvotes": 2.0, "helpfulness": 0.8333333333333334, "phelpindex": 0.5682311435862276},{"reviewtext": "With Christmas closely approaching I found myself seeking out any and all classic holiday traditions to introduce to my three-year-old son. For years I have heard the miracle stories about the Elf on the Shelf saving Christmas by turning the most ill-behaved child into an angel, halo and all. I excitedly spent $30 on the set thrilled to read this Christmas story Thanksgiving night before bed and begin a tradition I was sure we would carry on for years- and then I read the book... I was disinterested immediately but hoped it would get better. My son was not buying into this \"story\" either. Truth is, the book is not a story and they should not call it a story book. It is merely a slightly enhanced instruction manual with some narrative. My son is very into the magic of Christmas and frequently declares that he loves Santa and wants to visit the North Pole. This story however fails to bring the Elf to life even with the \"magic\" he claims to have. I decided to put the Elf perched on a plant for my son to find the next day in hopes he might get excited upon seeing him- epic fail. He did not notice him but managed to notice a picture frame out of place. Final verdict: the Elf on Shelf really is just a lifeless stuffed toy void of any magical super powers. Pretty sure this only works on children easily manipulated and extremely gullible. Save your $30 on real Christmas books that will truly bring the spirit and magic of Christmas alive by delivering something children can think about and discuss with you.", "rating": 1.0, "upvotes": 6.0, "downvotes": 5.0, "helpfulness": 0.5454545454545454, "phelpindex": 0.6745657025721898},{"reviewtext": "This book is so creative for children. I have 3 children ages 5 and under. They love this book. My 5 year old was actually questioning Santa's existence until she woke up and found the elf in a different spot each morning and now she's believing 100%! They get to name their elf and that adds an extra element that they can own! Very creative and just a cute story for the everyday household of children. Even the older ones would enjoy making this story real to younger siblings! A must have a Christmas time!", "rating": 5.0, "upvotes": 53.0, "downvotes": 17.0, "helpfulness": 0.7571428571428571, "phelpindex": 0.8952759033995465},{"reviewtext": "I received this book as a gift and am sad to say how creepy this book/toy is. The elf itself looks like something out of a horror movie...and I'm supposed to let it hang out in my house?! The book has beautiful illustrations, but the story is something else. This elf is supposed to spy on your kids no matter where they are, noting whether they have been good or bad, and report back to Santa. I believe that this is infringing on their rights to be kids. So what if they're bad once in a while...they're kids! Kids make mistakes and PARENTS should be the ones to teach them this, NOT some little toy! I'm all for traditions like Santa, but can do without the elf on the shelf.", "rating": 2.0, "upvotes": 26.0, "downvotes": 28.0, "helpfulness": 0.48148148148148145, "phelpindex": 0.68885325063201},{"reviewtext": "So, I bought this adorable elf, whom my three precious children named \"Buttface\" last year at Christmas time.  Before Buttface arrived in our home I was at my wits end.  My children would write on the walls with markers, crayons and even oil based paints.  They would swing from the light fixture above our dining room table until it finally was pulled out of the ceiling.  We had been dining by candlelight even since until Joey decided to light little Jimmy's hair on fire one night as they fought over who got the red fork at dinner.  We couldn't even have a Christmas tree because Jack would try and climb it, or we would catch Jimmy swinging at it's trunk with his Boy Scouts ax.  I didn't blame the dear child of course, he was merely using his vivid imagination to play a game of \"Lumberjack\".  Instead we would have the Christmas Shoe Box for Santa to put the presents in.  I don't care what anyone says, it was just as festive as any old tree.  Eventually though I realized that my children were not behaving in a socially acceptable way when the FBI showed up at my door because the boys had called in a bomb threat to get out of a spelling test at school.  Terribly upset, I consulted my pediatrician and we both agreed that my children's behavioral issues were no fault of my own and that the ONLY solution to my discipline problems was \"The Elf on The Shelf\".I brought Buttface out of his box the day after Thanksgiving.  For the entire month of December Jimmy, Joey and Jack were perfect angels.  Cowering in abject fear over this tiny stuffed doll they behaved as well as the baby Jesus himself.  It did make for a few night time bed wetting accidents as they were afraid to get out of bed at night for fear Buttface would be lurking in the hallway.  Not once did they bite the dog, cut my hair while I slept or try to hotwire the car.  It was a new record in our home.  We actually got to have a tree that year and I thought my parenting troubles were over!!  Bless you Buttface!However, on December 26th, giddy with all the loot Santa had bought, which was a lot since they had been so extra good with the help of Buttface, my children knew they were off the hook for the next 11 months!  They were back at it again, tipping over our refrigerator, trying to bathe the cat in the dishwasher and scamming old ladies out of their retirement by claiming to be princes from Nigeria in some email scam they had running.So, in despair, I am asking that there be an elf of this nature to spy on my children and keep them on the straight and narrow year round!  I know it would make my life a whole lot easier to know that I had an inanimate object in my house that was keeping my children on the straight and narrow and could take over the parenting duties on a daily basis, not just at Christmas time.  Parenting is very hard work and we need all the help we can get.  If I don't have a toy such as this to teach my children right from wrong under the guise of spying on them and denying them presents if they behave badly, how will they ever learn??  Please, please, won't somebody think of the children!", "rating": 1.0, "upvotes": 274.0, "downvotes": 109.0, "helpfulness": 0.7154046997389034, "phelpindex": 0.743739463274209},{"reviewtext": "You're not going to find one of those \"Verified Purchase\" tags on this review--thankfully.  Put simply, this product is counter to everything Christmas stands for (or rather, is supposed to stand for).  This little guy aparrently sits on his perch watching your children for you.  Then the little stoolie sings like a canary to the Big Guy himself--and that's how Santa knows which kids get coal.How about instead of bringing santa's little spy into the home to threaten children into behaving, we raise them up to understand what loving kindness means--and we do it by example (this is called \"parenting\", by the way).  This product stinks of being concocted by a soulless marketing department looking to capitalize on the idea of a $30 quick-fix for \"naughty children.\"Christmas is supposed to be a celebration of the night our Lord and Savior was born.  While I won't be raising my kids with the Santa tradition, I do respect it.  I was raised to believe in Santa myself and I have many fond memories of seeing those gifts appear Christmas morning marked \"Santa.\"  But this little creep is not remotely in that spirit, and as naming him is part of the tradition, I can think of none better than Big Brother.", "rating": 1.0, "upvotes": 15.0, "downvotes": 14.0, "helpfulness": 0.5172413793103449, "phelpindex": 0.6564992848554423},{"reviewtext": "This is such a wonderful tradition.  Because I collect children's Christmas books, I place a different book with our elf each morning.  Then, we read a new book together at bedtime. My children look forward to finding our elf and to having a new Christmas story.", "rating": 5.0, "upvotes": 12.0, "downvotes": 3.0, "helpfulness": 0.8, "phelpindex": 0.8306637216940479},{"reviewtext": "The whole concept is so creepy and negative. What a great way to turn something beautiful like Christmas into something ugly and frightening. Yuck! If your parenting stinks so bad that you need this elf, may I suggest some parenting classes instead? If you have truly taught your children values and how to be a good human being, they will carry over into the times when nobody is watching. I can't believe how many good reviews this creepy, manipulative, control freak device is getting. Sad commentary on society.", "rating": 1.0, "upvotes": 8.0, "downvotes": 14.0, "helpfulness": 0.36363636363636365, "phelpindex": 0.5919388432854831},{"reviewtext": "Yet another trendy way to waste $20-30 of your hard-earned money. Believe me, there are better ways to ensure your children are well-behaved yearround. The elf is not going to do it.", "rating": 1.0, "upvotes": 7.0, "downvotes": 8.0, "helpfulness": 0.4666666666666667, "phelpindex": 0.5207351730067452},{"reviewtext": "I agree with the posting that dared to criticize this \"tradition\" and disagree with the posting that plans to \"pray for\" the misguided grinch who finds this elf \"creepy\".  I wonder what he is praying for?  That this parent will be enlightened to succumb to mass merchandizing?  Or that the \"terrible wrong in their lives\" will go away?  Or that this family will go to church more so that they will better understand the scriptural account of Santa and elves?  What do children make of all the \"traditions\" that marketing executives have created to enhance the meaning of our holydays?  How scary is it that most children swallow it all and become obedient clones of their parents.  I'd rather see parents concentrating on the substance of the season rather than the trite (and often trashy) appearances of it.", "rating": 1.0, "upvotes": 18.0, "downvotes": 9.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.596252860254125},{"reviewtext": "As one of the reviewers have already stated, the zombies are completely underpowered and nobody wants to be the zombies. A survivor can kill zombies in one turn and run 5 spaces, while a zombie players has to wait for everyone to go to spawn a couple zombies and move 1 space.Zombie players use cards that are almost all \"remain in play cards.\" While this might be helpful for the zombie players, it is ridiculously tedious for everyone playing the game to keep track of them. On top of that, it is nearly impossible to remove the \"remove in play cards.\" What ends up happening is that 30 minutes into the game, you have 7 different remain in play cards with different effects, like \"remove the top card at the start of a hero's turn\" or \"heroes who share a space with another hero must end their turn\" or \"heroes lose one space outside\". With 7 cards, it's just tedious to keep track of.And the reading and rules for this game is steep. There are rules and rules and rules to read. How do heroes get cards? Read the rules. How do ranged weapons work in a turn? Read the rules. How do turns people work? Read the rules. On top of that, the game's cards contradicts itself at times.I also found that many of the games pieces are never used. They are just included. Overall, the instruction manual for the game is poorly designed, along with the ridiculously complex game. It's more of a \"reading\" board game than a \"playing\" board game and is not friendly to new players. I was lured into buying this from the positive reviews, but don't be fooled like I was.", "rating": 1.0, "upvotes": 13.0, "downvotes": 33.0, "helpfulness": 0.2826086956521739, "phelpindex": 0.6293796456363759},{"reviewtext": "I'm going to make the short.  If you own Last Night on Earth, you need to buy this.  The art style is exactly as fantastic as the main game, the new characters are balanced and fun and the addition of more zombies is never a bad thing.  There are a few new rules that add genuine depth and the added scenario is deeper and more challenging than the originals.To remind you: if you have LNoE, buy this now.  You can even fit (most of) the pieces of both sets in the Growing Hunger box.  If you don't have the main game, buy this AND Last Night on Earth.", "rating": 5.0, "upvotes": 19.0, "downvotes": 2.0, "helpfulness": 0.9047619047619048, "phelpindex": 0.8843569767419842},{"reviewtext": "Let me preface this by saying that I've only played 2-3 games so far by myself.  The game is well-designed and fun to play.  The dice are of solid casting and very clear to read.  The book of score sheets is fairly well-designed as well, though including a golf pencil with the set would've been nice.My biggest complaint about the game is that it's extremely random.  Of course, given that it's a dice game, that's to be expected.  I guess even real-life football has a bit of chaos to it, with fumbles going both ways, penalties, etc.  I suppose my disappointment with the game is that it's not really \"strategic\" at all.  You're completely at the mercy of the die rolls.  As it is, you're rolling three dice with a number from 0-3 on them, and the \"big play\" die which has numbers in the double-digits and \"TD\" on it.  I think it'd be better if you could choose to roll \"rushing\" dice or \"passing\" dice, with the appropriate yardage counts on each.  At least that would add a little strategy.  Or perhaps have offensive and defensive dice.  Maybe they'll go that route with the next version of the game.I'll update this review later after I've played more and against actual opponents to see how I think of it.  One plus for the game is that you can download a PDF of the score sheets, so you won't have to buy a super-expensive pad of sheets again once you run out.", "rating": 3.0, "upvotes": 11.0, "downvotes": 2.0, "helpfulness": 0.8461538461538461, "phelpindex": 0.825604939425087},{"reviewtext": "I played this game with my 4-year-old son. (It is designed for children ages 3 and up.) I almost gave up entirely, at first, because my son was fascinated by all the different parts of the game: the tornado, the little chips/coins, and so on. Once he settled down, we began to play. One problem I found was that it was impossible, for both me and my son, to touch our ear to any of the letters. I used to play Twister as a kid (and this game is an educational twist on Twister, since they have to be able to recognize the alphabet), so I was interested in the physical aspect of the game; however, we had no success with getting our ears to touch the mat. The creators of the game could have limited themselves to hands and feet, or added elbows and knees.The tornado motiv is fun, but the footprints that signal the end of the game seem superfluous to me.All things considered, a fun and educational game. But I think that the creators tried too hard to distinguish it from Twister (which was simpler).", "rating": 3.0, "upvotes": 12.0, "downvotes": 3.0, "helpfulness": 0.8, "phelpindex": 0.768876610179317},{"reviewtext": "THE BAD: 1) The game is quite complex, and play requires constantly consulting literally dozens of charts: Photocopying large chunks of the book (or getting a PDF copy so you can just print them out) is pretty much essential. Pretty solidly aimed at Dungeons & Dragons veterans: Not a good game for role-playing novices.THE NEUTRAL: It requires lots of rare dice not used in other RPGs, namely the d3, d5, d7, d14, d16, d24, and d30. However, you can find all these dice on Amazon or other online sources.THE GOOD: The con game that I played in of this was the funnest role-playing experience that I had had in years, and convinced me to order the game as soon as I got home and turned on the computer! This isn't just another D&D; clone or minor variant: It stands as it's own game, and practically pulses with energy, full of tweaks to the rules (some major, some minor) that drive play in a high-flux, crazy direction. STORMBRINGER, 1st Ed WARHAMMER FANTASY ROLE-PLAY, and Old-School D&D; all seem to have contributed about equally to the DCC gene pool. This game has it's own weird spark of madness to it: It may not be \"Modern\" or \"Balanced\", but in the hands of a good referee it really shines. This isn't your father's D&D...it;'s your batsh*t crazy uncles' D&D;, straight from the smokey basement with faded black-light posters on the walls and 80's Manowar blaring on the old tape deck. You might turn up your nose at first, but once the seven-sided-dice start rolling you find yourself sucked in.MORE GOOD: Part of the reason the game is so thick is that it's PACKED with art...I'm not sure, but it looks like they got pieces from pretty much every single living, active, Dungeons and Dragons artist. You don't need to waste time telling any prospective player what this games' \"About\"... just let them flip through the book, so they can soak in all the pictures of crazed wizards, distant and alien elves, freakazoid monsters, rampaging kaiju, demons, heavy-metal warrior-studs, and trap-filled dungeons.All in all, a very pleasant surprise. Not at all the bland D&D; copy I was expecting.", "rating": 4.0, "upvotes": 21.0, "downvotes": 1.0, "helpfulness": 0.9545454545454546, "phelpindex": 0.9546732808123846},{"reviewtext": "12 years after airing the original series, and still several since the movie, this series is still churning out quality products.  While those who have not seen Firefly can still play and enjoy this game, this is definitely a game for the fans.  You pick a ship (all four of them fireflies) and a captain, then traipse around the 'verse, taking jobs (legal or otherwise), collecting crew and equipment, and eventually complete the story mission to win the game (among them, a scenario called \"King of All Londinium\" where you have to steal the 'shiny hat').  Before you ask, yes, it is technically possible (though difficult) to snag the Serenity and build its entire crew, including notable items, such as 'Vera.'Although the learning curve isn't exactly friendly to novices, one game should be able to teach you the rules, and there is a solo mode that helps with this.  Setup should take no longer than Monopoly, with a full game taking anywhere from 2 to 4 hours, depending on newness of the players, aggression, and the scenario chosen.  The excitement doesn't let up, as the rules allow for theft, smuggling, run-ins with the law (interesting with your variable legal status), reavers, plain ole' deliveries, and even a mechanic for doing odd jobs.  There are also (simple) mechanics for reputation, morality, and wanted crew members.  This is a great buy if you are a fan of board games or Firefly, and a must own if you are both.", "rating": 5.0, "upvotes": 17.0, "downvotes": 2.0, "helpfulness": 0.8947368421052632, "phelpindex": 0.9800030292959215},{"reviewtext": "Preface: I have only played 1 game so far and it took 4 hours.  BUT, much of that was just getting the hang of things.  Towards the end, we were flipping and resolving cards very quickly.Quick rundown: You take jobs, you do jobs, you get paid for the jobs.  And keep your boat in the sky.  Take some nice cushy legal jobs in the Alliance areas?  Take something riskier or worry about getting caught by an Alliance patrol?  Or really go out into the boarders, make some real money but risk the wrath of Reavers?Buy some gear.  Vera?  The Mule?  How about a Cunning Hat?  Hire some crew.  Inara can help you talk your way out of some situations.  Kalee can keep your boat in the sky.  Did you pick up Saffron?  Well she just jumped ship to work on another ship as Yolanda.The Good: I felt like I was in the show.  I could take risks for big pay, but get caught.  I could play it safe and stay out of major space lanes and hope not to run out of gas.  When Reavers were nearby, we crapped our pants.  And in terms of game mechanics, we felt like when bad things happened it was our choice. And once you learn what to do, things flow nicely.  Also, all of the parts are decent quality at worse, with some (like the money) being wonderful.  Also, did I mention that my Captain, Monty, wore a mighty cunning hat till the end of the game.The Bad: Lots and LOTS of bits and baubles.  There are 13 separate decks, each with their own discard piles. 5 piles of tokens.  And 5 stacks of very well printed money.  Add to that a big board and each player needing real estate for their ship, crew, gear, jobs, and money...this game takes some serious room to play.  This wasn't really a concern to me, but I know it may be for some folks.  Also, there were w few niggling rules issues we weren't sure about.  Or how or when you can cancel an active job.  Hopefully a FAQ will clear them up.The Ugly: Doing jobs for Niska.  Yeah, I didn't have to...but I wanted to be Solid with him.  And he made me pick up (read: Capture) some slaves and deliver them.  Yeah the pay was damn good...but I still felt dirty.", "rating": 4.0, "upvotes": 147.0, "downvotes": 2.0, "helpfulness": 0.9865771812080537, "phelpindex": 1.0453477537155174},{"reviewtext": "This is a lot of fun for families who enjoy playing Hangman. My 8 year old and I play this whenever we are stuck somewhere waiting. We love it!The only thing negative I have to say about it is that the tiles are hard to turn over initially. However, once you use it a few times, it's fine.", "rating": 5.0, "upvotes": 13.0, "downvotes": 1.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.8615920486239634},{"reviewtext": "I have been playing Big Boggle for years. It had been discontinued for several years and my old set, after being used consistently over the years, had started to wear. For Xmas a couple of years ago, my husband bought me a new set from Ebay for an outrageous $75 new. When I saw that they had reintroduced Big Boggle, I bought two additional sets.Big Boggle is an addictive word game. While it is touted as a bigger version of regular Boggle and you can find bigger words of four letters or more, the reality is that you can come up with some huge words without reusing letters. Confirmed Boggle-maniacs will tell you that at times you can find yourself thinking about words and whether you've encountered them before on the gameboard.While I've noticed that this is a great game for anyone who thinks their memory is going and it definitely stretches a person's word knowledge and spelling skills, it also really helps kids with their spelling skills and vocabulary. My kids started out with regular Boggle and moved up to Big Boggle. Being competitive helped, but it did a great job reinforcing what they learned from a variety of subjects and improved their visual coordination.", "rating": 5.0, "upvotes": 30.0, "downvotes": 2.0, "helpfulness": 0.9375, "phelpindex": 0.9215891484976771},{"reviewtext": "Other reviewers have discussed the  nature of the game at length, so I will focus on something else that potential buyers might want to know: Is it appropriate for kids?  The answer is, like most things, it depends on what you think is \"appropriate!\"I bought this game for my family, and my daughters are aged 11 and 8 right now.  They *loved* this game and wanted to play it all through Christmas vacation.  Some of the cards, like The Chainsaw of Bloody Dismemberment,\" sent them into giggling hysteria.  There is a lot of crude humor here, and if you're not okay with that, this game is not for your kids.  There are also references that only adults will get, such as the monster known as \"Crabs.\"  If this monster catches you, you will lose all your armor and any items worn beneath the waist.  Yeah, adults get it, but the kids don't.  It went right over their heads.In terms of language, there is a Bad-A** Bandana and a Sneaky Bast*** Sword.  But that's as bad as it gets.  Again, it will be up to each buyer's own judgment whether this is appropriate or not.  My children(being girls) just giggled at the cards.  They would never repeat those words in public -- or at least, they better not!I'd rate this game PG most definitely!  We will probably only let the girls play it with family until they are older, since not all parents may feel the same way.", "rating": 4.0, "upvotes": 314.0, "downvotes": 12.0, "helpfulness": 0.9631901840490797, "phelpindex": 0.9223965404886834},{"reviewtext": "Many games make you covertly work against your friends. Munchkin doesn't.Munchkin lets you openly, blatently mess up your opponents in the most in-your-face manner I've ever seen. This is a no holds barred, every man for himself celebration of rules mongering and loopholes.The game mocks D&amp;D and celebrates its simplest form at the same time. What D&amp;D geek doesn't remember sitting around a table, or in the basement, crawling through a dungeon - just bashing down the doors and fighting everything that moves? Munchkin works in exactly the same way. Each round, you bash down the door, fight whatever is inside, and move on to the next room.All the while, players can help or hinder their party, as whomever reaches 10th level first wins. You might not want to stab everyone in the back, though, because you just might need to use them to finish first.Munchkin is a lot of fun for old-school gamers and new fans of the genre alike. Light in rules and fast in play, Munchkin is great as an attraction at small parties or large gatherings. Probably played best with more than 4 people.", "rating": 4.0, "upvotes": 62.0, "downvotes": 8.0, "helpfulness": 0.8857142857142857, "phelpindex": 0.9008537098358684},{"reviewtext": "Hi all,No doubt this comment will get a lot of hate, but rating 1 star is likely the only way I can warn you:-- If you are buying this game because you saw it on Geek & Sundry's TableTop, this version is different.You do not get the board you see on the video.  This, as far as I can tell is the only difference.Otherwise this game is definitely fun.  You will have some questions about how certain things act or behave, or how to call a rule or two, but it's fun.  It is definitely a 4-star game otherwise.Apologies for the alarmist rating, just don't want people to open the box and look around for the map like a dummy.", "rating": 1.0, "upvotes": 2.0, "downvotes": 21.0, "helpfulness": 0.08695652173913043, "phelpindex": 0.60840907884831},{"reviewtext": "This is one of the best card games I have ever played. My friends and I played Munchkins, and Munchkin Bits over Christmas break almost every night. This game is a \"spoof\" off traditional role playing games with no actually role playing. The cards are funny, very creative and at times making funny references to the traditional role playing games. The rules are very well designed and very easy to follow (not much harder then monopoly). I have played this game with non-gamers and experienced gamers with both groups thoroughly enjoying the game. There are several variants of the game available through sjgames.com (Munchkin Fu, Star Munchkin, and more...) and I would highly recommend this game to gamers of all levels. You can also mix variants together which makes for an even more interesting game. Overall, the game is easier to learn and takes about a couple of hours to play depending on number of people.", "rating": 5.0, "upvotes": 15.0, "downvotes": 4.0, "helpfulness": 0.7894736842105263, "phelpindex": 0.9069436494986847},{"reviewtext": "Fan-freakin'-tastic.One of the best non-collectible card games I've ever played.  And if you're feeling extra saucy, go get the expansion packs.  This game is a riot that will have your group (even if not drinking) cracking up.  Plus Kovalic's illustrations add to the fun.Just beware the Magic Missile!Gamers already know how great Steve Jackson Games are, now the rest of the world just needs to catch on.As for the low educational value... you won't learn about math and science, but you will learn about orcs and trolls.", "rating": 5.0, "upvotes": 22.0, "downvotes": 6.0, "helpfulness": 0.7857142857142857, "phelpindex": 0.9086601376540898},{"reviewtext": "This is a very subjective review.The game system is pretty much the same as all the other Munchkin games.  Get to level 10, get the treasure, stab your buddy etc...The only reason for the lower than usual review is I'm not enamored with the genre, sort of like Munchkin bites, it's just not my kind of theme.  If outer space antics are your style then you will enjoy this game much more than I did.My son has Every verison of Munchkin (except blender) and this and Munchkin bites are the two I pass up whenever possible.The game likely deserves another star but I just don't enjoy it enough to give it.", "rating": 3.0, "upvotes": 3.0, "downvotes": 16.0, "helpfulness": 0.15789473684210525, "phelpindex": 0.7791857095169504},{"reviewtext": "I really love the Munchkin card games.  My gaming group, between us, own five of the different genres of the game.  One of my friends bought this game and its expansion.  We've played it a few times now and I have to say, I just don't like it as much as the card games.  It's a good concept, but a few glaring problems make it far less fun in my opinion.Pros:-Well made.  Everything feels like a good quality piece.  Everything you need is there and it doesn't feel like it's going to fall apart on you.-Rules are similar enough to the card game that anybody with experience with the cards will pick up this version very quickly.-Simple, and mostly intuitive, rules.  And if you make a small mistake it won't ruin everybody's experience.Cons:-Individual turns can be time consuming.  If one person has ways of making extra moves beyond the base three then that turn can take forever.  This is especially true if they don't stop to loot rooms and just fight monster after monster after monster while laying down more and more tiles that nobody else is going to bother entering because there's no longer anything there to fight.  This is a real problem because...-...there is far less player interaction in the board game than there is in the card game.  Unless you are next to a person there are only so many things you can do to another player.  This makes it more like each individual playing their own game and seeing who can win first, rather than everybody playing a single boardgame.  For example, I've played in a game where a player went from level six to level 10 and won the game in a single turn. The whole time they were going through the motions to do this there were no actions anybody else could take and nobody could stop them.  It was four people sitting around for ten minutes while one person got to play and then it was over.  Not fun.I really wanted to like this game.  It just doesn't play as smoothly as the card games and I think it is less fun due to the longer time between turns and the decreased player interactions.", "rating": 3.0, "upvotes": 60.0, "downvotes": 2.0, "helpfulness": 0.967741935483871, "phelpindex": 0.8241686101386171},{"reviewtext": "L'item est en excellent &eacute;tat, propre, tout est tr&egrave;s bien et arriv&eacute; dans des d&eacute;lais raisonnable. Seule ombre au tableau : le manque de communication du vendeur/syst&egrave;me. Apr&egrave;s trois semaines, je n'avais toujours pas &eacute;t&eacute; avis&eacute; que l'item avait &eacute;t&eacute; exp&eacute;di&eacute;. J'ai &eacute;crit au vendeur au matin et il m'a r&eacute;pondu la journ&eacute;e mme, tandis que vers 16h l'item arrivait &agrave; mon domicile. Tout bien consid&eacute;r&eacute;, ce fut une bonne exp&eacute;rience d'achat. Merci! :)", "rating": 4.0, "upvotes": 2.0, "downvotes": 12.0, "helpfulness": 0.14285714285714285, "phelpindex": 0.8045052516574376},{"reviewtext": "Great set of cards, delivered on time and for much less than what i would pay at a game shop.", "rating": 5.0, "upvotes": 0.0, "downvotes": 15.0, "helpfulness": 0.0, "phelpindex": 0.8133295732962553},{"reviewtext": "OK I got this book for myself - I'm 25 years old. I had so much fun playing with the cool stencils. There's loads of neat papers with cool textures and designs. Also, I love the ribbons and beads. This book would be great for a girl of any age. *wink* It would make a neat surprise gift.", "rating": 5.0, "upvotes": 13.0, "downvotes": 4.0, "helpfulness": 0.7647058823529411, "phelpindex": 0.848758853821578},{"reviewtext": "I bought this book as a activity to share with my neice who is 8.  We both loved it.  The book is full of inspiration and helpful tips like how to use your finished creations and also how to use scissors more accurately and how to glue without making a mess.  The papers and accents they supply are really nice and the fashion stencils are perfectly engineered.  It comes with everything you need except the scissors.  I enjoyed it so much that I bought another copy for myself and for some of my crafty friends who love fashion.  I really think this is a great craft book and I've recommended it to many friends.  The Klutz products are always clever but this one is really special.", "rating": 5.0, "upvotes": 51.0, "downvotes": 1.0, "helpfulness": 0.9807692307692307, "phelpindex": 0.8869434660215525},{"reviewtext": "My sister gave this book to my girls, ages 6 and 8.  For over three hours, those two little girls were so involved with creating their very own fashion designs - all without their mother's help! I think it is one of the best Klutz books I have seen and definitely recommend it for pre-teen girls as well.", "rating": 5.0, "upvotes": 16.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8697390185218503},{"reviewtext": "Ready for Hearts to meet Spades and Whist? Well then you are ready to play Wizard Deluxe. US Games has a true game of skill and strategy. Wizard Deluxe requires the players to make sure they only bid what they can take  and no more.The game is fairly fast paced and requires at least three  players. I found that have four or more really makes the game enjoyable. It  is skill  and thought that makes you the winner in this game. Since there  is very few pieces, cleanup an d storage are no real problem.US Games  has included very simple and easy to follow instructions. The rules are  bi-lingual, which is a really nice addition to the game. The age of play is  from 10 to adult, but I found that this game might be a little advanced for  some of the younger players.Wizard Deluxe is a great gift for any  occasion and is very reasonably priced. So if you are looking for a great  family game or a game for those weekend get together, go out an get Wizard  Deluxe Card Game.", "rating": 5.0, "upvotes": 52.0, "downvotes": 3.0, "helpfulness": 0.9454545454545454, "phelpindex": 0.9163975771978186},{"reviewtext": "A phenomenon! Indeed, Eric Litwin (the author) and James Dean (the artist) have created a phenomenon with both their book (Pete the Cat: I Love My White Shoesand the stuffed animal that makes a must-have companion.If you have two (or more) children/grandchildren, go ahead and get two (or more) Pete the Cats. They will not want to take turns holding him as you read this wonderful, whimsical book to them. The price is well worth the prevention of sibling arguments that will surely ensue if each one cannot hold Pete while you read the story. Besides, they will entertain you with Pete's song and story for a good while. I can guarantee that!I bought only one (!) for my school library (I'm the librarian), just received him, and have not yet introduced him to the PK4 class that absolutely LOVES the story and song. It (the book) is the most amazing phenomenon I've seen in my six years as elementary level librarian. I'll amend the review after I see their reaction to the stuffed animal! I also must add that I bought two more books so that three children can take Pete home. I'm thinking I might let them \"check-out\" Pete the stuffed animal as well.Pete the Cat is labeled as \"plush,\" but it's not plush in the manner of a traditonally fuzzy, soft-fur, stuffed animal. He is soft but fairly firm and 14.5 inches high. The product information indicates Pete is suitable for ages three and up. I imagine that is because of the dangly legs, tail, and arms.Sssssh--I'll close with a little secret--even I, an aging Baby Boomer, love Pete the Cat, both book and stuffed animal!", "rating": 5.0, "upvotes": 47.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9518374632065999},{"reviewtext": "My grandson absolutely LOVES the book and asks me to read it repeatedly.  I have the \"Pete the Cat\" stuffed toy and he plays with it while I read the stories to him (and I actually was considering making a shirt with velcro buttons to reinact with the story).  After seeing the puppet, I just had to get it.  It is a nice size and is easy to maneuver.  My only disappointment is that only one of the buttons pops off (it is attached by a string so it won't get lost or disappear in little one's mouth) which I feel won't be as big a hit with the kiddies when reading the story because in the story, all 4 buttons pop off to reveal his belly button, and I believe my grandson will be trying to pop off all of the buttons and become disappointed when that doesn't happen.  I guess I will still make a yellow shirt for the stuffed toy where the four buttons can pop off, and will sew a \"belly button\" on the toy as well.  That way, it flows with the story in exact detail and my grandson will be able to reinact.  Thus, that's the only reason I gave it 4 stars instead of 5.  I think it will still be a hit with the little ones and would recommend.  I feel it would be great to have in a classroom for a Preschool or Kindergarten teacher story aide.Addendum:  I failed to mention that the shirt does close with velcro, and when opened does reveal a belly button on the puppet.  I discovered that on my own as it was never mentioned when I placed my order to get it.  Now my grandson likes to open the shirt revealing the belly button. ;)", "rating": 4.0, "upvotes": 21.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8272406732908122},{"reviewtext": "This book is a delight for young children to read as the rainbow appears. But it ignores the science of rainbows by merging two distinct colors -- indigo and violet -- into a single purple ribbon. There was no need to do this, and the result is that children learn about rainbows but learn the wrong thing. Why wasn't it made with the correct seven colors versus only six?", "rating": 1.0, "upvotes": 5.0, "downvotes": 11.0, "helpfulness": 0.3125, "phelpindex": 0.5666242981494278},{"reviewtext": "Of the 40 or so board books that my 15 month old owns, this is one of the 5 that he shows the least interest in reading.  There are two bears rolling on the grass on every page, and this provides no opportunity to use a variety of vocabulary.  His favorite board books are Dear Zoo by Rod Campbell, All About Me by Dawn Sirett, Baby Faces by Dorling Kindersley, I Love Colors by Margaret Miller, Baby Says Peekaboo by Dorling Kindersley, Bathtime Peekaboo by Dorling Kindersley, Baby Talk by Dawn Sirett and Victoria Blackie, Little White Duck by Bernard Zaritzky and Joan Paley, Touch and Feel Farm by DK Publishing, and Where is Maisy by Lucy Cousins?  All of those are read 20 times as often as this one.", "rating": 1.0, "upvotes": 12.0, "downvotes": 1.0, "helpfulness": 0.9230769230769231, "phelpindex": 0.6143890085168434},{"reviewtext": "This is the fourth of the \"How to Host a Murder\" series murder mystery parties I've done (the other three being Roman Ruins, The Class of '54, and the Maiming of the Shrew) and is one of the more enjoyable ones.  It is easy to costume for and a fun time period to be working with, and the plot unfolds such that if you're paying enough attention it's actually possible, but the last round, to figure out who did it.We also made the prarie chicken recipe that was included in the Host's Guide, which was very tasty and liked by all our guests.", "rating": 4.0, "upvotes": 26.0, "downvotes": 2.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.8827335676499828},{"reviewtext": "This is our seventh \"How to Host a Murder\".  We found this particular murder mystery to be a bit distasteful.  First - there was a character named Chief Breaking Wind - to me not all that funny unless you're a 13 year old in gym class.  Second - some of the character lines made homosexual references/comments.  Some people may enjoy this and find it funny but for our group (i.e. all heterosexual couples) it was more awkward rather than fun.  Surprise - none of the straight men wanted the homosexual title.  Now if they were the guys running around with the ladies it would be a different story.  Third - there were references to sexually transmitted diseases.  Making jokes about sexually transmitted diseases does not make me bust a gut laughing nor does it make it sexy or fun.  This was one of the few murder mysteries that we did not enjoy.  Our favorites mysteries have been Roman Ruins, an Affair to Dismember, and Hoo Hung Woo.  Don't waste your money on this one.", "rating": 1.0, "upvotes": 7.0, "downvotes": 4.0, "helpfulness": 0.6363636363636364, "phelpindex": 0.6644268926211413},{"reviewtext": "Truly, it looks as if it must be a great game, but the instructions are unclear. I am not a brain surgeon (though why we always use this profession to exemplify the epitome of intelligence, I don't know), but neither am I a schlub; nevertheless, the rules for play remain opaque to me. I am relatively certain that upon hearing the answers to the questions that I have, I would hit my forehead with the heel of my hand with enough force to cause a life-threatening indentation and exclaim, \"How obvious!\" But the online forum didn't seem to address them, so my forehead remains undented.", "rating": 1.0, "upvotes": 6.0, "downvotes": 34.0, "helpfulness": 0.15, "phelpindex": 0.6082741033805817},{"reviewtext": "If you like bored games, card games, basket weaving, cleaning the lint off your sweaters, you might like this. My daughter and I tried, really tried, to learn and like this game. I even still hold onto a forlorn hope that we still might, but we failed to become engaged, or amused by it and after a few hours went back to isolating with our iPads.", "rating": 2.0, "upvotes": 0.0, "downvotes": 15.0, "helpfulness": 0.0, "phelpindex": 0.6342062320830724},{"reviewtext": "First let me say that I love Gloom and some of the other expansions.  However, this expansion makes the game fairly complicated and pretty unbalanced if you have less than 6 players playing (requires other expansions as well).  Most of the other expansions work great even if you only have 3-4 players, so I'd suggest getting one of the others first.", "rating": 2.0, "upvotes": 15.0, "downvotes": 1.0, "helpfulness": 0.9375, "phelpindex": 0.6325489021547234},{"reviewtext": "This strategy card game is fun, quick to set up and doesn't have a lot of pieces or rules to keep track of. I've played with 2 players and with 5, and it was just as fun either way, which is unusual for this genre. It takes about 10-15 minutes per number of players.The objective is to build 8 buildings and gain the most points, which are printed on the building cards. Each turn players act as one of the characters and use the abilities: collect money for certain districts, steal from or assassinate another character, trade or draw extra cards, be the first to choose a character, destroy a character's building, etc.Characters are drawn secretly, and at least one is randomly excluded. Each character goes in a predestined order, and collects money or cards, may build, and can use their ability during their turn. Whoever gets the king chooses a character first for the next round, giving them an advantage. The strategies change as the game goes on, and you're always wondering what another player is going to do, if they can sabotage you, if you can foil them, and eventually who is going to call the game by building their eighth building.", "rating": 5.0, "upvotes": 33.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9337901787736214},{"reviewtext": "Even if you have no idea what a German game is, or why a name like Reiner Knizia is important, this is a great, original and fun game.  If you think this is just another attempt to make money from the cash cow that Tolkien's works have become, you're dead wrong.Even if you're already a boardgaming veteran you've probably not seen mechanics like this very often. Instead of competing against each other, players must cooperate as the Fellowship to destroy the one ring before Sauron destroys them all. Sometime this means a player must sacrifice him/herself for the benefit of everyone in the game.  Amazingly, it works and even players who get eliminated feel as if they contributed to something worthwhile (and in many cases stay very focused on the outcome of the game, as they have a vested interest in seeing the Fellowship survive).  The game is even fun with two players - but be warned that the difficulty ramps up quite a bit when the Fellowship is so small.The components are impressive and are endowed with the great John Howe's artwork. There are no movie images to be found here - which may depress or delight you, but it does add to the sense that this game holds its own without needing to resort to pandering.Does the game have any educational value?  Hmmmm...I dunno about that one. I suppose it could encourage older kids to value cooperation a bit more than they usually do, and any kid who hasn't been enthralled by Tolkien's work might have a nice introduction with this game, but the ultimate goal here is to have a good time - not necessarily to educate.", "rating": 4.0, "upvotes": 31.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8989309781737826},{"reviewtext": "Extreme adventure, fun and good time. It is a really hard game to beat, specially if you add both expansions (one even allows one of the players to be a Dark Rider and battle against the fellowship). I have played it with friends and everybody have had lots of fun; however be sure you play it with cooperative and no competitve people. You really need each other so as to win the game; if not you won't even reach the end of Moria.Don't waste any more time and click the \"add to cart\" button so as to begin with this exciting journey through all middle earth (Moria, Helms Deep, Mordor, Shelob's Lair) and the expansion's Isengard and Bree.", "rating": 5.0, "upvotes": 10.0, "downvotes": 1.0, "helpfulness": 0.9090909090909091, "phelpindex": 0.9156069301887116},{"reviewtext": "who has a weekend to spend trying to learn a board game.  the game is way too complicated to begin playing without reading and re-reading the instructions.  then comes the need to recruit two other people that have nothing better to do with three plus hours (estimated game length once you've learned how to play).  also through other reviews, i've learned that the twilight imperium has game play imbalances that are very difficult to overcome.  the gaming dept for this title should host a forum where people that play this game can meet up with other people that play it.", "rating": 1.0, "upvotes": 8.0, "downvotes": 225.0, "helpfulness": 0.034334763948497854, "phelpindex": 0.5796874983639696},{"reviewtext": "Twilight Imperium is one of the best games I have ever played. As a student at college, my friends and have 1-2 board game nights per week; with Twilight Imperium and Acquire being the most played games. I would highly recommend this game, though the learning curve is rather steep (an hour at to learn the rules) and the game takes a long time to play (4+ hours). If you are looking for a conquest game like RISK, stop reading now. Twilight Imperium is based on maneuvering, preparation, and diplomacy with few significant battles in the game.The game is played to victory 10 points and unlike most war games, conquest is not the only means of victory. Points are acquired through capturing planets but also \"researching\" technology, and political decisions. The method of determining turn order is also quite original. Each player chooses a card (1-8) which in addition to being the order in which the players play, gives each player a special ability for that round. To further add interest each card has a secondary ability which all the other players can use when the player owning the card uses it. As a result not only are broad discussion (like conquest or technology) important but every turn can be critical as the players ability to ace often depends directly on when and how the other players act. This may seem as if it would slow the game, but a restriction on how many turns a player can take per round keeps the game moving nicely but keeps strategy extremely important through out.This is not to say I don't have a few complaints about the game. The first couple of times we played we noticed some imbalances which led to certain having a definite advantage and the game always trending in the same way. There are 3 ways to get these points. Every player can complete common objectives, a new one being revealed each turn. A player gets 2 points every time they get the 8 card, and a player has a secret objective which can be worth two points. Our problem was that everyone accomplished the same common objectives. Because the 8 is so valuable, whoever went first had to take the 8, the person on their right then always took the 1 (and so they chose first next turn), so they could get the 8 next turn. Anyone who failed to follow this pattern automatically became 2 points behind, and never could catch up. The result is that there is little strategy to taking the 8 or the 1. Finally the secret objectives vary greatly in difficulty. As a result players who got easy secret objectives, or got to go first were far more likely to win. In fact in our first 3 games (5 players), the player who went first won 2 of them, and the only player that completed his secret objective in the 3rd game, won that one. At this point we were ready to give up on the game but instead we played around with the rules and came up with a slightly variation which greatly helped improve the game. If you do buy this game I highly recommend trying this variation after playing the normal rules a couple of times.Rule Variation:Many of these rule variations were taken from the Twilight Imperium Rule Variations which can be found (...)1) The 8 card's text has been modified to the Game Option: Ancient Throne which gives a player 1 point for controlling Mecatol Rex. This modification greatly increases the strategy in choosing the 8 or 1.2) Long War Variant: Play to 14 victory points. This will be necessary due to rule change # 3.3) A player receives 2 victory points if they capture a planet in an opponent's home system. A player may only get points for a home system once. If the owner of the home system was not in control of the planet when it was captured this is reduced to 1 point. The reason for this rule was to encourage conquest (something that was seriously lacking in our previous games). The point reduction rule is to help prevent two players from allying to take a home system (since one of the players will not get all the points).4) Every player receives 2 secret objectives. After creating the board but before the first turn each player must choose and discard one of them. This rule helps reduce the problem of unbalanced (in terms of difficulty) secret objectives.5) You may only complete public objectives if you control all the planets in your home system (you may complete other objectives however). This allows players to slow down a player who gets too far ahead.6) Destroyers get 4x Anti-fighter barrage. Destroyers are the weakest units in the game; this makes them a little better, but still hardly worth using.7) The common objectives are laid face up on the table (you may still only complete the first after the first turn, second after the second, etc). This reduces the luck involved near the end of the game, as every one knows what is coming.8) Technology can be purchased with influence or resources (but no combination). This rule helps balance the planets so everyone has more equal resources.These rules seem to be very effective. While most players still get all of the common objectives, winning the game now depends on controlling Mecatol Rex, completing secret objectives or taking home systems. Players have been very successful using any combination of these three methods, and no race has done better or worse than any other. While these may seem to lead to large amount of conquest, this has never been the case, with only 3-10 major battles occurring in 4 player games.", "rating": 5.0, "upvotes": 85.0, "downvotes": 1.0, "helpfulness": 0.9883720930232558, "phelpindex": 0.8996174873979049},{"reviewtext": "I love Lovecraftian themed games. Unfortunately, it's very hard to find one that's done properly, be it a board game or a video game. I love the theme, but when I got my group together to play a test game, it ended up with a lot of confusion, character deaths, and one poor guy stuck in another world for two FULL turns. The turn orders have FOUR phases! It takes a long time to get any thing done. And even if you try to work with the other players, the mass hordes of monsters will devour them first. This game is supposed to be co-op. But when you can't figure out what you're supposed to be doing, all the fun is pretty much killed. You can find more concise rules and alterations that people have made on Bord Game Geek's site. Fantasy Flight also has some explanantions on their site. I recommned this game for its theme and if you have a huge amount of patience and a good dose of imagination. But if you want something that's fun and not fiddly, I recommend Steve Jackson's Munchkin Cthulu card game.", "rating": 2.0, "upvotes": 4.0, "downvotes": 10.0, "helpfulness": 0.2857142857142857, "phelpindex": 0.7447833294578058},{"reviewtext": "I bought this game when it came out. Since then, i have purchased the Black Pharaoh and Dunwich expansions, and we (a group of 5 of us) easily say this is one of our favorite board games ever. The game assumes that you already know something about Lovecraft and the Cthulu Mythos, although if you don't, it does not mean you can't enjoy the game. It just means you might not really understand why a Hound of Tindalos drives you so insane, or what exactly an Elder Thing is.The unique aspect of the game is its cooperative play. With 2-8 players (with 4-5 being the sweet spot) you work together to defeat one of many Great Old Ones that are intent on destroying Arkham and possibly the entire world. Each game changes the GOO you fight, and there are multiple investigators to pick from, so you aren't playing the same hero each time either. Add to this mix hundreds of common item cards, unique items, spells, and encounters for dozens of locations, and you have a game with practically unlimited replayability.The object of the game is to move around the board, either fighting or evading monsters that spawn from gates, while collecting clues and having encounters. You can try to seal the gates and prevent monsters from coming through them, but if you don't act fast enough, the GOO will eventually awaken and it comes down to a final combat that is sometimes impossible to win.One thing dissenters say about this game is that you have to manage lots of \"fiddly\" bits. And true, you have a ton of playing pieces to arrange and manage throughout the game: your health, Sanity, clues, cards, skill sliders. But once you get into rhythm of the game it all comes naturally (although it will take around 3-5 games to get used to it).[...]Note however, that the game becomes increasingly harder with each expansion you add. As of this writing, The King in Yellow comes out this month, and it is going to add a whole new level of difficulty to an already hard game. But the key to AH is this:THE FUN IS NOT IN THE WINNING.It is just in the playing, even if you lose horribly (and you will) it is fun seeing just HOW bad you lose. Sometimes the game seems to be alive and is plotting against your every move.Ok, that's enough ranting. I can't say enough good things about Arkham Horror. Buy the base game, and then slowly integrate the expansions to keep the options coming. It only gets better.", "rating": 5.0, "upvotes": 198.0, "downvotes": 4.0, "helpfulness": 0.9801980198019802, "phelpindex": 1.0252797423310416},{"reviewtext": "The WOW board game is a well put together game overall, and relatively fun to play... at first.I'm not going to rehash the points made by the other reviewers, as they are valid, but the overall experience is what leads me with a middle of the road review.The game is great from the standpoint that you incorporate RPG elements in \"building\" your character... the quests and items all lend a distinct flavor to the game, but the mechanics of the game are what drag down the rating.From a fun factor standpoint (which is why we play GAMES, no?) the game drags you along for a 4+ hour ride.  At first, it is relatively enjoyable.. but eventually the game wears thin and gets repetitive.  VERY repetitive, despite the various quests.Eventually it becomes not much more than a turn-swapping, roll massive amounts of dice ordeal.  Combine this with one \"slow\" player or a \"tactically slow/meticulous\" player and you could find yourself waiting in excess of 20 minutes for a turn to come up.The beginning of the game moves quickly, but as the mechanics stay the same and the game does not mature with the character progression, the game is doomed by folks waiting on line for a turn.  It almost seems as if the game can be played independently from the other players save when a PvP element is introduced into play.  Based on this standpoint, luck is often the determining factor in who is the victor (who drew the better cards, strategy aside).So it's good, it's long, and then it gets strained... and eventually the strain saps the fun out a promising idea.", "rating": 3.0, "upvotes": 14.0, "downvotes": 2.0, "helpfulness": 0.875, "phelpindex": 0.8131539348320369},{"reviewtext": "Have sat down with friends twice now and played this game. We are all long time gamers and are familiar with fantasy flight's way of doing things which no doubt helped us learning this game. That being said, the only negative thing I can say about this game is that it takes a long time to setup, and can be slow until you have really got the rules down. Once you have a handle on how things work though, battles are fast and challenging. So far I have always been the overlord, and have enjoyed it. The heroes all seem to enjoy it as well. The same guys that complain in other games whine about the overlord being too powerful, but it really seems well balanced. I am looking forward to playing more and if we continue having fun in the long run (which I see as a very likely possibility), I will be getting the expansions as well.", "rating": 5.0, "upvotes": 16.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9269372746045068},{"reviewtext": "Arkham Horror is perhaps the second most complicated board game in history, so when I heard that this expansion would make the board BIGGER by adding a whole additional town, plus adding two other worlds, new rules and cards AND the Dunwich Horror itself, I was intimidated.  I mean, how many rules, cards and tokens can one person keep track of? After playing it a few times, I got the hang of it and loved it. Dunwich is a village that is only accessible through Arkham's rail station, and it has its own locations and collection of unusual characters.  There's a new twist up there that makes you want to kill the monsters up there in that if any monster moves into a \"vortex\" (that's new), you get closer and closer to the Dunwich Horror showing up, which isn't as powerful as an Ancient One but close enough to wipe you out.  A must-own for Arkham Horror fans (and if the new board is too much for you, you can just take all of the new cards and use them in the main board anyway).", "rating": 5.0, "upvotes": 21.0, "downvotes": 1.0, "helpfulness": 0.9545454545454546, "phelpindex": 0.934576113480866},{"reviewtext": "Kingsburg is a worker placement board game designed by Andrea Chiarvesio and Luca Iennaco. The game is published in the United States by Fantasy Flight Games. For its price, quality and game play: Kingsburg is the best gateway game on the market.Players strive to score the most victory points. You score victory points mostly by building. In order to make buildings, players must have resources: gold, ore and wood. Buildings give players several benefits such as bonuses to battle, extra resources, and manipulation of dice rolls.Players have a town mat in front of them. This shows which buildings they have built. The buildings on the far left are entry level. To make buildings, you must have both the appropriate resources and have built all the other buildings to left of the desired building. Thus, long term strategy is required when deciding which building paths a player will take.Players acquire resources during the productive seasons (spring, summer and fall). There are 8 phases in the game of which 3 are productive seasons. Players roll three dice (6-sided dice). Players play one or more dice onto the game board. The game board has 18 spaces numbered from 1 to 18--representing all the advisors from the Jester (1) to the King (18). To influence an advisor (and receive the bonus thereto), a player must place dice with the correct total onto that advisor's space. Thus, to influence the Jester, a player must place a die with a \"1\" onto that space. If you didn't roll a \"1\", you cannot influence the Jester. Players can place multiple dice onto an advisor in order to influence the more powerful advisors; again the total of the dice must equal the advisor's value.Some advisors give victory points (the Jester and the Queen); some give soldiers (the Sergeant, Captain and King) and most give resources. If a player influences an advisor, no other player may influence that advisor during that season. So there is an important strategy to where to place your dice.There are 5 years (8 phases each) in the game. During the 8th phase of each year, there is a battle. Players must defend the kingdom from the kingdom's enemies (goblins, orcs, barbarians, etc). If the player's battle total from soldiers, buildings and the king's aid is greater than the enemy's total, the player is successful, else the enemy wins. It is possible (and quite probable) that some players will be successful while others will be unsuccessful. Those who are unsuccessful are sacked by the enemy, losing the appropriate buildings or resouces listed on the enemy card. Those who are successful gain the booty listed on the enemy card. After 5 years, the game ends and the player with the highest victory point wins.Kingsburg is easy to learn for non-gamers. The iconography is intuitive which aids to its gateway nature. There is a great deal of replayability in Kingsburg also. There are plenty of ways to win.The only problem with Kingsburg is the way the battles are handled. The king's aid is a die roll. This eliminates so much strategy that it renders this aspect of the game meaningless. The expansion solves this problem luckily.If you want a fairly cheap game with great replayability and that's also the best gateway game on the market, I highly recommend Kingsburg. If you like Kingsburg but think something is missing, I also suggest picking up the expansion.", "rating": 4.0, "upvotes": 19.0, "downvotes": 2.0, "helpfulness": 0.9047619047619048, "phelpindex": 0.8551393988053206},{"reviewtext": "What this is: a CCG-type fantasy strategy game with some board-game-ish components to give a nice tactile feel to things. The goal: to accumulate 15 Power tokens (representing political clout) before any other player. Plays 2-6.This game is beautiful; let's start with that declaration. The core set includes 4 pre-made decks for the Stark, Lannister, Targaryen, and Baratheon Houses; six grey plastic moulded pieces that represent various courtly positions like Crown Regent, Hand of the King, Master of Coin, etc.; really pretty Gold Dragon coins and blue Power pieces; and a very nice, durable board for the coins and power pieces that centers the field of play nicely.Onto the gameplay: there are three different types of attacks or \"challenges\" that can occur - military, intrigue, and power (aka political). Each character is marked as able to participate in some (generally, not all) types of challenges, meaning that deploying a character that can handle Intrigue on a field full of Military and Power characters can lead to a broadening advantage.Different types of Challenges yield different results: successful military challenges let you kill off the defending player's characters, intrigues force the defending player to discard random cards from hand, and power challenges let you poach Power points from your foe. Intrigues are probably the least direct in achieving victory - holding the lead in in-play characters gives you Power points late in the turn, and Power challenges directly grab them for your side - making Intrigues sort of the \"Dishonor\"/bad guys strategy.Finally, a very neat gimmick is the Plot Deck - reminiscent of the old Middle Earth CCG's long-events, i.e. cards that linger from the start of one turn to the start of the next, then are discarded, but produce some game-changing effects temporarily that can be really nice. These cards are actively chosen from a special, small deck, meaning you can pair a short-term strategy with your long-term goals. Plot Cards also have \"claim\" - this affects how much oomph successful Challenges have, and can make a huge difference if you pull off more than one Challenge in a single turn.All in all, this is an excellent game with solid components, clear and helpful rules and rulebook, and a fascinating strategy that builds on such CCG classics as Magic, Battle Tech, Middle Earth, and Guardians (tangentially, anyway). It executes its design with a very strong flavor all its own, and its mechanics are distinctive. A very worthwhile purchase!", "rating": 5.0, "upvotes": 76.0, "downvotes": 1.0, "helpfulness": 0.987012987012987, "phelpindex": 0.9682581259957133},{"reviewtext": "This game requires to much time to learn and play. I assembled a group of hardcore BSG fans to play one evening. After 3 hours we all had played 1 turn! Take a page from BSG and nuke this game.", "rating": 1.0, "upvotes": 3.0, "downvotes": 41.0, "helpfulness": 0.06818181818181818, "phelpindex": 0.5245844804628642},{"reviewtext": "This is a rare boardgame that's lots of fun and is also true to the show.  Most movie/tv tie-ins are cheap attempts to cash in, but this really feels like playing a character on Battlestar Galactica.It's mostly a cooperative game, but depending on how many people are playing, one or more players are secretly Cylons or Cylon sympathizers that are working against the human crew.  This makes it fun to play again and again, because you never know who is going to be the Cylon next time.It's very well made and will last for many years.  The instructions are very clear with lots of examples that made it easy to learn, plus you can go to [...] or the publisher's website ([....]for tips and updates.", "rating": 5.0, "upvotes": 15.0, "downvotes": 2.0, "helpfulness": 0.8823529411764706, "phelpindex": 0.9119109958359455},{"reviewtext": "I figured that this would be like the Talisman Expansion packs before like the dungeon or the city, but all this comes with is some plastic figurines (which is nicer than the cardboard the original comes with, but really who cares), bigger character cards (big deal) and fate points.  Fate is not really much of a concept in my opinion.  See other reviews for a description.  Anyway, I wish I hadn't bought it, but I don't think I will bother to return it.", "rating": 1.0, "upvotes": 4.0, "downvotes": 49.0, "helpfulness": 0.07547169811320754, "phelpindex": 0.5812185774567054},{"reviewtext": "This game has several things going for it. ADVANTAGES:1. The artwork is quite good2. The overall look and feel of the game components is aesthetically pleasing3. The theme is ever present and well thought outThe DISADVANTAGES are too great for me to recommend this title:1. Too much luck and too little strategy. Most choices are no brainers. The only difficult choice to make is when to go to the inner ring of the game. Even this decision can be based on your current stats in a fairly simple way. If you have &lt;=7 of your primary stat (strength or craft) then don't go because you will not survive, if you have 8-9 go only if someone else is headed that way, if you have 11 or more then go unless you are running very low on lives, fate, or your secondary stat (strength or craft).-You must collect strength, craft, fate, and lives in order to ensure victory when entering the crown of command but how much of those you have is based on avoiding dumb choices and being lucky.-You may be playing very well as far as choices but be set back very badly while someone who has been playing no better is far ahead and these positions may swap in a few turns based solely on the luck of the roll.4. The game feels like a mix between Munchkin and Candy Land. Those games both have their place. Munchkin is a funny game that has minimal strategy and is played for laughs and candy land is a cute game to play with kids when they are still too young to enjoy strategy. The problem is this game is probably too complicated for younger kids and is not funny so it looses 2 of the best advantages from those 2 games but retains some of the main disadvantages.WHO MAY LIKE IT:1. Kids whose parents play DnD but who are still too young to play themselves. This game is nothing at all like DnD in any way that counts (no role-playing, no strategy, etc). But to a young kiddo it could be a fun way to become accustomed to a fantasy setting, rolling dice to determine victory in battle, and making choices based on stats. There are probably better games that could fill this role.2. People who played the classic. If I played this back in the day then it would be a nice blast from the past.3. People who enjoy Monopoly and fantasy but who don't mind a game that has little strategy. This game has less strategy then Monopoly (few long term choices, no trading, etc) but has some things in common (dice rolling is the main mechanic, movement around the board that is continual throughout the game, etc.)I hope this helps!", "rating": 2.0, "upvotes": 22.0, "downvotes": 9.0, "helpfulness": 0.7096774193548387, "phelpindex": 0.7518181849194434},{"reviewtext": "The above item arrived in sealed box... but with missing components...1. The 10 Story Cards2. 24 Story markersThe Rule book also emitted there existence from the contents of the box... but then illustratively displays and shows how to play the game with the above missing components that are a must... as they are core game component... for the game to be a game and not just game pieces in a box...I have emailed the company they have emailed me back claiming that the above items were shipped to me...", "rating": 1.0, "upvotes": 0.0, "downvotes": 15.0, "helpfulness": 0.0, "phelpindex": 0.5679358355470745},{"reviewtext": "Let me start off by saying that I'm a huge Lovecraft fan. I've read his stories, seen quite a few amateur films, and Arkham Horror is one of my favorite games ever. This game, while I really wanted to like it, just doesn't capture the atmosphere of what I think a Lovecraft or Cthulhu game should.I will say that the cards and board are durable enough. I also enjoy the little Cthulhu statuettes (in fact they're probably my favorite part of this package when it comes down to it). Even the artwork is great, though some images are obviously recycled over from Arkham Horror. What's worse is that these images are given to characters that are completely different from the characters in Arkham Horror that share the same artwork. It makes this game feel pretty cheap in that respect.Now for the game play itself. I must be the only one on here who thinks this, but this game feels like a less-fun version of Magic: The Gathering. You assemble a deck of different factions that include Cthulhu himself, investigators, professors/educators, mobsters, The King in Yellow, and Shub'Niggurath. There are certain rules in place so that you can't have the most evil and most good characters in play at the same time, but different factions do have their strengths and weaknesses. You sacrifice cards in order to use them as resources to pay for other cards, which I'm not a fan of. Like most card games, you have your characters, attachments, and general event cards.The object of the game is to claim \"story cards,\" which are placed on the game board. Both players have to work at completing the story while making sure the other player doesn't finish it. What bothers me is that, once a story is completed, usually something good or bad happens to BOTH players. This gives the player who completes the story a sort of hollow feeling. Yes, they completed a story, but there is no reward for doing so while penalizing the other player. It is just replaced with a new story, and the game continues.In order to succeed at a story, characters committed by both players to a story measure up against each other in different challenges that deal with such things as sanity, investigations, lore, and straight-up damage. Whatever characters survive determines who gets the progress token. In theory this may sound fun, but each time I have played this game there seems to be a distinct disadvantage for the human characters. While they usually can do a fair amount of damage, the supernatural beings of Cthulhu, The King in Yellow, and Shub'Niggurath are sometimes invulnerable, and almost always have the ability to drive other characters insane, while the human characters do not. This gives them a huge advantage since characters that are driven insane are basically worthless until 2 turns later.That is basically the game in a nutshell. There isn't any sort of story being told (despite the fact that you are trying to succeed at \"stories\"), hardly any sort of flavor text to familiarize people with why things are like they are, and the game really feels like Magic: The Gathering Lite. The only major differences are that you're trying to succeed at stories instead of attacking each other, and the challenges the characters have to partake in while engaged to a story. This is one of those games that I don't really understand why everyone likes it so much, but I just must be the minority here. While I am a big fan of Lovecraft, I do know poor adaptations of his work in the form of games, movies, and the like when I see them, so I'm not going to love this game just because of that fact. It's a fairly simple and straight-forward game, and if you haven't played Magic: The Gathering, it may come across as being more unique. Either way, this wasn't the game I was hoping for.Pros:- It's a Lovecraft game- Artwork and durability are both good- Cthulhu statuettes are awesomeCons:- Borrows too much from games that came before it (doesn't feel very unique)- A tremendous amount of balancing issues- No sort of atmosphere is presented nor is a story told- Whatever advantage or disadvantage for completing a story is shared for both players almost all of the time. There is no incentive to complete stories other than to win.- Recycled artworkBottom Line: Arkham Horror is a much better choice, albeit a lot more complex of a game. I haven't played Elder Sign or Mansions of Madness, but I can imagine that they're better choices also.", "rating": 3.0, "upvotes": 14.0, "downvotes": 5.0, "helpfulness": 0.7368421052631579, "phelpindex": 0.7395099425040519},{"reviewtext": "Call of CthulhuDesigner:Nate FrenchEric M. LangThe first thing I must say is that I am a fan of the literature of H.P. Lovecraft. So much so that being in New England I have visited the sites of several of his stories. I think every student of literature should read the opening paragraphs of the Call of Cthulhu. I don't agree with his outlook on reality, but his ability to write prose is genius.I am also a gamer, there are many CCG products with a good theme, but horrible game mechanics. On top of this many CCG products are money pits which keep card store owners smiling, but are limited in who you can play with.THE CONCEPT OF COC LCG:As a former fan of the COC CCG I remember the lack of attention given to this game. If you go on You Tube you can still see the \"Demonstration Game\" played with someone with a black robe and another guy. Not only was this of little help understanding the game, it was almost spoofing the game itself.When Fantasy Flight released three games in the LCG format, they made the best core sets I've seen. The directions are no longer little inserts folded into a pack of cards. There is a mounted play board, neat Cthulhu tokens to use to drain your resources. Excellent video tutorials, and individual web pages and support.You truly can by the Core set, organize interesting decks and play some balanced games from the start.The mechanics of the game are well done, but they require some getting used to. You must build resources,sacrificing some of your cards and battle for \"Story\" cards. At the same time play tactics and special abilities.Characters from Lovecraft's stories and quotes from the stories themselves add to the excellent artwork on the cards.The rulebook does a good job in explaining this. Deckbuilding is made simple by asking newbies to shuffle two factions together and add some neutral cards. As you gain experience you can go online for tips.My beginning question was regarding if this game made sense to buy in these times. If you were thinking of getting into a customizable card game genre, the LCG are really the way to go.I have played Warhammer: Invasion, it's a lot of fun. If you are familiar with the Warhammer universe, that might be your first choice. I have not played the Game of Thrones LCG so I can't give a yeah or neah on it. The Call of Cthulhu is a great game which can make the genre affordable. (You can still go nuts and get every expansion pack under the sun if you want to die a pauper like Lovecraft himself, but it isn't required.)Now I'll let you know my devious plot. The hardest thing in CCG is getting someone to play outside the confines of the FLGS. Well, I gave the core game to some family members as gifts. I have a good supply of partners who without intervention by a van of deprogrammers have been bit by the Cthulhu Mythos and are a phone call away.This is a fun and challenging game you should consider.", "rating": 5.0, "upvotes": 15.0, "downvotes": 3.0, "helpfulness": 0.8333333333333334, "phelpindex": 1.0317296155438151},{"reviewtext": "Well, I'm not overwhelmed with satisfaction.The graphics are beautiful and Invite play. The additional figurines are very well made and attractive in only the way Cthulhu can be. I was really looking forward to playing this game.I'm familiar with the topic and Lovecraft, but this is a very complicated game. I was looking for games for two adult players so I thought this would be fun. My husband and I spent about half of the day after Christmas trying to play this game using the written instruction and playing the website tutorial on the laptop in front of us and got nowhere. We couldn't even tell if we had the game set up correctly (we are college graduates with four languages between us and we felt pretty dumb by the end of the day).This may have been our first real role playing game attempt. I'm not quite sure. I thought Risk was a role playing game, but it's pretty straightforward, so maybe not.We are determined to learn this game, so we welcome comments.", "rating": 3.0, "upvotes": 2.0, "downvotes": 11.0, "helpfulness": 0.15384615384615385, "phelpindex": 0.7735939758904034},{"reviewtext": "The title of the package is misleading:  These aren't &#34;clear&#34; sleeves.  They're sleeves that are clear on one side and frosted on the other.  I failed to see that before I ordered. You have to really read into the small print to see the difference. I'm too lazy to return these, so I used them for a game I didn't intend to sleeve at all. I wanted clear sleeves, not &#34;clear/frosted&#34; sleeves.  So, I dock two stars because the title is wholly misleading.That said - shipment was quick, service was good.  Just...for the love of all that is holy, update the title to be more reflective of the product.", "rating": 3.0, "upvotes": 14.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7402975511041809},{"reviewtext": "This game's excellent.  It's EZ & fun & gripping but it's quite long!  I don't mind this but some others might.This game simulates the 17-year period between Bilbo's 111th b-day & Gandalf \"taking\" Frodo out of the Shire...This game is supposedly for 5 players but can be enjoyed with only 2 - which I have!One player plays Sauron & it's minions & the other(s) play hero/es gathered by Gandalf to stop him from finding the Ring before Gandalf does (& thusly the Lord of the Rings actually begins).The Sauron player actively blocks the questing heroes with his plots & perils & monsters.  If Sauron's plots come to fruition (with a great mechanic) the War of the Ring doesn't even start because he found it!If the hero/es win, concluding the quests, blocking Sauron's plots & schemes, then, all the events in the book can proceed to it's fateful conclusion - Middle-earth is saved!Seems like a hefty price for a game but, believe me, it is worth it, even just for the quality on the whole.  The rules are beautifully laid (concise & awful good to read), the art is superb, the craftmanship of the game is excellent; however, about the highly detailed figures - there was one faulty batch (too brittle) - however, no worries, as Fantasy flight Games (the manufacturers) will replace them for free!I wholeheartly recommend it for most all fans & non fans, ages from 10 onwards!Game on!", "rating": 5.0, "upvotes": 16.0, "downvotes": 4.0, "helpfulness": 0.8, "phelpindex": 1.009154335034768},{"reviewtext": "I've been a fan of Fantasy Flight Games for awhile now but they have come out with something special in this title.Pros: A Fast, Fun, Easy, Dynamic, Game.Cons: Really needs 4 players to achieve balance, somewhat pricey for a board game but not unreasonable for what you get.To start, the game is made from a traditional hard cardboard fold up style playing surface that is thick and durable. The pieces are plastic miniatures similar to Axis and Allies or Twilight Imperium. One drawback is the thin plastic used for the staff on the Cultist pieces breaks very easily but all the other pieces are very sturdy.The rules are simple to explain and game play is easily learned with about 20 minutes of explanation and after one game turn is well understood. The simplicity of the rules system does not detract from the game however as it is similar to chess in minutes to learn lifetime to master. Play balance is such that, of the four games I've played to date, all of them were decided in the very last turn with only a few points separating first from second.With four new players expect to play for about three and a half hours and once everyone is familiar with game play you could crack out a full game in a little over two. Setup is very fast taking maybe 5 minutes.In the heart of the game each player takes on a demon faction vying for dominance of a mid-evil world with the one who corrupts the most locations or advances the fastest winning, however if time runs out all can lose. What makes this game very fun to play is the random event cards that shift the balance of power from one faction to another forcing players to come up with new strategies to win each time they play. This randomness also means that you will never play the same game twice. There is quite a bit of strategy for a game with such a simple play system. For people who like games with alliances and diplomacy this isn't the game for you, as diplomacy in Chaos in the old world generally is expressed as \"what are you planning to do there?\" once a move has been made and alliances are non existent.Overall I would highly recommend this game for its ease of play, fun and its potential to introduce people to nontraditional (monopoly) style gaming.", "rating": 5.0, "upvotes": 14.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9701630878541235},{"reviewtext": "The \"Pegasus\" expansion for the Battlestar Galactica board game changes many things about the gaming experience players of the core BSG set have come to know (and sometimes dread). The goal is to simulate, in game form, the latter half of season two of the Battlestar Galactica TV show--with the arrival of the Battlerstar Pegasus, the internecine strife with Pegasus, the settling of New Caprica and subsequent Cylon oppression there.1) New Human CharactersAdmiral Cain has the \"blind jump\" ability which, at the cost of some civilian ships, gets the fleet out of tricky situations that could cost the fleet even more ships. Anastasia \"Dee\" Dualla has the ability to move all civilian ships on the board, hopefully out of harm's way. Louanne \"Kat\" Katraine is a hotshot pilot with the ability to use the numbers on skill cards (+2) she discards instead of die rolls. And Ellen Tigh--the only Human who draws the new Treachery skill cards--can usurp the Admiral or President title for one turn at a key moment. Of all of them, Cain sees the most play in games I'm involved in.2) Playable Cylon LeadersYes, now you can start the game as one of three Cylon leaders: Cavil, Leoben Conoy, or \"Caprica\" Six. You can only play as a Cylon leader with four or more players involved. Cavil can make a Cylon Basestar appear on his turn, hounding the fleet mercilessly. Leoben can trade Skill cards from his hand with the Destiny deck, influencing Skill Checks. Six can steal cards from a player, but gives them the option to replace that card from outside their normal skill set. The Cylon Leaders have a way to infiltrate the fleet to help or hinder the Humans' struggle for survival. When they are infiltrating, they can activate locations and use Skill cards as if they were Human players. Cavil seems to be the strongest Cylon Leader by a large margin.3) Cylon Leader AgendasInstead of drawing Loyalty cards, the Cylon Leaders have a hidden agenda that they must achieve in order to win. Depending on the number of players in the game, this agenda can be drawn from the hostile or friendly deck...though some of the hostile agendas are friendly and vice versa. I'd say about half of the new Cylon agendas are difficult and half are easy. And half of them (4 in the friendly deck, 2 in the hostile deck) require that the Humans win in order for the Cylon Leader to win.4) PegasusThe ship that this set is named after makes an (optional) appearance on a seperate small game board. Admiral Cain is the only character that starts the game on Pegasus. Pegasus has four new locations: Pegasus CIC, Airlock, Main Batteries and Engine Room. CIC lets you fire on Cylon Basestars and Main Batteries lets you fire at Cylon Raiders, however, using either location risks damaging friendly ships or Pegasus itself. The Airlock is part of the new Execution mechanic, where you can have a Skill Check and kill off another character. If they're a Cylon, they go to the Resurrection Ship. If they're Human, the fleet loses Morale and that player gets a new character. The Engine Room may be the strongest location, since it allows a player to discard skill cards to put a \"jump\" icon on any Crisis card, moving the fleet faster towards New Caprica.5) New CapricaThis is the new \"end game\" for the BSG board game. It's easier to get to New Caprica than it was to get to Kobol in the original core game. But getting to New Caprica doesn't end the game, it starts a different one. New Caprica, like Pegasus, is a seperate smaller game board where all the players, both Human and Cylon, go when the fleet jumps far enough. The Humans need to unlock all the captured civilian ships and get them ready for evacuation when Galactica returns to rescue them. The Cylons, seeing the Humans will not comply with their plans, are trying to destroy all the civilian ships and detain all the Human players. There is a new New Caprica Crisis card deck that all the players switch to once they arrive on New Caprica. These Crisis cards are usually pretty brutal for the Humans and their dwindling resources.Once Galactica arrives, a large space battle ensues. The Admiral can choose to leave New Caprica and end the game whenever they want--once Galactica arrives. But any ships left behind on New Caprica are destroyed (and their resources--mostly population--are subtracted from the fleet's total) and any Human players on New Caprica are executed, losing Morale for the fleet. So a Sleeper Agent Cylon Admiral could be even more of a dangerous foe than before.6) Treachery Skill cardsTreachery is the newest Skill card. All Cylon Leaders (and Ellen Tigh) can draw Treachery cards. Treachery cards count as negatives in almost all skill checks. For the most part, their text punishes the Humans for playing \"reckless\" cards before Skill Checks (see below) and for discarding unwanted Treachery cards from their hands and for having Humans (or infiltrating Cylon Leaders) in the Brig or in Detention.7) \"Reckless\" Skill cardsThere are new \"reckless\" Skill cards for four of the five (all except Piloting) Skill decks from the original game. When you use a \"reckless\" card to affect a Skill check--giving a positive effect--you open up yourself to the Cylons playing Treachery Skill cards that could endanger the fleet.8) New Cylon BasestarsInstead of the flat cardboard Cylon Basestars of the original game set, the new Cylon Basestars are very cool and plastic and three dimensional. The only problem is that the Cylon Basestar damage tokens can no longer be placed on the Basestars, unless you balance them carefully.9) New Cylon LocationsEvery Cylon location except the Cylon fleet has been changed in some way for the Pegasus expansion. The Resurrection Ship is no longer a legal destination unless you're a Cylon in the fleet revealing yourself. But you can now stay there and draw many Cylon Super Crisis cards. The Human Fleet location allows you to see the top card of the Crisis or Destination deck then, if you're a Cylon Leader, infiltrate the fleet. Crisis cards used to bedevil the Human fleet from the Caprica location now allow the \"jump\" icon to be used.10) Other New CardsThere are non \"reckless\" Skill cards for all of the five Skill decks from the core game. Some of the new cards allow you to take an action in your Movement step. There are many new Crisis cards (depicting events from the latter half of season two of the TV show--including one that causes \"Scar,\" the most feared Cylon Raider, to come into play) added to the regular Crisis deck. There are also a few new Destination cards with new game effects.Final Thoughts...Pegasus is a great expansion. Some people will like adding the Pegasus and New Caprica game boards, some won't. Population is the fleet resource most in danger in this expansion, followed closely by Morale--as opposed to Fuel in the core game set. Cavil's once per game ability (he can take three actions in one turn) can be devastating. Having the ability to execute players will make some players quite happy (and others not so much). My only quibble with Pegasus is that the new rulebook could be a bit more comprehensive. Lots of questions come up that aren't addressed in the rules or the online FAQ. But FFG and the game designer are fairly prompt in responding to rules questions.All in all, I say that Pegasus is a great expansion for a great game and will keep people entertained long into 2010.", "rating": 5.0, "upvotes": 56.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7542613535469662},{"reviewtext": "I'm a fan of the Warhammer universe and though I own the 2nd edition of WHFRP, I haven't played it much.  My mainstay game lately is D&D; 4E, though I've played or run most of the major RPG systems from the last two decades.I find WHFRP 3rd edition to be a splendid mix of some of my favorite aspects from other RPGs combined with a few new mechanics and unique game concepts.  This game pushes the bar up for quality and design thinking and I hope it influences future RPGs.I know the MSRP is a little high, but at Amazon prices, this is a steal!  This box is HUGE and beautiful.  Of course everything inside is high quality material and full color, as you'd expect from a company like Fantasy-Flight.  The books are not hardcover, but they are full color with thick, glossy pages.Certainly the books could have used another run at editing, there are lots of typos, but none so far that make the rules confusing.  That's the only quality issue I've noticed so far.The rules are simple but powerful.  They offer a wealth of options for players and plenty of flexibility for the GM.  I feel the rules sit somewhere between Savage Worlds and D&D; 4E in complexity.  The core of the rules is easy to remember: you create dice pools and roll them to determine results, the specifics and exceptions are noted on cards in front of the players.  You rarely reference the books during play.  Cards are used to great effect throughout the system.Though there's a boardgame feel to the components, this is very much a true RPG.  It's a nice mix between the freedom and danger offered in older RPGs and the tactical options and balance that a system like D&D; 4e presents.The system and components are tightly integrated.  Everything fits together really well.  The feel of the Warhammer world is definitely stitched into the rules but the GM can easily run any type of campaign he wants, not just dark and dangerous.  There's plenty of room to take the system and suit it to your group's style of play.For those of you who dislike grid combat, you're in luck.  For those prefer D&D; 4E style combat, it's not difficult to adjust the rules to accomodate a grid.There's very little math involved in the game.  You're not constantly rolling numbers and adding modifiers and comparing to other numbers.  This is all accounted for in the construction of dice pools.  The options players and GMs have in building dice pools really make the system shine.I could say so much more.  I could go on about the party system, the stance system, the way the game supports narrative play, or how fast it plays, but I'll stop here.  The game does a much better job of explaining itself, and you owe it to yourself to at least check it out at your FLGS if you're on the fence.", "rating": 5.0, "upvotes": 67.0, "downvotes": 10.0, "helpfulness": 0.8701298701298701, "phelpindex": 1.0119914249367472},{"reviewtext": "I was very excited about the new Warhammer Roleplay game. Unfortunately, after actually running the game (as a game master), I was deeply disappointed with the results, and so were all the players (4 in total). The cardboard components in the box, that were supposed to speed up the gameplay, actually slow it down considerably. The dice pool mechanism is cumbersome. With the one set of dice in the box, the players will constantly have to rebuild their dice pools each turn, making for an extremely slow and boring experience. Even with extra dice, you will still have to spend time each round to adjust your dice. This is much more time consuming than in other games where you just have to add a few pluses and minuses to the roll of one die. In the same manner, it's much faster jotting down on a piece of paper the number of rounds needed to recharge something instead of looking for small and annoying counters that keep getting lost or mixed with each other.I was also in constant fear of losing components of the box. There isn't really a way to replace a missing component (except for buying the expensive box again). A certain ability card is gone? Well, no player can use that specific one anymore.One other problem is that with this box you can run a game for only 3 players, which is below the standard number (4-6 players) people are accustomed to in roleplaying game. Not only that, but the components in the box weren't even enough to run the demo game (downloadable PDF). There's only 1 counter to represent a beastman. Want to run an encounter with 2 or more separate groups of beastman? Well, tough luck, you cannot easily do that.The game feels incomplete. For example, while many schools of magic are listed, you can actually play a wizard from only two of them. Yeh, expansions will probably be released (one is already out), but just imagining the number of loose components one would have to carry with him to play the game in 3 years time makes me shudder.To sum up, the reliance on components in the game is its downfall. Not recommended.", "rating": 1.0, "upvotes": 41.0, "downvotes": 21.0, "helpfulness": 0.6612903225806451, "phelpindex": 0.6910271262336325},{"reviewtext": "This is a travesty. Thank you, FFF, for destroying an iconic  franchise and abandoning what made Warhammer great. Clearly, they're going after 'new' gamers, which isn't a bad thing in and of itself, but they've done it in such as a way that basically gives the middle finger to the fans who have carried Warhammer over the years - essentially the people who are responsible for Warhammer still being around today. Alas, as we've seen with D&D;, this is what happens when corporate duechebags get involved in the gaming industry.If you're into fantasy themed board games (and you're already used to paying $100 for a board game) you might like this , but this isn't Warhammer roleplay. You can't dig deep into what makes Warhammer great: the setting and mythos. Playing this is like expecting a beautifully prepared meal and getting a boxed lunch instead.Warhammer FRPGRIP1986-2009", "rating": 1.0, "upvotes": 7.0, "downvotes": 22.0, "helpfulness": 0.2413793103448276, "phelpindex": 0.628043887957024},{"reviewtext": "I have been a big fan of FFG games for some years.  It has been many years since I played an RPG (Role-playing game) but the articles on the FFG site describing this game's development intrigued me - so I took the plunge when I saw the great price here at Amazon.As it turns out this is a wonderful game for newer RPG players, or those like me returning after some time away.  It has excellent rules and tools to support new players while having lots of innovative techniques and features for experienced players.You need to be aware that some owners of the previous editions hate the new one for a variety of reasons and have littered the internet with poorly argued rants against it, at least see if you can try it at a friend's place or local game store and make up your own mind.  If you don't like it then - fine - let us know why so it helps more folks make their own minds up.As others have described here the game is card and token based, which is very visual and tactile - while the rules and the dice support storytelling.  If you do come to like it there may well be added cost down the track - FFG is planning a line of supplemental products which have me tempted already.", "rating": 5.0, "upvotes": 11.0, "downvotes": 5.0, "helpfulness": 0.6875, "phelpindex": 0.9749574337051711},{"reviewtext": "The game is long and a bit complex, takes some serious devotion to play. I have yet to play but its a cool board game,.", "rating": 3.0, "upvotes": 0.0, "downvotes": 12.0, "helpfulness": 0.0, "phelpindex": 0.6504924348240652},{"reviewtext": "Not an easy game to play. Risk is betterSo much going on, very complicated and need atleast a few people", "rating": 3.0, "upvotes": 0.0, "downvotes": 14.0, "helpfulness": 0.0, "phelpindex": 0.6558128992712022},{"reviewtext": "I own and play both the first and second editions, and unquestionably, the second edition is both fairer and more strategic. Adding ports, removing Robb from the Starks (he's back but with a much less game-breaking ability on his card), setting up the Martells in the south to compete directly with Baratheon as well as Tyrell are all important steps. To me the biggest change though is adding that starred * Consolidate Power tokens now allow the faction to Muster, in that square, a number of points equal to the strength of the castle/stronghold (ie 0/1/2) there-- without a Mustering card. In doing so you sacrifice the 1/2 power tokens though. Adds a lot of depth, not to mention strategic choice, early in the game.However, the game really could have gone through some play testing. The Greyjoys now have ridiculous House Cards, so, with just a little careful husbanding and an early first clash of kings, they can wipe the Lannisters entirely out of the game. There are very few defensive moves Lannisport can make. (One game they used their *Consolidate Power every turn to pump out ships, but even with a fleet of 3+2=5 (their supply max), the Greyjoys wiped them out with a mere 2 ships (because they'd held both stars and the Sword, but mostly because of the House Card Victarion Greyjoy). Just nothing they can do about it.)Further there is a noted problem with the boards shipping warped and being of poor quality.All in all with 5 or 6 people, the game is fun. Fans of the series will enjoy it, but so will Diplomacy-type board game players (for all its kluged-on mechanics.)", "rating": 3.0, "upvotes": 33.0, "downvotes": 10.0, "helpfulness": 0.7674418604651163, "phelpindex": 0.8351307154783609},{"reviewtext": "With FFG usually producing top notch games I really wanted to love this game.  Sadly, I was just not able to.  The production quality is top-notch, and up to FFG's very high standards.  However, the game play was rather random.Basically one:Draws a tile or explores a space at which point they may fight a monster.  While the dungeon rooms are all inspired, there are many tiles that can spell instant death to your character (putting you out of the game) or require a skill roll - this being a simple mechanic that works rather well.  Fighting monsters on the other hand is an entirely different story.  Combat is essentially a card game, and while each character and monster may influence the composition of their \"hand\" with a single card draw, that is the only time the character itself influences combat in any way.  That is, character stats / abilities do not come into play in combat.  Combat uses a card deck that a hand is drawn from (except the one card from the characters cards) and then hands are refreshed form the combat deck until combat is over.  While this is an interesting mechanic, it was a bit disappointing that my elf archer could not choose ranged tactics, or decide to close to ranged, etc.This game is also not cooperative play - each player starts in a separate corner.  This is not entirely bad, but anyone expecting Descent or Warhammer Quest will be severely disappointed. While I was not necessarily looking for similarities, I was expecting at least some RPG similarities.If you are looking for a very simple, usually quick game (death can come fast and furious - last one standing is a good thing, if you can escape) then this may be the game for you.  If you want a game where you are playing a character or want cooperative party play then I suggest looking elsewhere.", "rating": 1.0, "upvotes": 16.0, "downvotes": 18.0, "helpfulness": 0.47058823529411764, "phelpindex": 0.6564843675224269},{"reviewtext": "Hi.  This is a great game to play by yourself if you like dungeon crawls.  I've only played it solo which is what I got it for.  The games are usually pretty quick because the dungeon is so lethal to your character.  Some games might only  last 5 minutes.  You can play it many times without getting tired of it.  I've played it about 30 times and my success rate was about 20 percent.  It is very random and some would say unfair but that is pretty much the name of the game and what makes it fun for me.  There is some strategy to which path you try to take and playing a card at the right time but it is a very programmed game.  It is a game of \"Let's see how far I get before I die and how will I die THIS time.\"  It's very much a black comedy.  It's never TOO frustrating when my character dies.  Part of the reason for this is that the game is so fast.  Just play it again.. and die again.  The timer and your health points make for a lot of tense game play because you have to leave the dungeon before the clock runs out or your health runs out.  The different stats for the characters also call for very different strategies.  The dwarf is great at fighting monsters but if he draws a lethal trap card his Luck skill will be his demise.  The wizard is just the opposite.  Also some characters seem easier to play.The original combat system is a little clunky using cards but there is an official dice combat variation on the Fantasy Flight website.  The original combat isn't horrible but the dice version is much faster.  I have left the game set up on a table for days where I can sit down and play it when I have half an hour to spare.  And that's half an hour for a complete solo game.  I'd buy this game again in a heartbeat.", "rating": 5.0, "upvotes": 14.0, "downvotes": 2.0, "helpfulness": 0.875, "phelpindex": 0.9965465733186879},{"reviewtext": "Civilization is not for lazy readers who refuse to invest a few hours in learning how to play a new game.That said, this is an awesome experience.  Already my roommates and other friends have played several games, and now that many of us know the rules thoroughly each game will take less and less time to complete.Yes, the rule book is sometimes ambiguous, yes it takes nearly a half hour to set up, and yes the games can take up a lot of daylight.  Our first 4-player game took about 7 hours, but it was intense and exciting and ultimately we friends had an excellent time in each other's company.  Having learned how to play and gotten used to the pace, we've completed more recent games in as little as 3 hours.The depth that was put into this game is incredible; for every action there is a proportional counter-move.  Think chess and Risk combined, but far more complicated.  You can really tell that the makers spent countless hours testing and retesting to make sure everything about the game meshes together.I'll say it again, if you have time (several hours) to learn how to play this board game, access to 4 patient people who are willing to play, then absolutely buy this game.If, on the other hand, you doubt you will have the time or patience to learn how to play and actually get a game in, forget it, this is not for you.  Don't expect it to be exactly like the PC game.  You will find that many of the strategies used there will not help you in the board game.  Another important thing to note is that you will need a LOT of space to play, especially when playing with 4 people.  Probably the entire dining room table.If this sounds like something you'd enjoy, and you have some free time to invest, go for it; you won't regret it.", "rating": 5.0, "upvotes": 25.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9566443136106146},{"reviewtext": "**ORIGINAL REVIEW (5/28/11)**: If I were rating the game itself, I would've given it 4 stars minimum. However, rating the core set from the perspective of a standalone product, I (reluctantly) can't give it more than 3 stars. I don't feel that what is contained in the core product is sufficient for long term enjoyment of the game. Allow me to elaborate.Per the rulebook, if you are going to create a custom deck (a tournament legal one anyways), it has to be a *minimum* of 50 cards with no more than 3 copies of each card. What you get in this box is 4 starter decks with approximately 30 cards each. I'm not implying a deck need be tournament legal for casual play or to be enjoyable, but you'll have a difficult time dealing with the harder scenarios \"as is\". The reason you need a second core set for 3-4 players is becuase Fantasy Flight knows that the 30 card decks alone aren't going to cut it against harder scenarios. (You can, however, use the starter decks against the Mirkwood scenario quite easily, though players 3 and 4 will need to find another way to track their threat.)While it is possible to mix two starter decks together of different themes, it becomes impractical to do so. You really need a second copy of the same deck (and therefore a second copy of the core set) to get cards you really want to play with in sufficient number. You can never start with more than 3 heroes (and so if you are playing with a mixed bag, you can never have anything other than a 2/1 split or an even more impractical 1/1/1 split) and since you can't play additional heros later (generally speaking, though there are events that let you play them from your discard pile), if you happen to lose your only hero of a certain resource, you can't play any card in your hand of that resource type for the rest of the game. This limitation of resource generation and consequently deck building, I feel, is a flaw of the mechanics itself which is why I wouldn't rate this a 5 star game, even if I were reviewing the game rather than the Core set product.While I do think this game will improve over time, particularly if they address the difficulty in blending your spheres of influence for deck building (or at the very least giving all sphere types availability to cards that allow you to replay heroes), right now I believe it is enough to hinder the single Core set owner from really enjoying the game as much as he or she should be able to. I would've liked to have seen more robust starter decks (why do I need 4 starter decks in a Core set only intended for two people?) or at the very least suggested deck variations for advanced play. As it stands, you're going to have a hard time playing the middle difficulty scenario with 2 players rocking starter decks and you may as well forget the hardest scenario, while the simplest scenario is a cake-walk and isn't really very engaging for more than a play or two just starting out. (Seriously, the difficulty jump from Mirkwood to Anduin is kind of ridiculous.)If you're planning on playing the game, I suggest trying it first, if possible, to see if you enjoy it, and then expect to pony up enough $$ for a second Core set. And even though this isn't a TCG, you're going to have to build some comfort with deck building. I like the game, I think it's fun, but I can't rate what I feel is an incomplete product higher than 3 stars. And by incomplete product, I mean, I feel that you are not given the resources required for 2 players to adequately complete the 3 scenarios supplied.**UPDATE (7/24/11)**: After a few more weeks of playing this game, I've decided I don't like it very much. Even after buying the second Core set, I am finding deck building to be a chore. As I am attempting to stick to the prescribed 50 card decks with only 3 copies of each card, I find I can really only make two decks that are worth a da**. Even if you wanted to just make a mono sphere deck, you have to buy 2 Core sets for 2 copies of the 30 card starter decks and even then, you have so many garbage cards that are already at the 3 max, you really still can't make a deck that abides by FFG's own rules. And tying resource generation to heroes is an awful mechanic that has led to so many NPE (negative player experiences) that I am now stuck with 2 Core sets and the first expansion that nobody in the gaming group (myself included) really wants to ever play again. The Gollum expansion was highly disappointing, but I'll save that for another review.The purpose of the LCGs was to move past the expensive hobbies of CCGs while retaining some of that flexibility of deck building and enjoyment of that style of gameplay. I feel LOTR isn't really significantly cheaper to get into (the power gamers that would spend a lot on, say, Magic are likely the ones that would buy 3+ Core Sets) and while in theory the mechanics seem solid, there a few aspects of the gameplay that make it notably inferior to other gaming experiences out there. This could have been so much better. As a fan of the book, movies and Decipher's LOTR TCG years ago, I really was looking forward to new and innovative adventures into Middle Earth but this really doesn't deliver.", "rating": 3.0, "upvotes": 49.0, "downvotes": 12.0, "helpfulness": 0.8032786885245902, "phelpindex": 0.7220638498457933},{"reviewtext": "Pros:- High quality cards and components.  Like most FFG games, the cards are well made and the art is fantastic.- Box says 1-2 players, but you can unofficially play up to 4 players with just 1 core set, it works fine, but you will be playing with just the pre-constructed decks- Has a solo play option if you can't find someone to play with, or want to test a new deck idea- Is Wife/Girlfriend compatible.  As a co-operative game, many people have reported that they can get their wife/girlfriend to play with them, while they cannot get them to play a competitive card game likeWarhammer Invasion Core Setor MTG.  This is the primary reason I bought it, and on that count, it delivers.- Playable out of the box (1 of the pre-constructed decks is really, really bad solo though).  You could buy this game, and nothing else, and still get many hours of entertainment out of it for 2-4 players.  I can't imagine a single core set holding a person's interest for *that* long if they are only playing solo.- 2 player game is well balanced in terms of difficulty- Because it is co-op, its a good introduction to TCG/CCG/LCGs.- Has a scoring system, so you can compare your score on a quest to other people, or your previous score.Cons:- Limited deck construction choices with 1 core set (or even 2), but this will be fixed as more expansion packs are released- The solo game can be disproportionately hard.  The 3rd quest is virtually unbeatable (solo) with a single core set.  Few players with 2 core sets have even been able to beat it, and winning it currently relies on a lot of luck (the 3rd quest is ranked a 7 in difficulty, and is the hardest in the core set).- Difficulty can be very random.  All card games have good and bad draws, but some of the mechanics in this game are set up so that very strong cards can have no effect at all, just by chance.  The number of times this happens to you in a single game makes a huge difference in difficulty.  There are also a few cards that help you control this, making the \"odds\" tilt more in your favor.  Perhaps future cards will help it seem less random.- Game difficulty scales very poorly with more players.  3 and 4 player games are very easy (luckily, there are some very easy \"house rules\" you can add to make it more of a challenge for yourself).- Rules are somewhat complicated compared to more mainstream card games, such asDominion,Thunderstone (AEG) Board Game, etc.  This is not really a con, its just something to be aware of if you are new to this type of game.  Rules have a few things that are unclear, but the next FAQ will probably clear most of them up.- Scoring system is kind of simple, and decks have already been created that will get a \"perfect\" score if you are willing to play long enough.", "rating": 4.0, "upvotes": 53.0, "downvotes": 3.0, "helpfulness": 0.9464285714285714, "phelpindex": 0.8748398048440842},{"reviewtext": "This is one of the card games I hate the most. It's more like a puzzle game, you simply figure out the best possible deck for each scenario and hope for the best. because whereas you have no random things to help you out, the enemies have random shadow effeects that devastate your \"heroes\" (which are no more powerful than allies). I'm all for hard games, like ghost stories and demon's souls, but this game (unlike the ones i mentioned) IS NOT BALANCED. Don't waste your time on this game", "rating": 1.0, "upvotes": 7.0, "downvotes": 13.0, "helpfulness": 0.35, "phelpindex": 0.5900334435631149},{"reviewtext": "This particular unit has been around awhile (I also have one from London branded \"number puzzle\"), now rebranded by Franklin for an American release.First, there is no backlight.Second, some of the puzzles end where two answers are both correct, which drives some Sudoku purists nuts.But these are the Only drawbacks.The unit fits well in the hand, and is easy to use.  You can put in your own puzzles, pause, Undo, and toggle sound.I cannot imagine having a Sudoku handheld game whose screen isn't fully a touchpad, and which doesn't have the ability to put in puzzles from your favorite source!  And I can't imagine I'm the only one either!", "rating": 4.0, "upvotes": 33.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8533654866466869},{"reviewtext": "You can get this for $30 on the Fisher-Price website.  The shipping is less expensive, too.", "rating": 4.0, "upvotes": 46.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7179761033878789},{"reviewtext": "We absolutely loved this calendar that we orginally purchased directly from FP in 2009 for our son. We loved that we could teach our son the real meaning of Christmas. We all love it. This year we added a new member to our family and I knew we needed one just for our daughter too. The FP site sold out before I could order it so I turned to amazon. Unfortunately, we have now ordered two and neither have played the song \"silent night\" as stated in the description. Instead a nice white diamond shape is sewn over the words \"press here\". Big disappointment. Don't be fooled, don't purchase if you are looking for the original FP nativity advent calendar.", "rating": 1.0, "upvotes": 9.0, "downvotes": 2.0, "helpfulness": 0.8181818181818182, "phelpindex": 0.6186392579853907},{"reviewtext": "Lock & Key Diary 'All About Me' I received this last week & had to check it out to be sure it is what I want for my nine year old great goddaughter. She will love it. It has a nice cover, & what looks to be a sturdy lock. I checked that because on some other diaries for girls I see that several people reported having to buy new locks the first day. The pages are mostly lined & simple allowing for the child to do the expressing. but int the front cover it has flowers with places to write stuff like, \"my best friend is\", \"my nickname\". \"my birthday\", \"my favorite color\", & so on. Also the back inside cover has a few things for you to add. The first page is where you put who the diary belongs to. The rest are lined, blue, with a flower at the top & blank. To make it interesting I also bought \"Tear This Book Up\". There are so many things in there she can use with her diary or separately. Just a suggestion & I added for $4 1850 stickers by Lisa Frank. So I know this diary will have great flair, cause I am also including colored ink pens for her to use. I believe it will enhance her reading & writing skills a lot. You can't go wrong with this diary. I love it.", "rating": 5.0, "upvotes": 53.0, "downvotes": 1.0, "helpfulness": 0.9814814814814815, "phelpindex": 1.0087233697246556},{"reviewtext": "As with the other structure decks available, this is a good start for any novice for veteran Yu-Gi-Oh TCG player.While it may have less foil cards than the other structure decks, this deck more than makes it up for the strategies employed with the card combos. One general strategy that dinosaurs have is the ability to summon high-level monsters with ease, thanks to cards like Hunting Instinct, Miracle Jurassic Egg, Gilgasaurus, Fossil Excavation, or Big Evolution Pill. Many dinosaurs pack a big punch already, and to be able to get them on the field quickly to overwhelm your opponent makes the game so much fun for its user, and not so much fun for their opponent. Another strategy (one that I personally emphasize in my own deck), is to quickly remove one's own dinosaurs from play to power up his or her Tyranno Infinity. Other support cards like Dimensional Fissure, Survival Instinct, Soul Release, Skull Lair, and so on will quickly boost the attack of this only level 4 monster in no time. That card is the whole reason why I picked up this deck. I'm a little worried that it may land itself on the forbidden/limited list soon.FUN: I jumped back into this card game after a five year hiatus, and I'm wondering why I stopped in the first place. This time around though, I'm being careful of my spending on cards because it truly can become addicting.DURABILITY: Unless you have good card sleeves to protect your cards, they will weather away especially if the card is played in decks a lot.EDUCATIONAL: There is a lot of cognitive thinking when playing the game. There is much math and predetermined planning involved. In order to create the perfect deck for oneself, one must understand and take advantage of the cards and their relations with one another. It may not look it at first, but the skills and techniques used to play the card game well are characteristics that, when honed, will provide self-improvement. I am aware that this sounds a little stretching, but I can put a safe bet that there is much more brain activity when playing this game, than idling sitting on the couch watching television.The box contains 39 common cards, 1 Ultra Rare card, 1 official TCG rulebook, 1 gaming mat, and a strategy pamphlet that also recommends other cards to supplement this already awesome deck.The Card List:MONSTERS1 Super Conductor Tyranno (Ultra Rare)1 Kabazauls1 Sabersaurus1 Made Sword Beast2 Gilgasaurus1 Dark Driceratops2 Hyper Hammerhead1 Black Tyranno1 Tyranno Infinity2 Hydrogeddon1 Oxygeddeon1 Black Ptera1 Black Stego1 Ultimate Tyranno1 Miracle Jurassic Egg1 BabycerasaurusSPELLS1 Big Evolution Pill1 Tail Swipe1 Jurassic World1 Sebek's Blessing1 Riryoku1 Mesmeric Control1 Mystical Space Typhoon1 Megamorph1 Heavy Storm1 Lightning Vortex2 Magical MalletTRAPS1 Hunting Instinct1 Survival Instinct1 Volcanic Eruption1 Seismic Shockwave1 Magical Arm Shield1 Negate Attack1 Goblin Out of the Frying Pan1 Malfunction1 Fossil Excavation", "rating": 4.0, "upvotes": 23.0, "downvotes": 1.0, "helpfulness": 0.9583333333333334, "phelpindex": 0.9234395299199212},{"reviewtext": "if you are white, and enjoy talking like a hip, smooth, African-American, these cards will not help you. about 80% of the cards are dumb and the rest are already common knowledge slang words.", "rating": 1.0, "upvotes": 0.0, "downvotes": 11.0, "helpfulness": 0.0, "phelpindex": 0.5250200926619917},{"reviewtext": "A friend of mine bought the 4th Edition Red Box, which I then borrowed and read through.  I decided to shop around, and found this nifty box just sitting on the shelf at my local game store.  Since we had a group that were willing to try a Tabletop RPG system, but had never had any experience, I decided to buy it as an alternative to the divisive 4th Edition rule set.This is not a comparison of the actual full systems of D&D; 4th Edition and Pathfinder, but instead, just a comparison about what comes in the actual beginner's editions: the Dungeons & Dragons 4th Edition Starter Set (or the Red Box) and the Pathfinder Beginner's Box.Let's compare the two in each of the basic categories:BEGINNER'S GUIDE4th Edition: A 32-page manual stapled together on magazine-grade paper.  This is less a player's manual than it is a long, single-player choose-your-own-adventure.  Some of the rules that one needs to know in order to play 4th Edition are included here, including picking a race and a class, as well as how to roll attacks, but they are casually thrown in during the descriptions of the sample adventure.  There are no core rules really listed here, and anyone that would need to quickly roll up a character, research basic attack maneuvers, or find a description of gear, spells, or other abilities is going to be out of luck.  None of these basic functions are anywhere to be found in these 32 pages.  While a 32-page adventure sounds like a lot of fun, the adventure lacks a real storytelling hook, as most of the backstory and plot is required to come from the player's imagination alone.  Frustratingly little context is given by the guide itself.  Plus, the guide separates each scenario four ways for each core class (Fighter, Rogue, Wizard, Cleric), so you're only really playing through an 8 page adventure with very few branched paths.  All in all, the book intrigues a new player well enough to stay interested, but as a guidebook, it fails.  Once you've read it once and \"created\" a character, you'll never want to touch it again (unless you're forced to play through the whole thing again in order to create another character, which you will not want to do).  Overall, 4/10.Pathfinder: A 64-page fully-bounded book with high-grade, full-color pages.  Like the Starter Set, this also includes a single-player choose-your-own adventure.  However, this only encompasses the first eight pages, as opposed to the entire 32 page-booklet of 4E.  You can only play through the adventure as a basic fighter (as opposed to branching off so you can play a variety of classes) but this turns out to be an asset here.  As a first-time player, you are actually told a story, one of a simple citizen from a town called Sandpoint called forth from the mayor to stop a menacing foe that is lurking in a dungeon.  You learn the basics of rolling dice for attacks and skill checks, and encounter some dangerous traps and a formidable final foe.  It's a simple scenario that actually hooks you in with a little bit of adrenaline.  Shakespeare it's not, but it definitely hooks the reader to learn more.Fortunately, the last three-quarters of the book actually functions as a real player's guide, including the basics on how to choose a class, roll up attributes, figuring out ability modifiers, choosing feats and spells, buying weapons and other gear, and learning the basics of combat maneuvers and other functions a beginning player will need to know once they begin a game.  You could have someone read the Hero's Handbook and they would be ready to enter a full game of Pathfinder, save for not knowing a few of the more advanced rules that could be picked up on the fly.  The art styles are bright and vivid with high-quality artwork, and the writing style is equally compelling.  Overall, the Hero's Handbook is a solid resource even after a player has upgraded to the full Pathfinder Core Rulebook.  Overall, I'd give this book a 9/10.THE GAME MASTER'S/DUNGEON MASTER'S GUIDED&D; 4th Edition: A 64-page manual that is the same flimsy quality as the Player's Guide.  Again, this doesn't really function as a guide book as much as it does an adventure that you're supposed to learn as you play.  However, instead of trying to tell a story or investigate a full dungeon, it is instead just a series of battle encounters, separated in a way that feels devoid of a cohesive experience.  You'll see an example of how all of the player character's and enemies' pawns are laid out on the map, and then a description of how a battle between these two groups are supposed to play out.  You are intended to play through the encounter, and then start over with a different encounter with different enemies, learning a new basic combat maneuver.  While this might be interesting to battle game strategists, there is no \"Role Playing\" here: no storytelling, no character development, nothing that makes you feel like you're actually part of the adventure aside from fighting enemies.  Plus, this does again not function as a resourceful guidebook, as once you play through it once, you'll never need it again.  There are no tools here for an aspiring dungeon master to craft their own dungeon, stories, NPCs, campaign setting, or any other tool necessary to keep playing after this first adventure.  Your only choice is to play through the same encounters again, or shell out more money for the more advanced products, which will make this box seem redundant.  I would rate this a 3/10.Pathfinder Beginner's Box: A 100-page fully bounded book on high-quality paper.  As with the Hero's Handbook, the bulk of this manual consists of a full array of tips and tricks on how to become a good game master, with advice on how to create your own stories, battles, and various other scenarios, as well as descriptions of enemies and specialty items galore, with a few advanced rules that are important for an experienced GM to be aware of.  However, for anyone that doesn't want to have to deal with any of that nonsense to play a simple session, the manual opens with a mini-module, an adventure with a back story and plot hook that tells of a menacing force killing off local livestock; the players investigate a nearby dungeon to find the source of these disruptions.  The game master gets a full ten-room dungeon to have the players explore, and there are a variety of enemy encounters and traps that will use the quick thinking of the players in order to resolve in the best possible way.  It's a well rounded experience that will use the talents of all of the classes in order to best the system and make it to the end.  More importantly, it's fun, and that's the whole reason we're playing this, isn't it?  Again, the manual manages to best the 4th Edition Dungeon Master's guide at what it attempted to do, while still being a resource that actually teaches you the full game.  This gets a 10/10.MAPS/PAWNSD&D; 4th Edition: The maps that are used for the dungeon are made of folded up paper that is separated into different sections (each section sets up a different encounter).  While the paper looks nice enough, it's not something you're going to be able to reuse after the game is over, and it's really only printed to be a use-once-and-discard kind of item.  The pawns here are circular pieces of cardboard that are multisided, so that once you flip a pawn over, it represents a different character.  If you're setting up a new encounter, you will find yourself in a position where you must choose between two different enemies simply because they both take up real estate on the same avatar.  When playing the game, you are simply looking at a bunch of miniature coins set along a flimsy piece of paper.  You do get access to a bunch of playing cards (think Magic: The Gathering) with spells and abilities listed in detail on them.  While these are an appreciated touch, that they are needed at all makes the combat system seem overly complicated, and less like traditional D&D; than a different game.  Overall: 5/10Pathfinder Beginner's Box: The box contains one 20\" x 30\" flip map.  One side contains a fully rendered dungeon to go with the sample module in the Game Master's Guide, while the other side is a blank, beige mat that can be used with a dry-erase marker to make your own dungeon.  You could also use this side for general battles or other encounters.  The great thing about this flip map is that it's pretty impervious to dry-erase markers, tape, window markers, or any other device that you might want to use to hide portions of the dungeon or make adjustments as seen fit (My suggestion is to use Glass Chalk or a similar window marker to cover up the full map, using a washcloth and Windex to \"reveal\" new areas when the players explore them...post-it notes or taped construction paper could provide a similar function).  The pawns are impressive, as they are double-sided figures that stand up.  Not quite as satisfying as plastic miniatures, but are a lot more dynamic and decipherable than the tiny coardboard coins that come with the 4E set.  The pawns are also numerous, with approximately three times as many options than the D&D; set.  Overall: 8/10DICE4th Edition: A set of 6 black dice, including one of each die (4, 6, 8, 10, 12, and 20).Pathfinder: A set of 7 red dice, the above six and one 00-90 ten sided die for easy percentage roles.CHARACTER SHEETS4th Edition: A handful of single page character sheets that use a simplified ruleset than the actual 4E one.Pathfinder: A similar number of double paged character sheets, with listed skills, as well as plenty of room for spells, equipment, and abilities.  Also included a four pregenerated character sheets, containing two double sided pages that describe the basic functions and options for each character.  This makes it even easier to just jump into a game, even when a couple players don't know all of the rules yet.DOWNLOADABLE ADD-ONS4th Edition: A single \"adventure encounter\" that consists of an all-too-brief setup and single battle.  While this is, from a storytelling standpoint, a step-up from the basic Red Box books, it still has no real value from a role-playing standpoint.Pathfinder: Four downloadable expansions: (1) A \"Beginner Box Player Kit\", which gives the setup to a fifth class (the Barbarian, in addition to the Cleric, Fighter, Rogue, and Wizard already included), plus other tips and other rules left out of the basics in the main manual; (2) \"Beginner Box GM Kit\", which contains a second adventure that, while not as good as the included one, is nice to have on hand for free, as well as some other general useful information; (3) \"Beginner Box Bash Demos\", which is a series of mini-adventures that are usable in extending a campaign with those that want more value out of their basic kit; (4) \"Pathfinder Society Character Creation Guide\", which includes basic rules to create a Pathfinder character usable at an official Pathfinder event.In every single category, the Pathfinder box clearly trumps the D&D; 4th Edition set, with the lone exception of price.  I hate to say it, but this is another example of \"you get what you pay for\", as when you buy the Pathfinder Beginner's Box, you'll still likely find use in the two guidebooks, flip-mat, and pawn-figures for months to come, if not longer.  If you give the Beginner Box to a couple of 12 year old boys, they may be able to entertain themselves through many play sessions with only what's included in the box.  If you bought them the 4th Edition Red Box, they would likely be amused for a few hours before either becoming bored or clammoring for the next product in the D&D; essentials line (the more expensive Dungeon Master's Kit).I heartily endorse the Pathfinder Beginner Box.  I actually bought a second one, just for the reference material and extra pawns alone.  If you're brand new to RPGs, this is a great place to start.", "rating": 5.0, "upvotes": 242.0, "downvotes": 12.0, "helpfulness": 0.952755905511811, "phelpindex": 0.5055686760341424},{"reviewtext": "Overall I really like it, it just misses the mark for me, see I find the full PF game system just too damn big and crunchy for my tastes, I was really hoping for a set of rules like the old D&D Basic & Expert (old Red/Blue) box sets, allowing you to play up to at least 10 or 15th level, something to use as a main set of rules, for us who don't have time for these huge mega books with a million and one rules crammed in them and a thousand splat books but capping it at 5 levels kinda sucks, I hope they bring out maybe another box set and expand it a few more levels, maybe to 14th level like the old Expert set, that would be nice.", "rating": 3.0, "upvotes": 6.0, "downvotes": 9.0, "helpfulness": 0.4, "phelpindex": 0.9648530907577904},{"reviewtext": "This toy has captured my 7-yr-old son's imagination. It beat out an iPod, hexbugs, and zoobs (all great toys too). It's not totally intuitive, so be prepared to spend some time teaching kids how to use it. But after a half hour of working together, he's sending it around the house telling everyone merry Christmas. I was skeptical, based on the price, worried that it might be flimsy. The keypad is a bit tough to use (sometimes over sensitive sometimes under sensitive). But for $60, that's not unreasonable. It works exactly as advertised and he LOVES it. If you have a kid who idolizes Grant Imahara, this toy is a must!!", "rating": 5.0, "upvotes": 16.0, "downvotes": 3.0, "helpfulness": 0.8421052631578947, "phelpindex": 0.9260773961452078},{"reviewtext": "Cool stickers, size is ok. They are a bit more darker than the photo posted here. They are squared trimming, i thought they were trimmed on the border of the image.. Nice anyway :)", "rating": 4.0, "upvotes": 18.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7478351863987178},{"reviewtext": "We purchased these cards because they were to have \"answers on the back.\"  Yes the answers are on the back, but so is another math problem.  The answer is in \"fine print\" in a corner.  The description is misleading.  Answers on the back should mean that 7+3 is on one side and 7+3=10 or 10 is on the reverse, not 8+4..These cards are not conducive to \"children checking their answers\" as claimed or to dividing up which problems are known since another problem is on the back.  Walmart carries similar cards with math problems on both sides and the \"answer on the back\"  like these.Also does not include all math facts to 12.  I pulled the +3's and only had about half the facts.  I assume the publisher is relying on someone explaining to child that 5+3 and 3+5 both equal 8.  The problem is that rather than being able to learn all the +3 facts one has to study a hodge podge and mentally learn two steps 5+3=3+5=8.  Very disappointing that this is not spelled out in description, other reviews or on box.I will not be buying other products from this publisher.", "rating": 1.0, "upvotes": 74.0, "downvotes": 13.0, "helpfulness": 0.8505747126436781, "phelpindex": 0.6075767463426511},{"reviewtext": "The non profit I head, Tools of Learning for Children has been helping preschoolers learn to read for 12 years. About 2000 kids a yer. We are expanding our scope by developing a program that will teach them the basics of math and numbers.  the abacus is essential in teaching numbers as quantities. I would like to review again a year from now after our pilot program is complete. About 300  4 year olds are participating in the pilot.. Initial responses of teachers has been excelent.", "rating": 5.0, "upvotes": 1.0, "downvotes": 12.0, "helpfulness": 0.07692307692307693, "phelpindex": 0.8810178061123981},{"reviewtext": "The Fudge system dates back to 1992, and is the longtime \"free\" system.  A key feature is Fudge dice, labelled + + - - and blank, blank.  Roll four of those, and you'll have a result from -4 to +4, with a score of 0 most likely.  Fate made changes and improvements to the Fudge system.The latest Fate Core System (FCS) book raised $433,365 in a Kickstarter campaign.  It's a rather good book, but I got it after buying Fate Accelerated (F-A), which turns out to be a slightly different system.  In both systems, you'll make a character by defining unique qualities and flaws that they have: High Concept, Aspects, Flaws, and Stunts.  In F-A, a character attempting an action has 6 approaches: Careful, Clever, Flashy, Forceful, Quick, or Sneaky; assigned the bonuses of 3, 2, 2, 1, 1, and 0.  For an action, they make up a story of what the character tries.  A swashbuckler might be Flashy +3, Quick and Clever +2, Forceful and Sneaky +1, and Careful +0.  I really liked this other book -- 48 pages, great layout, and a system like I haven't seen before.  The role-playing and storytelling incentives are high in this one.Back to Fate Core System, the book here.  When I got it, I looked through it for the above. FCS is instead a Skill based system: Athletics, Burglary, Contacts, Crafts, Deceive, Drive, Empathy, Fight, Investigate, Lore, Notice, Physique, Provoke, Rapport, Resources, Shoot, Stealth, and Will. Ten of these are assigned bonuses of 4 3 3 2 2 2 1 1 1 1.  As with F-A, characters have a high concept, aspects, and stunts.Search for Fate Core, and the Evil Hat site has a PDF of the system available as a pay-as-you-like download.  Do people play this system?  Yes, it's currently the third most popular after D&D;/Pathfinder and Savage Worlds.  Some of the games based on it are Starblazer Adventures,Legends of Anglerre,Dresden Files, and Nova Praxis.I like the system a lot.  But the book gets a bit repetitive in several places.  Their example character Landon has the aspect \"Manners of a Goat\" -- mentioned on pages 14, 35, 37, 45, 66, 69, 73, 77, 212, 230, and 298. There is a great layout for a character sheet on pages 6-7, explaining where to find Aspects, Stress, Extras, Refresh (for Fate Points), Skills, Stunts, and Consequences.  They should have had similar page spreads for the sample characters Landon, Cyrene, and Zird, breaking down their character sheets.  Also, they should have given character blocks for all the people imaged in the book.  There is an ape pictured on the cover of the book and on 14 other pages. On page 279 they mention there is a game called Chrome City which features Simon the Cyber-Ape, but he's not given any detail or a character sheet.  Seriously, if you're going to feature a character in a systems book 14 times, you'd better give his stat block. Many items are teased like that, and other items are overemphasized.  It took many many hours to figure out that the Simon the Cyber-Ape character artwork had nothing to do with the Landon guy, the \"rough-mannered swordsman\" (high concept) with the \"manners of a goat\" (aspect). If his manners are already in his concept, why are they repeated as an aspect?  I'm not sure if that's Landon pictured on page 39 or not. Much of the book looks like they had art available for a different game, and they decided to use it in this book for filler. That gives the book a disconnected feeling that is a disservice to the reader.Still, highly recommended.", "rating": 5.0, "upvotes": 8.0, "downvotes": 3.0, "helpfulness": 0.7272727272727273, "phelpindex": 1.0686153281616153},{"reviewtext": "First of all let me say this: Whether you like Fate or not, this is easily the best written role-playing core role-book I have ever read. And I have read many. It's well-structured, the text is to the point, and due to text boxes and highlights and excellent headings, you can skim this volume in a very short time. Plus, after you've read this, you will have a very clear picture of what kind of game Fate aims to be. Which is more than I can say about most systems.I have never played a Fate game before, but after studying this (and using one of the excellent Fate Worlds books) I was easily able to run a great session with a group of all Fate newbies. It was a blast.I love what the developers have done with Fate: The have streamlined to system to its very core (hence the name), and they have made very clear how all elements interact with each other. All the isolated rules exceptions most other RPG systems feature are just not here. What a relief. Aspects, Stunts and Skills are the only things you need to know about, and these elements help to create story- and character-focussed games with high drama and action.Sure, if you've only ever played variations of D&D; before, you'll need to wrap your head around the concepts presented in Fate Core, such as the Create Advantage mechanic and the way Fate Points work, but once you've seen how you can contribute actively to story development as a player instead of just reacting to whatever the GM is throwing your way, you'll never turn back.Plus: this is a truly universal system. Yes, it caters to a particular play-style, but if you like the system, you can use it in any and every world. It's infinitely hackable.I've never been a system hacker or even a huge world builder myself, but even reading this book made me want to go and create something right away. I don't think there can be higher praise for a role-playing core rulebook.", "rating": 5.0, "upvotes": 17.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9618401946245261},{"reviewtext": "MoM has excellent looking pieces, clear rules and a modular system that should support replayability... but the core concept of players vs a DM just doesn't work. Simply put, it's very difficult to get invested when 1 player (the DM) has a turn on every players turn, plus his own, and generally has little trouble stomping out your hopes for victory. And there lies the problem (as best I can tell) that the DM isn't really supposed to try to win - his or her job is really just to flavor the story and lead the players along. Unfortunately, that's ill communicated in the rules and hard for most players to grasp and the result is a game where 2-4 players get to do very little while 1 player interrupts their turns and, after an hour or so, wins the game.Not a problem if your group goes in with the right mindset, but not really fun at all without that.", "rating": 2.0, "upvotes": 7.0, "downvotes": 6.0, "helpfulness": 0.5384615384615384, "phelpindex": 0.7205357530051554},{"reviewtext": "Pros:This game does have a strong theme. It makes you feel like you're part of it's universe through the different cards and scenarios.I suspect there is a decent deal of replay-ability, though there are few scenarios. Each scenario has three different variants.Figures are nice.Cons:Be aware of errors in the book. You can print the errata online easy enough, but be aware that you definitely need them.I felt there were balance issues. *spoiler..-ish* In some of the scenarios the investigators merely had to walk out the front door, which they were already near. Not much excitement there.. In other scenarios, the monsters seemed to pile up and the investigators couldn't find weapons to go around. They were fighting multiple Cthulhu with their fists. Pretty comical, though *you wrap it's tentacles around your arm and pull it.* I'm pretty experienced at games and I can usually figure out ways to accomplish different objectives.Rule-heavy. I don't mind deep games or even long games. This game is just a bit too fidgety for me though. There are lots of rules, and you had better understand them pretty thoroughly before you try to teach someone else.Along for the ride? I felt like the cards drive the game and the players sit back and wait to either win or lose. It's supposed to feel like a mystery and you aren't supposed to be clear where you're going. It just doesn't quite come together. You do know where you are supposed to be going, but there isn't much excitement about it. There's cards scattered about and you basically have a 50/50 shot of being right or wrong on your guess of the initial destination. It's not so fun when you're wrong, not so rewarding when you're right. Also, sometimes when you're right you still help the bad guys, so that's even less inspiring.The moral of the story here, folks: in my humble opinion, if you want Arkham Horror universe, go with Elder Signs. It still has theme, but plays much quicker and keeps players interested. If you want a mystery, go with Betrayal at House on the Hill, which is just infinitely better in my opinion, even if the durability has issues. As the title says, I really really wanted to like this, but after four painful games and some reflection on poor balance and fun-factor, I sold it.", "rating": 2.0, "upvotes": 12.0, "downvotes": 3.0, "helpfulness": 0.8, "phelpindex": 0.774552714003933},{"reviewtext": "Two friends and I played with an acquaintance and three of his friends. (7 people total. 3 infrequent gamers, 4 H.P. Lovecraft Fanboys/girls)My friend said that it was a great game so we decided to try it out. I had no idea what kind of game it would be until they showed up and someone said Cthulhu. At that point I knew that opinions were distorted and this was quite possibly going to be a terrible game. It was.You start off drawing characters that have no real differentiation aside from getting different items that also aren't very different. A \"monster\" is then drawn that you have to defeat. You pick different rooms to go to and roll dice to see if you'll get lucky and complete the quest for that room(you use items to roll more dice, re-roll, or lock dice. Fun!); if you don't complete the quest you're trapped in the room and you lose health/intellect. If you complete the quest you get items and elder signs. You collect so many elder signs to kill the \"monster\" that essentially sits there the entire game doing nothing more than adding his own doom tokens every so many turns that you race against. Awesome.Did it feel like I was facing off against Cthulhu or some other giant monster? No. The game has great artwork but the theme is weak at best. It's a cooperative game without any cooperation, with little to do other than go to a room and roll some dice.The 3 of us started losing interest after setup resulted in a table covered in cards and small tokens. A turn or two later all we could think about was how to get the hell out of this game. Once we had 7 of the 11 elder signs needed to defeat the \"monster\", we went balls to the wall on these s***ty quests to get all the elder signs we could.We won.... and we didn't care. Our celebration was in that the game was finally over. Thank god.", "rating": 1.0, "upvotes": 2.0, "downvotes": 11.0, "helpfulness": 0.15384615384615385, "phelpindex": 0.7273335239565482},{"reviewtext": "I was so excited for this but it is not as fun as i hoped it only comes with Dom,Baird,Cole,and Marcus where is carmine and hoffman?Plus there are not that many different missions where is versus?Plus where are the grenadiers,beast riders.50 dollars for this game dont buy, the lowest i would buy this game for is 30 dollars maybe only 25 dollars.Forgot to mention you need nose plugs, when I opened the box it smelt so bad and wierd (and it still does) it gives me a headache!!", "rating": 3.0, "upvotes": 1.0, "downvotes": 14.0, "helpfulness": 0.06666666666666667, "phelpindex": 0.7677914828975916},{"reviewtext": "This is NOT the full-sized version, but instead the \"travel\" sized version of a game originally produced by Mayfair games. The original, uses full sized (Catan sized) tiles, and these tiles are less than an inch wide. How does it stack up?Durability- This goes to the Fantasy Flight games version hands down. In this production the tiles are very thick (albeit small) and printed with vinyl finish. The Mayfair version is printed on the same kind of tiles as Catan, which do not impress me to be honest. They are not as thick as these, and the ink on paper finish is no durable at all.Quality of Bits- Once again, this goes to Fantasy Flight. The print is on vinyl finish, and the tiles are HEAVY. they are thicker than the full sized game by far. The Penguins however, leave something to be desired. In the Mayfair version, the penguins are hand painted and finished to look like penguins, wearing different colored accessories to signify what team they are on. In this version, the penguins are simply solid colored and stuck in entertaining poses. They get the job done, but are not as pretty as the Mayfair ones. I imagine this is done to keep this version easy on your wallet, and do to the fact that they are small. The quality is where it counts so I supposed we should forgive FF this one.Gameplay - same as the original... A strategic and clever mix of moving penguins to take as many fish as possible while leaving your opponents buried alive by their mistakes. At my house, there are NO friendly games of Hey That's My Fish. We play for the survival of the species. = )Packaging - The box is small (about the size of any given Fantasy Flight card game (lets use Rat-a-Tat-Cat as an example) and is made of the same thick, durable, vinyl printed material as the tiles themselves. It was MADE with travel in mind, and it WILL endure abuse.Final thoughts - I feel the need to reiterate... this version is small. Take whatever image you are getting in your mind right now... and shrink it. The entire board is 8x8in when using the standard construction archetype. this is GREAT for travel, but there are obvious downsides... Pieces can get lost easier this way, and it is a bit tedious setting the game up (a problem I have with the original to be honest) I will post some pictures tonight for reference's sake,  so watch for them.A solid purchase by any account! You won't be disappointed!", "rating": 5.0, "upvotes": 41.0, "downvotes": 1.0, "helpfulness": 0.9761904761904762, "phelpindex": 1.0045319526008554},{"reviewtext": "Descent 2 Review from a Descent 1 FanFirst off, there are several reviews of Descent 2nd Edition that are based entirely on the game itself. The purpose of this review is for players, like me, who love Descent 1 and were hoping for more of the same with Descent 2.I'd like to start with some background. I have been playing Descent 1st Edition for as long as I can remember. I own every expansion and have played nearly every dungeon and some several times. I have played both campaign expansions though not extensively with Sea of Blood as the ship battles were tedious. I was active on the forums to make sure I had all the rules right and I printed the full FAQ and referenced it often. I knew the rules well and so did my players (I was almost always Overlord). We knew the rules so well that the hero players knew what card I was about to play based on the amount of threat I was counting out.I was very excited about Descent 2 and read every preview. When the rules were posted I read them twice in my free time at work. Then when I got the game itself I read the rules twice more; once to just to be sure and again when I thought I had to be missing something. I say this because the general response to a negative review is that I'm just not doing it right. My group and I can't figure out how people are able to enjoy this game in the same capacity as Descent 1. Remember, this review is for Descent 1 fans who wanted Descent 2 to be a natural successor. Also, this review is a comparison between vanilla Descent 1 (with no expansions) and Descent 2 which is the only way to be fair.There are enough reviews about the good aspects of D2 so instead of re-hashing what has already been said I'm going to focus on the negatives.Here are the reasons my group mutinied against D2 mid-quest in no particular order:-Overlord doesn't get to spawn. Some quests let you replace 1 lost monster per turn, sometimes two but that's rare. And it enters the dungeon at a set location.~One Overlord tactic always works and works too well: Put a large monster on a choke point and have your smaller monsters run for the quest objective. This boring tactic has seen the Overlord win every time.-Heroes can only spend fatigue for movement or to trigger lackluster class abilities.o  No random draw for cool powers. Your class will always have the same starting setup and the same options as it levels up. Some are cool but most are just okay.o  No adding power die to beef up an attack, or adding just one more power die to finish a kill.  You get one primary attack dice and one power dice. In tier 2 you get two power die.-No separate loot for potions, money and chests. Now it's a single token and you draw from a deck to see what you get: Potions, treasure, or the hated X (no loot).o  Potions are very limited. You won't see Silhouette running 19 squares to grab all the loot in a dungeon anymore.-Once a hero gets knocked out, unless another hero helps him up, he'll be stuck getting smashed round after round by whatever knocked him out in the first place.o  This makes for a boring game for the hero team. Descent 1 was far better where the hero dies in a blaze of glory then comes right back the next turn at full strength ready to bash monsters.-Dungeons are too small. I understand streamlining but it encourages the use of Bullet #2 and makes the dungeons a little claustrophobic.-Attacking is heavily discouraged. Both sides need to use all their actions toward completing the objective, which is very easy for the Overlord and very difficult for the heroes, especially when using bullet #2 as the heroes have to pummel their way through a heavy defense monster while the Overlord is double-moving toward his goal.By the end of the second dungeon my group and I saw that the Overlord would win every encounter within a couple of turns if he just ignores the heroes entirely and goes for the objective. So we house-ruled that monsters cannot double move (except with Dash). We also house-ruled that the X card in the loot deck was to be removed since so much of the heroes' potential lies with equipment.The Overlord still won every encounter, and yes I tried playing on the hero team.My group and I feel that D2 is not balanced for competitive play, and that's what we were expecting from Descent 2 based on what we liked about Descent 1. That said, even if D2 were balanced, the gameplay is simply boring. They have removed so many options for both sides of the table by making too many assumptions in the name of streamlining. The heroes chafed at not being able to use a Ready action for Aim and burn a ton of fatigue in order to get one big hit on the big heavy monster. Instead they had to hope for a good roll and also hope that the Overlord had a bad roll on defense. With D2 it seems to come down to luck since so many of your tactical decisions have already been made.I've seen people say that D2 is supposed to be more like an RPG where the Overlord pulls punches and plays more like a DM. This is not what we signed up for. I've also read that it's more about hero progression which completely boggles me. You only have a few choices when you level up - generally A, B or C. With Descent 1 the possible combination of powers made each game very different.If they had called Descent 2 by another name like Defenders of Terrinoth then I don't think I would be so negative about it. It's because I like Descent 1 so much that I find Descent 2 so disappointing. My wife's review of Descent 2 was that it played like something you'd get at Toys'R'Us - fun at face value but lacking tactical depth.I already know the response to this: If I don't like Descent 2 then I should just play Descent 1. That's what we're doing. The purpose of this review is to help other Descent 1 fans who may be on the fence about Descent 2 make their decision.However, I wish they'd make a conversion kit for Descent 1 so I could use the Descent 2 plastic", "rating": 3.0, "upvotes": 117.0, "downvotes": 28.0, "helpfulness": 0.8068965517241379, "phelpindex": 0.7959398886389337}]