[{"reviewtext": "We love this board.  After reading the reviews I decided this was the perfect personal magnetic/dry erase board for my kids.  I use it in homeschooling, but the kids love playing with it other times.  I use the Melissa & Doug magnetic numbers and letters, and it is just wonderful.  I use expo markers on the board, and they erase pretty well.  I periodically clean the board with white toothpaste and a wet rag (something I learned online).  It refreshes the board from those \"ghost\" marks that can build up on dry erase boards.  It's a wonderful size, both sides are magnetic so both kids can play/learn on it at the same time.  If you're looking for a personal sized magnetic board this is it.  I don't believe you'll be disappointed.", "rating": 5.0, "upvotes": 11.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9007293701701939},{"reviewtext": "We had purchased Melissa & Doug magnets & had some made & went looking for a board.  THIS IS IT!  It is so reasonable and has been in use ever since we received it.  You can spell words, put the Leap Frog base on it to put in letters/animals, numbers, etc.  It is also double sided.  Even though it's not intended they also like to put things under/inside the board.  They can roll things through it.  Highly recommend & every child should have one to put their magnets on.", "rating": 5.0, "upvotes": 17.0, "downvotes": 2.0, "helpfulness": 0.8947368421052632, "phelpindex": 0.8847534907222785},{"reviewtext": "These are great practice cards for the price.  They are made of a heavy card stock, and come with both upper, and lowercase letters.  I first looked at sandpaper letters geared toward montessori teaching, and while they were of higher quality, they were also of a much higher price.  Which if I were using them in a classroom, that would probably be the way to go.  However I am using them at home with my five year old, so they don't need to last forever.The card stock is much heavier than I expected from other reviews, and has held up great to moderate use.  The letters themselves did have excess sand on them, put after a weeks use, they are perfect.  I think the cards are a nice size to hold and trace, build words, or play matching games.", "rating": 4.0, "upvotes": 13.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8358148948735535},{"reviewtext": "I have this game.  Just got done playing it w/ my nephew.  I have not played D&D; since late 80's but picked up the \"new\" basic set on a whim because it had been a long time.After using the quick start manual, my nephew's first question was \"where did you get this game\"? because it was fun.This Basic Set has its limits, but it was a good refresher and easy to get back in the game w/ a new player.I hope this review helps because one reviewer rates the game w/o even mentioning anything about the product or game play.", "rating": 3.0, "upvotes": 34.0, "downvotes": 2.0, "helpfulness": 0.9444444444444444, "phelpindex": 0.7492350135815347},{"reviewtext": "My group of seasoned D&D; players (2nd Edition through 4th Edition) decided to try this out instead of our regular campaign recently.  After playing it for a few hours, we came to the conclusion that the only way to enjoy the game as shipped is to just laugh at the fact that every card draw is most likely either going to kill you or come close to killing you.I have seen it said that this game is \"D&D; Lite\" or that it could be used as a gateway to get people into playing actual D&D.;  That is patently ridiculous.  If anyone who has never played D&D; thought this game was a good representation of it, I highly doubt they would play D&D;, which is actually much less difficult and far more enjoyable than Castle Ravenloft.Now, I know there are people who like a \"challenge\" or who think they are smart and special because they put up with a ridiculously difficult game.  That is fine if you are into that sort of thing, but my group would rather actually enjoy themselves.  After we played we came up with a bunch of house rules that could actually make the game playable.If nothing else, I guess it gives me some dungeon tiles and single-color minis to use.", "rating": 2.0, "upvotes": 11.0, "downvotes": 6.0, "helpfulness": 0.6470588235294118, "phelpindex": 0.7353117897668295},{"reviewtext": "I had high hopes for this game, as I am a big fan of Fourth Edition D&D; (though if you like 3e, enjoy it! I'm not going to tell you one is better; I'll just tell you which one I prefer). I also enjoy games with modular tiles and such, so I really went into this game biased towards enjoying it.Sadly, all that couldn't rescue this game. It is exceedingly repetitive. Play about 3 turns and you'll get the entire experience this game has to offer - there will be nothing new or exciting for you. The game is hopelessly shallow, based on so much chance that strategy is non-existent. Despite the modular tiles, the game offers virtually no customization.The pieces seem to be well-made, and fortunately it might supply some use for actual D&D;, since the store I bought it from doesn't do returns. However, the quality of the pieces is not matched by the game itself.I really wanted to enjoy this game, so I played 5 whole games and an uncounted number of aborted attempts, before accepting the fact that it simply doesn't work. Extremely disappointing.", "rating": 1.0, "upvotes": 13.0, "downvotes": 20.0, "helpfulness": 0.3939393939393939, "phelpindex": 0.6458933010528114},{"reviewtext": "This is a very cute, well-made doll.  Just be advised that you need to purchase the animals (and book if you want that) separately.", "rating": 4.0, "upvotes": 13.0, "downvotes": 1.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.7362107538780609},{"reviewtext": "This is a great toy to use to familiarize yourself with the rhombic triacontahedron, especially if you buy the six-color edition. Actually, I recommend buying two, because that way you'll have 10 pieces of each color.  This allows for symmetrically 3-coloring the \"ball\" as well as 5-coloring and 6-coloring it, which are all interesting problems.  There are also some nice but less symmetrical 4-coloring patterns you can make.My whole family has been enjoying playing with this toy.", "rating": 5.0, "upvotes": 15.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8901857366891268},{"reviewtext": "In a rush, I bought this toy for my 5 year old grandson's birthday.  He is intrigued with mechanical things and I love magnets.  However, when I got the toy, the warning was 'not for children under 14' because it contained rare earth magnets.  And, if it was thrown, it might be damaged and should be disposed of.  That immediately excluded my grandson.  I still think it is a facinating toy, but I haven't opened it.  Therefore, my ratings are not terribly relevant.  But, my review couldn't be summited without them.", "rating": 3.0, "upvotes": 9.0, "downvotes": 5.0, "helpfulness": 0.6428571428571429, "phelpindex": 0.7329563763719117},{"reviewtext": "We bought our son this product for Christmas after he became enthralled with it at the local toy store.  He loves that you can drop it, the pieces scatter and then he has a blast finding all the pieces and putting it back together.  As he gets older, I am sure he will enjoy making all kinds of fun creations with this great learning toy.Shortly after he got it we did lose a piece.  I e-mailed the company and told them what had happened, hoping I could buy a replacement piece and not have to replace the entire ball.  They sent me a replacement piece (free of charge) along with a nice letter and a thank you for my business.Kudos to Ball of Whacks for providing such excellent customer service and for marketing such a great toy for young and old.", "rating": 5.0, "upvotes": 35.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9153245462622774},{"reviewtext": "My sister bought this book for my five-year-old daughter.  I thought she was too young for it, so set it aside for about 6 months.  While it took quite some time to lay out the story, it was worth every second.  She really loves her book, took it to school and went to each of the classrooms to read it.  One teacher called me and asked for the information so that she can do it with her entire first grade class.  It's a great idea and was a great gift!", "rating": 5.0, "upvotes": 15.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8765808145325933},{"reviewtext": "I thought this would actually be reprinted and bound, but the pages in the book were (it looked like it, anyway) the actual pages we had mailed in.  The pictures bled through the pages and there were visible lines everywhere.  Maybe it would have been better to do it online, but I think we could have probably done a much better \"publishing\" job here at home.", "rating": 1.0, "upvotes": 16.0, "downvotes": 13.0, "helpfulness": 0.5517241379310345, "phelpindex": 0.5645040546705382},{"reviewtext": "My son made an illustory book. He did a great job with it and when it was returned, it was great to receive, but they had just cut the actual page he colored, printed the text with a computer and bound those actual pages together! I was quite shocked. He had published his own, beautiful book with [...] and it is much, much nicer, plus it's his own handwriting (or it could be typed). I love the idea, but with all the book publishing companies out there now, so they need to do a much better job with the publishing.", "rating": 2.0, "upvotes": 7.0, "downvotes": 9.0, "helpfulness": 0.4375, "phelpindex": 0.6530454266900501},{"reviewtext": "I know this is meant for children, but I decided to buy it for myself.  I am  writing stories about my childhood that I am sending to my grandchildren.  It is a wonderful way for them to get to know a little about me and have something to keep to remember me by.  I love it.", "rating": 5.0, "upvotes": 16.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8261290052136174},{"reviewtext": "My 5-year-old enjoyed making her book.  I did not realize, however, that the sheets we mailed in would be the same sheets bound into the book. I guess I thought they would be color copied and bound.  Because they are the same sheets, the marker bled through the back of each sheet and looks pretty cheap.  We also had a misspelled word.  I would have done it online if I had known. It is definitely fun to do, and quite educational, but it wasn't quite what we had in mind. I may be too picky.  I guess for under $[...], this is what you would expect.1/6/10: After contacting the company, they paid for the return, correction, and archive of the original book.  Great customer service and finished archived product!!", "rating": 2.0, "upvotes": 14.0, "downvotes": 8.0, "helpfulness": 0.6363636363636364, "phelpindex": 0.6890099574720866},{"reviewtext": "My Granddaughter age 9 had so much fun making up her own story, she is still working on the art and then we will have it printed.", "rating": 5.0, "upvotes": 16.0, "downvotes": 6.0, "helpfulness": 0.7272727272727273, "phelpindex": 0.8390993987365173},{"reviewtext": "We bought this for my son, who loves to write books of his own. When he received the finished version of this book, he was so proud and wanted to write more books. The finished product makes a great gift for grandparents and other loved ones. It also inspires a love of reading and writing in children. What a wonderful do-it-yourself project for children!!!", "rating": 5.0, "upvotes": 25.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.854277383245613},{"reviewtext": "They include a set of markers and paper.  Be aware of the extra fees associated with writing on too many pages.  Read all their papers carefully and count everything.  They added on fees, contacted me by mail which slowed down the process, and they should allow more pages for the price.  My daughter did this years ago, and now at 11 she did again and still loves this.  This is a great idea and I am not sure if anyone else offers such a product.  The first book went smoothly.  The second book they spelled her name wrong, and the return process was really awful.  They reprinted the book, and although they fixed the typos throughout the book (ones that my daughter didn't spell incorrectly, ones they did), the condition of the book when they shipped it back was beaten up a bit on the spine, but I don't want to go through the process of returning again based on the experience the first time.  If they improve their customer service with the typos, improve the marker set, and shipping situation, this company would do much better.  I doubt I would do this again even though my daughter loved it.", "rating": 4.0, "upvotes": 7.0, "downvotes": 5.0, "helpfulness": 0.5833333333333334, "phelpindex": 0.8625201875908732},{"reviewtext": "I had gotten this card game for my grandchildren who love to play games, but the questions in this game are just stupid and we didn't even finish one round.  An example would be, \"Would you rather eat eye balls from an aligator or from an elephant?\"  This was not a fun game for our family at all.....maybe if you were all drunk, you might find humor in it, but I would not recommend it to anyone.", "rating": 1.0, "upvotes": 10.0, "downvotes": 10.0, "helpfulness": 0.5, "phelpindex": 0.593344167700489},{"reviewtext": "My son has been asking me for bendaroos for the longest time so i got him these since they are pretty much the same thing. i believe the only difference is that the wikkistix have an adhensive quality that lets them stick to glossy books or other shiney surfaces. the book included is very amusing and give kids creative ways to use the wikkistix. for example there is a page with under water  scenery with seaweed and such and you use the wikkistix as if they are seaweed and create other under water critters or scenery. my son wraps them around his pencils, toys, and uses them in other books. overall he has a lot of fun with them and it allows him to express some creativity. the other day he made me \"heart balloons\" with them. my 2yo mimics what he does and they can play together easily without fighting over them since there are many.", "rating": 4.0, "upvotes": 20.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8381394519945387},{"reviewtext": "Beautifully designed and nicely made but simple to play?  I don't think so.  It has way too many pieces and far too many choices, and frankly I'm not sure that I understand the goal -- which isn't what is expressed in the rules.  I have done a number of those train rides and the routes don't actually go where some of the existing AMTRAK trains (and Canadian Trains) go.  Versimilitude is valuable.  My opinion is that it needs to be simplified and modified...although my opinion is obviously in the minority.  My 8 and 10 year old grandsons liked it but we played with rules that we made up to suit our idea of how it should be played.  And then we spent 10 minutes sorting out the pieces, the cards, and replacing everything in the box.  Mix the cards up and you are doomed!", "rating": 2.0, "upvotes": 5.0, "downvotes": 83.0, "helpfulness": 0.056818181818181816, "phelpindex": 0.6942861267743802},{"reviewtext": "This is a great game. If your paragon of boardgames is still Monopoly, then you are in for a pleasant surprise. Far superior games are now available. There is a quiet revolution in boardgaming happening right now.Ticket to Ride is one of the best of these new games. My wife and I love this game. It is very engaging, and pretty short. It gets tense toward the end. It plays well with 2 players as well as 3 to 5 players. It's also great for kids, to teach the geography of the US. This game won the coveted Game of the Year award (the German \"Spiel des Jahres\" award) for 2004, and it certainly deserves it.Note: There is a possibility for some competitive, cutthroat playing but we don't play it that way.If you like this game, also check out these others, which are also listed on Amazon:Settlers of CatanCarcassonne", "rating": 5.0, "upvotes": 19.0, "downvotes": 1.0, "helpfulness": 0.95, "phelpindex": 0.9287834291709773},{"reviewtext": "This book is geared for older children and even adults.  The stories are good but not appreciated by most young children.", "rating": 3.0, "upvotes": 1.0, "downvotes": 19.0, "helpfulness": 0.05, "phelpindex": 0.6596246134753643},{"reviewtext": "Package was left in a snow storm and box is now warped.  Let Amazon know, but never heard back.Game is great to play and plan on keeping it around for along time.  However, it is pricey and disappointed that I will forever have a warped box.  :'-(", "rating": 1.0, "upvotes": 1.0, "downvotes": 32.0, "helpfulness": 0.030303030303030304, "phelpindex": 0.5395589301376452},{"reviewtext": "PROS: Easy game to learn, Educational for US. Geography, Moderate luck factor.CONS: Not recommended for avid game players. Only moderate strategy.Ticket to ride is fun, it's got some strategy to it, but I've played better. In fact, the European version adds a few more variants that greatly improve on the game. I would recommend this game for beginners. For highly competitive game board fanatics, one or two plays of this version and you'll move on. Best just to skip to the European version.", "rating": 3.0, "upvotes": 49.0, "downvotes": 9.0, "helpfulness": 0.8448275862068966, "phelpindex": 0.7297383639419509},{"reviewtext": "So far, not so good. This game seems to have lots of complicated rules and no strategy. We will try it again - if we can work up our nerve to slog through it once more. It is my hope that we have missed something; it sounded so good when we read about it.", "rating": 2.0, "upvotes": 3.0, "downvotes": 9.0, "helpfulness": 0.25, "phelpindex": 0.6229945415439083},{"reviewtext": "Everything came much faster than was stated, game was in perfect condition so I really couldn't ask for more. More than satisfied. Thank you very much.", "rating": 1.0, "upvotes": 0.0, "downvotes": 38.0, "helpfulness": 0.0, "phelpindex": 0.5134844023888194},{"reviewtext": "Sunday Game Night always starts out with table topics...wild bunch of 20-40 year olds...would love a table topics sex edition!!", "rating": 5.0, "upvotes": 10.0, "downvotes": 5.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.8029302119285017},{"reviewtext": "I purchased this item after reading the other reviews thinking that it would be a good way to get to know friends better, but after reading some of the cards it seemed like most of the cards asked the same questions or rearraged the wording on most.I was disapointed with the cards, and returning them was even more fun... I had to pay $9.00 to ship them back to the company and a over month later was still waiting on the refund, I finally had to email the company to find out what was taking them so long and they emailed me back saying that they had to charge a restocking fee in order to issue me a refund although the package was only opened, not used. I'm still waiting on my refund and won't order from this company again. Overall it has cost me over $20.00 to try and return this product.", "rating": 1.0, "upvotes": 23.0, "downvotes": 7.0, "helpfulness": 0.7666666666666667, "phelpindex": 0.6165037506063691},{"reviewtext": "This is a nice product and a nice gift.  A definate must have esp. when you have guests or when you just want to have some fun with your friends and family.  Makes a nice gift and the box is so pretty you can leave it sit out so you can enjoy it all the time.", "rating": 5.0, "upvotes": 19.0, "downvotes": 3.0, "helpfulness": 0.8636363636363636, "phelpindex": 0.8261207035693021},{"reviewtext": "item arrived on time, this is the 4th one we've bought. Great gift item. Lots of fun to play and stir up interesting conversation.", "rating": 5.0, "upvotes": 10.0, "downvotes": 1.0, "helpfulness": 0.9090909090909091, "phelpindex": 0.8084161175590411},{"reviewtext": "Very enjoyable game that pokes fun at the various fantasy clich&eacute;s in books, movies, role playing games, etc.  The people who will get the most out of this are the devoted fantasy fans--others might be overwhelmed at first.  However this is soon settled as you get into the pace of the game.Players play one of four characters: a brash warrior-maiden, a sneaksy little halfling, a snooty priestess, and a wizard with his psychotic bunny rabbit familiar.  It's a little like a collectable card game in some ways:  each character has a unique deck with its own special strengths and weaknesses.  For example, the priestess has lots of cards that heal her, so it's hard to damage her much.  This adds to the fun and interestingness of the game.  However you don't have to go through the agony (and the investment) of actually collecting the cards, which is always a plus in my book.More socially conservative parents might want to shy away from this, as the game centers around the characters drinking, gambling, cheating, and backstabbing one another.  (And they probably wouldn't get half the jokes anyway.)  But otherwise, this is a good dive into how fun and wacky a good card game can be.", "rating": 5.0, "upvotes": 35.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9558372875174025},{"reviewtext": "The game is fun for a very casual gaming crowd.  I had purchased this game with expectations of a little more depth and strategic possibilities within the different character classes.  From the looks of it the four characters included contain very similar cards thus limiting the number of ways one can achieve victory.I've played it a few times and it feels like luck of the cards drawn is the main factor in determining the victor.The game is easy to learn quickly even if many of the players are new and plays relatively quickly.  It's no Carcassonne, Arkham or Catan.  It works if you want a light hearted game that can be learned quickly and played in small group in a short time period.", "rating": 3.0, "upvotes": 5.0, "downvotes": 7.0, "helpfulness": 0.4166666666666667, "phelpindex": 0.7565075036947545},{"reviewtext": "My kids just received this Thanksgiving day as a gift and I am now ordering them for every child I know.  It is such a cute idea.  Santa sends the elf to watch the children and then the elf reports to Santa every night and comes back to a different spot in the house.  My kids wake up with a running start to see who can find the elf first.  The kids must name the elf and they really enjoyed that as well.  It is such a nice tradition to help make the Christmas Season even more fun and special.  I know it will be with our family for a very long time.", "rating": 5.0, "upvotes": 173.0, "downvotes": 28.0, "helpfulness": 0.8606965174129353, "phelpindex": 0.8862610662529402},{"reviewtext": "I was very disappointed with this product.  The premise was very cute, however, the story was an issue for me.  I am not a fan of ever telling a child that he or she is bad which this book does.  I teach my children that attitudes, behaviors, words, actions etc can be bad but people are not bad.  I also was not crazy about promoting the commercialism of Christmas which this story does.  Between labeling children as \"good or bad\" and telling children that if they are \"good\" Santa will bring them whatever they want doesn't support my values.  If I had read the story before giving it to my child, I never would have given it to him.  Lucky for me he had zero interest in the story or searching for the elf each morning, so I promptly resold the entire kit.  Perhaps a rewrite of this book to reflect current day values and terminology is in order!  I plan to focus on the true meaning of Christmas.", "rating": 1.0, "upvotes": 63.0, "downvotes": 25.0, "helpfulness": 0.7159090909090909, "phelpindex": 0.6182149827372017},{"reviewtext": "We received our little elf last night, and I am pretty disappointed. The quality is very poor for such a price. His little hat has yellow glue seeping through the white band around the head. His hair is totally rubbed off on the front, and his left cheek has also been rubbed off. It's the quality I would expect if I bought from Goodwill and not Amazon.I know Amazon has an amazing return policy, but honestly, returning it would break my boys' hearts since they already named and registered him.The book is okay but also not the quality I expected.", "rating": 3.0, "upvotes": 8.0, "downvotes": 4.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.7446927223003585},{"reviewtext": "As soon as we opened the box, my 3 year old daughter said it was scary.  I decided to let her warm up to it so I just put it on the mantle and read her the book.  When I was done, she said she didn't like the elf and asked me if it could go to Santa's house and not come back here.  I think it's a really cute idea, but maybe if the elf doll was a little...cuter looking(?) it would work better.  That or she just doesn't like the idea of a doll watching her all the time, not sure I blame her on that one.", "rating": 3.0, "upvotes": 57.0, "downvotes": 18.0, "helpfulness": 0.76, "phelpindex": 0.7443793987977796},{"reviewtext": "The story is cute, well written and has great graphics.  The Elf though is poorly made.  I can not see this guy lasting more than a couple of years.  His hat is already falling apart.  The whole thing seems poorly constructed and not worth $30.  I would buy the book without the elf and then find an elf somewhere else.  Probably save half the money!", "rating": 1.0, "upvotes": 10.0, "downvotes": 2.0, "helpfulness": 0.8333333333333334, "phelpindex": 0.5682311435862276},{"reviewtext": "This book is so creative for children. I have 3 children ages 5 and under. They love this book. My 5 year old was actually questioning Santa's existence until she woke up and found the elf in a different spot each morning and now she's believing 100%! They get to name their elf and that adds an extra element that they can own! Very creative and just a cute story for the everyday household of children. Even the older ones would enjoy making this story real to younger siblings! A must have a Christmas time!", "rating": 5.0, "upvotes": 53.0, "downvotes": 17.0, "helpfulness": 0.7571428571428571, "phelpindex": 0.8952759033995465},{"reviewtext": "I received this book as a gift and am sad to say how creepy this book/toy is. The elf itself looks like something out of a horror movie...and I'm supposed to let it hang out in my house?! The book has beautiful illustrations, but the story is something else. This elf is supposed to spy on your kids no matter where they are, noting whether they have been good or bad, and report back to Santa. I believe that this is infringing on their rights to be kids. So what if they're bad once in a while...they're kids! Kids make mistakes and PARENTS should be the ones to teach them this, NOT some little toy! I'm all for traditions like Santa, but can do without the elf on the shelf.", "rating": 2.0, "upvotes": 26.0, "downvotes": 28.0, "helpfulness": 0.48148148148148145, "phelpindex": 0.68885325063201},{"reviewtext": "This is such a wonderful tradition.  Because I collect children's Christmas books, I place a different book with our elf each morning.  Then, we read a new book together at bedtime. My children look forward to finding our elf and to having a new Christmas story.", "rating": 5.0, "upvotes": 12.0, "downvotes": 3.0, "helpfulness": 0.8, "phelpindex": 0.8306637216940479},{"reviewtext": "The whole concept is so creepy and negative. What a great way to turn something beautiful like Christmas into something ugly and frightening. Yuck! If your parenting stinks so bad that you need this elf, may I suggest some parenting classes instead? If you have truly taught your children values and how to be a good human being, they will carry over into the times when nobody is watching. I can't believe how many good reviews this creepy, manipulative, control freak device is getting. Sad commentary on society.", "rating": 1.0, "upvotes": 8.0, "downvotes": 14.0, "helpfulness": 0.36363636363636365, "phelpindex": 0.5919388432854831},{"reviewtext": "Yet another trendy way to waste $20-30 of your hard-earned money. Believe me, there are better ways to ensure your children are well-behaved yearround. The elf is not going to do it.", "rating": 1.0, "upvotes": 7.0, "downvotes": 8.0, "helpfulness": 0.4666666666666667, "phelpindex": 0.5207351730067452},{"reviewtext": "I agree with the posting that dared to criticize this \"tradition\" and disagree with the posting that plans to \"pray for\" the misguided grinch who finds this elf \"creepy\".  I wonder what he is praying for?  That this parent will be enlightened to succumb to mass merchandizing?  Or that the \"terrible wrong in their lives\" will go away?  Or that this family will go to church more so that they will better understand the scriptural account of Santa and elves?  What do children make of all the \"traditions\" that marketing executives have created to enhance the meaning of our holydays?  How scary is it that most children swallow it all and become obedient clones of their parents.  I'd rather see parents concentrating on the substance of the season rather than the trite (and often trashy) appearances of it.", "rating": 1.0, "upvotes": 18.0, "downvotes": 9.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.596252860254125},{"reviewtext": "I'm going to make the short.  If you own Last Night on Earth, you need to buy this.  The art style is exactly as fantastic as the main game, the new characters are balanced and fun and the addition of more zombies is never a bad thing.  There are a few new rules that add genuine depth and the added scenario is deeper and more challenging than the originals.To remind you: if you have LNoE, buy this now.  You can even fit (most of) the pieces of both sets in the Growing Hunger box.  If you don't have the main game, buy this AND Last Night on Earth.", "rating": 5.0, "upvotes": 19.0, "downvotes": 2.0, "helpfulness": 0.9047619047619048, "phelpindex": 0.8843569767419842},{"reviewtext": "I played this game with my 4-year-old son. (It is designed for children ages 3 and up.) I almost gave up entirely, at first, because my son was fascinated by all the different parts of the game: the tornado, the little chips/coins, and so on. Once he settled down, we began to play. One problem I found was that it was impossible, for both me and my son, to touch our ear to any of the letters. I used to play Twister as a kid (and this game is an educational twist on Twister, since they have to be able to recognize the alphabet), so I was interested in the physical aspect of the game; however, we had no success with getting our ears to touch the mat. The creators of the game could have limited themselves to hands and feet, or added elbows and knees.The tornado motiv is fun, but the footprints that signal the end of the game seem superfluous to me.All things considered, a fun and educational game. But I think that the creators tried too hard to distinguish it from Twister (which was simpler).", "rating": 3.0, "upvotes": 12.0, "downvotes": 3.0, "helpfulness": 0.8, "phelpindex": 0.768876610179317},{"reviewtext": "This is a lot of fun for families who enjoy playing Hangman. My 8 year old and I play this whenever we are stuck somewhere waiting. We love it!The only thing negative I have to say about it is that the tiles are hard to turn over initially. However, once you use it a few times, it's fine.", "rating": 5.0, "upvotes": 13.0, "downvotes": 1.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.8615920486239634},{"reviewtext": "I have been playing Big Boggle for years. It had been discontinued for several years and my old set, after being used consistently over the years, had started to wear. For Xmas a couple of years ago, my husband bought me a new set from Ebay for an outrageous $75 new. When I saw that they had reintroduced Big Boggle, I bought two additional sets.Big Boggle is an addictive word game. While it is touted as a bigger version of regular Boggle and you can find bigger words of four letters or more, the reality is that you can come up with some huge words without reusing letters. Confirmed Boggle-maniacs will tell you that at times you can find yourself thinking about words and whether you've encountered them before on the gameboard.While I've noticed that this is a great game for anyone who thinks their memory is going and it definitely stretches a person's word knowledge and spelling skills, it also really helps kids with their spelling skills and vocabulary. My kids started out with regular Boggle and moved up to Big Boggle. Being competitive helped, but it did a great job reinforcing what they learned from a variety of subjects and improved their visual coordination.", "rating": 5.0, "upvotes": 30.0, "downvotes": 2.0, "helpfulness": 0.9375, "phelpindex": 0.9215891484976771},{"reviewtext": "Many games make you covertly work against your friends. Munchkin doesn't.Munchkin lets you openly, blatently mess up your opponents in the most in-your-face manner I've ever seen. This is a no holds barred, every man for himself celebration of rules mongering and loopholes.The game mocks D&amp;D and celebrates its simplest form at the same time. What D&amp;D geek doesn't remember sitting around a table, or in the basement, crawling through a dungeon - just bashing down the doors and fighting everything that moves? Munchkin works in exactly the same way. Each round, you bash down the door, fight whatever is inside, and move on to the next room.All the while, players can help or hinder their party, as whomever reaches 10th level first wins. You might not want to stab everyone in the back, though, because you just might need to use them to finish first.Munchkin is a lot of fun for old-school gamers and new fans of the genre alike. Light in rules and fast in play, Munchkin is great as an attraction at small parties or large gatherings. Probably played best with more than 4 people.", "rating": 4.0, "upvotes": 62.0, "downvotes": 8.0, "helpfulness": 0.8857142857142857, "phelpindex": 0.9008537098358684},{"reviewtext": "Hi all,No doubt this comment will get a lot of hate, but rating 1 star is likely the only way I can warn you:-- If you are buying this game because you saw it on Geek & Sundry's TableTop, this version is different.You do not get the board you see on the video.  This, as far as I can tell is the only difference.Otherwise this game is definitely fun.  You will have some questions about how certain things act or behave, or how to call a rule or two, but it's fun.  It is definitely a 4-star game otherwise.Apologies for the alarmist rating, just don't want people to open the box and look around for the map like a dummy.", "rating": 1.0, "upvotes": 2.0, "downvotes": 21.0, "helpfulness": 0.08695652173913043, "phelpindex": 0.60840907884831},{"reviewtext": "This is one of the best card games I have ever played. My friends and I played Munchkins, and Munchkin Bits over Christmas break almost every night. This game is a \"spoof\" off traditional role playing games with no actually role playing. The cards are funny, very creative and at times making funny references to the traditional role playing games. The rules are very well designed and very easy to follow (not much harder then monopoly). I have played this game with non-gamers and experienced gamers with both groups thoroughly enjoying the game. There are several variants of the game available through sjgames.com (Munchkin Fu, Star Munchkin, and more...) and I would highly recommend this game to gamers of all levels. You can also mix variants together which makes for an even more interesting game. Overall, the game is easier to learn and takes about a couple of hours to play depending on number of people.", "rating": 5.0, "upvotes": 15.0, "downvotes": 4.0, "helpfulness": 0.7894736842105263, "phelpindex": 0.9069436494986847},{"reviewtext": "Fan-freakin'-tastic.One of the best non-collectible card games I've ever played.  And if you're feeling extra saucy, go get the expansion packs.  This game is a riot that will have your group (even if not drinking) cracking up.  Plus Kovalic's illustrations add to the fun.Just beware the Magic Missile!Gamers already know how great Steve Jackson Games are, now the rest of the world just needs to catch on.As for the low educational value... you won't learn about math and science, but you will learn about orcs and trolls.", "rating": 5.0, "upvotes": 22.0, "downvotes": 6.0, "helpfulness": 0.7857142857142857, "phelpindex": 0.9086601376540898},{"reviewtext": "This is a very subjective review.The game system is pretty much the same as all the other Munchkin games.  Get to level 10, get the treasure, stab your buddy etc...The only reason for the lower than usual review is I'm not enamored with the genre, sort of like Munchkin bites, it's just not my kind of theme.  If outer space antics are your style then you will enjoy this game much more than I did.My son has Every verison of Munchkin (except blender) and this and Munchkin bites are the two I pass up whenever possible.The game likely deserves another star but I just don't enjoy it enough to give it.", "rating": 3.0, "upvotes": 3.0, "downvotes": 16.0, "helpfulness": 0.15789473684210525, "phelpindex": 0.7791857095169504},{"reviewtext": "L'item est en excellent &eacute;tat, propre, tout est tr&egrave;s bien et arriv&eacute; dans des d&eacute;lais raisonnable. Seule ombre au tableau : le manque de communication du vendeur/syst&egrave;me. Apr&egrave;s trois semaines, je n'avais toujours pas &eacute;t&eacute; avis&eacute; que l'item avait &eacute;t&eacute; exp&eacute;di&eacute;. J'ai &eacute;crit au vendeur au matin et il m'a r&eacute;pondu la journ&eacute;e mme, tandis que vers 16h l'item arrivait &agrave; mon domicile. Tout bien consid&eacute;r&eacute;, ce fut une bonne exp&eacute;rience d'achat. Merci! :)", "rating": 4.0, "upvotes": 2.0, "downvotes": 12.0, "helpfulness": 0.14285714285714285, "phelpindex": 0.8045052516574376},{"reviewtext": "Great set of cards, delivered on time and for much less than what i would pay at a game shop.", "rating": 5.0, "upvotes": 0.0, "downvotes": 15.0, "helpfulness": 0.0, "phelpindex": 0.8133295732962553},{"reviewtext": "OK I got this book for myself - I'm 25 years old. I had so much fun playing with the cool stencils. There's loads of neat papers with cool textures and designs. Also, I love the ribbons and beads. This book would be great for a girl of any age. *wink* It would make a neat surprise gift.", "rating": 5.0, "upvotes": 13.0, "downvotes": 4.0, "helpfulness": 0.7647058823529411, "phelpindex": 0.848758853821578},{"reviewtext": "I bought this book as a activity to share with my neice who is 8.  We both loved it.  The book is full of inspiration and helpful tips like how to use your finished creations and also how to use scissors more accurately and how to glue without making a mess.  The papers and accents they supply are really nice and the fashion stencils are perfectly engineered.  It comes with everything you need except the scissors.  I enjoyed it so much that I bought another copy for myself and for some of my crafty friends who love fashion.  I really think this is a great craft book and I've recommended it to many friends.  The Klutz products are always clever but this one is really special.", "rating": 5.0, "upvotes": 51.0, "downvotes": 1.0, "helpfulness": 0.9807692307692307, "phelpindex": 0.8869434660215525},{"reviewtext": "My sister gave this book to my girls, ages 6 and 8.  For over three hours, those two little girls were so involved with creating their very own fashion designs - all without their mother's help! I think it is one of the best Klutz books I have seen and definitely recommend it for pre-teen girls as well.", "rating": 5.0, "upvotes": 16.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8697390185218503},{"reviewtext": "Ready for Hearts to meet Spades and Whist? Well then you are ready to play Wizard Deluxe. US Games has a true game of skill and strategy. Wizard Deluxe requires the players to make sure they only bid what they can take  and no more.The game is fairly fast paced and requires at least three  players. I found that have four or more really makes the game enjoyable. It  is skill  and thought that makes you the winner in this game. Since there  is very few pieces, cleanup an d storage are no real problem.US Games  has included very simple and easy to follow instructions. The rules are  bi-lingual, which is a really nice addition to the game. The age of play is  from 10 to adult, but I found that this game might be a little advanced for  some of the younger players.Wizard Deluxe is a great gift for any  occasion and is very reasonably priced. So if you are looking for a great  family game or a game for those weekend get together, go out an get Wizard  Deluxe Card Game.", "rating": 5.0, "upvotes": 52.0, "downvotes": 3.0, "helpfulness": 0.9454545454545454, "phelpindex": 0.9163975771978186},{"reviewtext": "This book is a delight for young children to read as the rainbow appears. But it ignores the science of rainbows by merging two distinct colors -- indigo and violet -- into a single purple ribbon. There was no need to do this, and the result is that children learn about rainbows but learn the wrong thing. Why wasn't it made with the correct seven colors versus only six?", "rating": 1.0, "upvotes": 5.0, "downvotes": 11.0, "helpfulness": 0.3125, "phelpindex": 0.5666242981494278},{"reviewtext": "Of the 40 or so board books that my 15 month old owns, this is one of the 5 that he shows the least interest in reading.  There are two bears rolling on the grass on every page, and this provides no opportunity to use a variety of vocabulary.  His favorite board books are Dear Zoo by Rod Campbell, All About Me by Dawn Sirett, Baby Faces by Dorling Kindersley, I Love Colors by Margaret Miller, Baby Says Peekaboo by Dorling Kindersley, Bathtime Peekaboo by Dorling Kindersley, Baby Talk by Dawn Sirett and Victoria Blackie, Little White Duck by Bernard Zaritzky and Joan Paley, Touch and Feel Farm by DK Publishing, and Where is Maisy by Lucy Cousins?  All of those are read 20 times as often as this one.", "rating": 1.0, "upvotes": 12.0, "downvotes": 1.0, "helpfulness": 0.9230769230769231, "phelpindex": 0.6143890085168434},{"reviewtext": "This is the fourth of the \"How to Host a Murder\" series murder mystery parties I've done (the other three being Roman Ruins, The Class of '54, and the Maiming of the Shrew) and is one of the more enjoyable ones.  It is easy to costume for and a fun time period to be working with, and the plot unfolds such that if you're paying enough attention it's actually possible, but the last round, to figure out who did it.We also made the prarie chicken recipe that was included in the Host's Guide, which was very tasty and liked by all our guests.", "rating": 4.0, "upvotes": 26.0, "downvotes": 2.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.8827335676499828},{"reviewtext": "This is our seventh \"How to Host a Murder\".  We found this particular murder mystery to be a bit distasteful.  First - there was a character named Chief Breaking Wind - to me not all that funny unless you're a 13 year old in gym class.  Second - some of the character lines made homosexual references/comments.  Some people may enjoy this and find it funny but for our group (i.e. all heterosexual couples) it was more awkward rather than fun.  Surprise - none of the straight men wanted the homosexual title.  Now if they were the guys running around with the ladies it would be a different story.  Third - there were references to sexually transmitted diseases.  Making jokes about sexually transmitted diseases does not make me bust a gut laughing nor does it make it sexy or fun.  This was one of the few murder mysteries that we did not enjoy.  Our favorites mysteries have been Roman Ruins, an Affair to Dismember, and Hoo Hung Woo.  Don't waste your money on this one.", "rating": 1.0, "upvotes": 7.0, "downvotes": 4.0, "helpfulness": 0.6363636363636364, "phelpindex": 0.6644268926211413},{"reviewtext": "Truly, it looks as if it must be a great game, but the instructions are unclear. I am not a brain surgeon (though why we always use this profession to exemplify the epitome of intelligence, I don't know), but neither am I a schlub; nevertheless, the rules for play remain opaque to me. I am relatively certain that upon hearing the answers to the questions that I have, I would hit my forehead with the heel of my hand with enough force to cause a life-threatening indentation and exclaim, \"How obvious!\" But the online forum didn't seem to address them, so my forehead remains undented.", "rating": 1.0, "upvotes": 6.0, "downvotes": 34.0, "helpfulness": 0.15, "phelpindex": 0.6082741033805817},{"reviewtext": "If you like bored games, card games, basket weaving, cleaning the lint off your sweaters, you might like this. My daughter and I tried, really tried, to learn and like this game. I even still hold onto a forlorn hope that we still might, but we failed to become engaged, or amused by it and after a few hours went back to isolating with our iPads.", "rating": 2.0, "upvotes": 0.0, "downvotes": 15.0, "helpfulness": 0.0, "phelpindex": 0.6342062320830724},{"reviewtext": "First let me say that I love Gloom and some of the other expansions.  However, this expansion makes the game fairly complicated and pretty unbalanced if you have less than 6 players playing (requires other expansions as well).  Most of the other expansions work great even if you only have 3-4 players, so I'd suggest getting one of the others first.", "rating": 2.0, "upvotes": 15.0, "downvotes": 1.0, "helpfulness": 0.9375, "phelpindex": 0.6325489021547234},{"reviewtext": "This strategy card game is fun, quick to set up and doesn't have a lot of pieces or rules to keep track of. I've played with 2 players and with 5, and it was just as fun either way, which is unusual for this genre. It takes about 10-15 minutes per number of players.The objective is to build 8 buildings and gain the most points, which are printed on the building cards. Each turn players act as one of the characters and use the abilities: collect money for certain districts, steal from or assassinate another character, trade or draw extra cards, be the first to choose a character, destroy a character's building, etc.Characters are drawn secretly, and at least one is randomly excluded. Each character goes in a predestined order, and collects money or cards, may build, and can use their ability during their turn. Whoever gets the king chooses a character first for the next round, giving them an advantage. The strategies change as the game goes on, and you're always wondering what another player is going to do, if they can sabotage you, if you can foil them, and eventually who is going to call the game by building their eighth building.", "rating": 5.0, "upvotes": 33.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9337901787736214},{"reviewtext": "Extreme adventure, fun and good time. It is a really hard game to beat, specially if you add both expansions (one even allows one of the players to be a Dark Rider and battle against the fellowship). I have played it with friends and everybody have had lots of fun; however be sure you play it with cooperative and no competitve people. You really need each other so as to win the game; if not you won't even reach the end of Moria.Don't waste any more time and click the \"add to cart\" button so as to begin with this exciting journey through all middle earth (Moria, Helms Deep, Mordor, Shelob's Lair) and the expansion's Isengard and Bree.", "rating": 5.0, "upvotes": 10.0, "downvotes": 1.0, "helpfulness": 0.9090909090909091, "phelpindex": 0.9156069301887116},{"reviewtext": "who has a weekend to spend trying to learn a board game.  the game is way too complicated to begin playing without reading and re-reading the instructions.  then comes the need to recruit two other people that have nothing better to do with three plus hours (estimated game length once you've learned how to play).  also through other reviews, i've learned that the twilight imperium has game play imbalances that are very difficult to overcome.  the gaming dept for this title should host a forum where people that play this game can meet up with other people that play it.", "rating": 1.0, "upvotes": 8.0, "downvotes": 225.0, "helpfulness": 0.034334763948497854, "phelpindex": 0.5796874983639696},{"reviewtext": "I love Lovecraftian themed games. Unfortunately, it's very hard to find one that's done properly, be it a board game or a video game. I love the theme, but when I got my group together to play a test game, it ended up with a lot of confusion, character deaths, and one poor guy stuck in another world for two FULL turns. The turn orders have FOUR phases! It takes a long time to get any thing done. And even if you try to work with the other players, the mass hordes of monsters will devour them first. This game is supposed to be co-op. But when you can't figure out what you're supposed to be doing, all the fun is pretty much killed. You can find more concise rules and alterations that people have made on Bord Game Geek's site. Fantasy Flight also has some explanantions on their site. I recommned this game for its theme and if you have a huge amount of patience and a good dose of imagination. But if you want something that's fun and not fiddly, I recommend Steve Jackson's Munchkin Cthulu card game.", "rating": 2.0, "upvotes": 4.0, "downvotes": 10.0, "helpfulness": 0.2857142857142857, "phelpindex": 0.7447833294578058},{"reviewtext": "Have sat down with friends twice now and played this game. We are all long time gamers and are familiar with fantasy flight's way of doing things which no doubt helped us learning this game. That being said, the only negative thing I can say about this game is that it takes a long time to setup, and can be slow until you have really got the rules down. Once you have a handle on how things work though, battles are fast and challenging. So far I have always been the overlord, and have enjoyed it. The heroes all seem to enjoy it as well. The same guys that complain in other games whine about the overlord being too powerful, but it really seems well balanced. I am looking forward to playing more and if we continue having fun in the long run (which I see as a very likely possibility), I will be getting the expansions as well.", "rating": 5.0, "upvotes": 16.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9269372746045068},{"reviewtext": "Arkham Horror is perhaps the second most complicated board game in history, so when I heard that this expansion would make the board BIGGER by adding a whole additional town, plus adding two other worlds, new rules and cards AND the Dunwich Horror itself, I was intimidated.  I mean, how many rules, cards and tokens can one person keep track of? After playing it a few times, I got the hang of it and loved it. Dunwich is a village that is only accessible through Arkham's rail station, and it has its own locations and collection of unusual characters.  There's a new twist up there that makes you want to kill the monsters up there in that if any monster moves into a \"vortex\" (that's new), you get closer and closer to the Dunwich Horror showing up, which isn't as powerful as an Ancient One but close enough to wipe you out.  A must-own for Arkham Horror fans (and if the new board is too much for you, you can just take all of the new cards and use them in the main board anyway).", "rating": 5.0, "upvotes": 21.0, "downvotes": 1.0, "helpfulness": 0.9545454545454546, "phelpindex": 0.934576113480866},{"reviewtext": "This game requires to much time to learn and play. I assembled a group of hardcore BSG fans to play one evening. After 3 hours we all had played 1 turn! Take a page from BSG and nuke this game.", "rating": 1.0, "upvotes": 3.0, "downvotes": 41.0, "helpfulness": 0.06818181818181818, "phelpindex": 0.5245844804628642},{"reviewtext": "This is a rare boardgame that's lots of fun and is also true to the show.  Most movie/tv tie-ins are cheap attempts to cash in, but this really feels like playing a character on Battlestar Galactica.It's mostly a cooperative game, but depending on how many people are playing, one or more players are secretly Cylons or Cylon sympathizers that are working against the human crew.  This makes it fun to play again and again, because you never know who is going to be the Cylon next time.It's very well made and will last for many years.  The instructions are very clear with lots of examples that made it easy to learn, plus you can go to [...] or the publisher's website ([....]for tips and updates.", "rating": 5.0, "upvotes": 15.0, "downvotes": 2.0, "helpfulness": 0.8823529411764706, "phelpindex": 0.9119109958359455},{"reviewtext": "I figured that this would be like the Talisman Expansion packs before like the dungeon or the city, but all this comes with is some plastic figurines (which is nicer than the cardboard the original comes with, but really who cares), bigger character cards (big deal) and fate points.  Fate is not really much of a concept in my opinion.  See other reviews for a description.  Anyway, I wish I hadn't bought it, but I don't think I will bother to return it.", "rating": 1.0, "upvotes": 4.0, "downvotes": 49.0, "helpfulness": 0.07547169811320754, "phelpindex": 0.5812185774567054},{"reviewtext": "The above item arrived in sealed box... but with missing components...1. The 10 Story Cards2. 24 Story markersThe Rule book also emitted there existence from the contents of the box... but then illustratively displays and shows how to play the game with the above missing components that are a must... as they are core game component... for the game to be a game and not just game pieces in a box...I have emailed the company they have emailed me back claiming that the above items were shipped to me...", "rating": 1.0, "upvotes": 0.0, "downvotes": 15.0, "helpfulness": 0.0, "phelpindex": 0.5679358355470745},{"reviewtext": "Well, I'm not overwhelmed with satisfaction.The graphics are beautiful and Invite play. The additional figurines are very well made and attractive in only the way Cthulhu can be. I was really looking forward to playing this game.I'm familiar with the topic and Lovecraft, but this is a very complicated game. I was looking for games for two adult players so I thought this would be fun. My husband and I spent about half of the day after Christmas trying to play this game using the written instruction and playing the website tutorial on the laptop in front of us and got nowhere. We couldn't even tell if we had the game set up correctly (we are college graduates with four languages between us and we felt pretty dumb by the end of the day).This may have been our first real role playing game attempt. I'm not quite sure. I thought Risk was a role playing game, but it's pretty straightforward, so maybe not.We are determined to learn this game, so we welcome comments.", "rating": 3.0, "upvotes": 2.0, "downvotes": 11.0, "helpfulness": 0.15384615384615385, "phelpindex": 0.7735939758904034},{"reviewtext": "The title of the package is misleading:  These aren't &#34;clear&#34; sleeves.  They're sleeves that are clear on one side and frosted on the other.  I failed to see that before I ordered. You have to really read into the small print to see the difference. I'm too lazy to return these, so I used them for a game I didn't intend to sleeve at all. I wanted clear sleeves, not &#34;clear/frosted&#34; sleeves.  So, I dock two stars because the title is wholly misleading.That said - shipment was quick, service was good.  Just...for the love of all that is holy, update the title to be more reflective of the product.", "rating": 3.0, "upvotes": 14.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7402975511041809},{"reviewtext": "This is a travesty. Thank you, FFF, for destroying an iconic  franchise and abandoning what made Warhammer great. Clearly, they're going after 'new' gamers, which isn't a bad thing in and of itself, but they've done it in such as a way that basically gives the middle finger to the fans who have carried Warhammer over the years - essentially the people who are responsible for Warhammer still being around today. Alas, as we've seen with D&D;, this is what happens when corporate duechebags get involved in the gaming industry.If you're into fantasy themed board games (and you're already used to paying $100 for a board game) you might like this , but this isn't Warhammer roleplay. You can't dig deep into what makes Warhammer great: the setting and mythos. Playing this is like expecting a beautifully prepared meal and getting a boxed lunch instead.Warhammer FRPGRIP1986-2009", "rating": 1.0, "upvotes": 7.0, "downvotes": 22.0, "helpfulness": 0.2413793103448276, "phelpindex": 0.628043887957024},{"reviewtext": "I have been a big fan of FFG games for some years.  It has been many years since I played an RPG (Role-playing game) but the articles on the FFG site describing this game's development intrigued me - so I took the plunge when I saw the great price here at Amazon.As it turns out this is a wonderful game for newer RPG players, or those like me returning after some time away.  It has excellent rules and tools to support new players while having lots of innovative techniques and features for experienced players.You need to be aware that some owners of the previous editions hate the new one for a variety of reasons and have littered the internet with poorly argued rants against it, at least see if you can try it at a friend's place or local game store and make up your own mind.  If you don't like it then - fine - let us know why so it helps more folks make their own minds up.As others have described here the game is card and token based, which is very visual and tactile - while the rules and the dice support storytelling.  If you do come to like it there may well be added cost down the track - FFG is planning a line of supplemental products which have me tempted already.", "rating": 5.0, "upvotes": 11.0, "downvotes": 5.0, "helpfulness": 0.6875, "phelpindex": 0.9749574337051711},{"reviewtext": "The game is long and a bit complex, takes some serious devotion to play. I have yet to play but its a cool board game,.", "rating": 3.0, "upvotes": 0.0, "downvotes": 12.0, "helpfulness": 0.0, "phelpindex": 0.6504924348240652},{"reviewtext": "Not an easy game to play. Risk is betterSo much going on, very complicated and need atleast a few people", "rating": 3.0, "upvotes": 0.0, "downvotes": 14.0, "helpfulness": 0.0, "phelpindex": 0.6558128992712022},{"reviewtext": "This is one of the card games I hate the most. It's more like a puzzle game, you simply figure out the best possible deck for each scenario and hope for the best. because whereas you have no random things to help you out, the enemies have random shadow effeects that devastate your \"heroes\" (which are no more powerful than allies). I'm all for hard games, like ghost stories and demon's souls, but this game (unlike the ones i mentioned) IS NOT BALANCED. Don't waste your time on this game", "rating": 1.0, "upvotes": 7.0, "downvotes": 13.0, "helpfulness": 0.35, "phelpindex": 0.5900334435631149},{"reviewtext": "This particular unit has been around awhile (I also have one from London branded \"number puzzle\"), now rebranded by Franklin for an American release.First, there is no backlight.Second, some of the puzzles end where two answers are both correct, which drives some Sudoku purists nuts.But these are the Only drawbacks.The unit fits well in the hand, and is easy to use.  You can put in your own puzzles, pause, Undo, and toggle sound.I cannot imagine having a Sudoku handheld game whose screen isn't fully a touchpad, and which doesn't have the ability to put in puzzles from your favorite source!  And I can't imagine I'm the only one either!", "rating": 4.0, "upvotes": 33.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8533654866466869},{"reviewtext": "You can get this for $30 on the Fisher-Price website.  The shipping is less expensive, too.", "rating": 4.0, "upvotes": 46.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7179761033878789},{"reviewtext": "We absolutely loved this calendar that we orginally purchased directly from FP in 2009 for our son. We loved that we could teach our son the real meaning of Christmas. We all love it. This year we added a new member to our family and I knew we needed one just for our daughter too. The FP site sold out before I could order it so I turned to amazon. Unfortunately, we have now ordered two and neither have played the song \"silent night\" as stated in the description. Instead a nice white diamond shape is sewn over the words \"press here\". Big disappointment. Don't be fooled, don't purchase if you are looking for the original FP nativity advent calendar.", "rating": 1.0, "upvotes": 9.0, "downvotes": 2.0, "helpfulness": 0.8181818181818182, "phelpindex": 0.6186392579853907},{"reviewtext": "Lock & Key Diary 'All About Me' I received this last week & had to check it out to be sure it is what I want for my nine year old great goddaughter. She will love it. It has a nice cover, & what looks to be a sturdy lock. I checked that because on some other diaries for girls I see that several people reported having to buy new locks the first day. The pages are mostly lined & simple allowing for the child to do the expressing. but int the front cover it has flowers with places to write stuff like, \"my best friend is\", \"my nickname\". \"my birthday\", \"my favorite color\", & so on. Also the back inside cover has a few things for you to add. The first page is where you put who the diary belongs to. The rest are lined, blue, with a flower at the top & blank. To make it interesting I also bought \"Tear This Book Up\". There are so many things in there she can use with her diary or separately. Just a suggestion & I added for $4 1850 stickers by Lisa Frank. So I know this diary will have great flair, cause I am also including colored ink pens for her to use. I believe it will enhance her reading & writing skills a lot. You can't go wrong with this diary. I love it.", "rating": 5.0, "upvotes": 53.0, "downvotes": 1.0, "helpfulness": 0.9814814814814815, "phelpindex": 1.0087233697246556},{"reviewtext": "if you are white, and enjoy talking like a hip, smooth, African-American, these cards will not help you. about 80% of the cards are dumb and the rest are already common knowledge slang words.", "rating": 1.0, "upvotes": 0.0, "downvotes": 11.0, "helpfulness": 0.0, "phelpindex": 0.5250200926619917},{"reviewtext": "Overall I really like it, it just misses the mark for me, see I find the full PF game system just too damn big and crunchy for my tastes, I was really hoping for a set of rules like the old D&D Basic & Expert (old Red/Blue) box sets, allowing you to play up to at least 10 or 15th level, something to use as a main set of rules, for us who don't have time for these huge mega books with a million and one rules crammed in them and a thousand splat books but capping it at 5 levels kinda sucks, I hope they bring out maybe another box set and expand it a few more levels, maybe to 14th level like the old Expert set, that would be nice.", "rating": 3.0, "upvotes": 6.0, "downvotes": 9.0, "helpfulness": 0.4, "phelpindex": 0.9648530907577904},{"reviewtext": "This toy has captured my 7-yr-old son's imagination. It beat out an iPod, hexbugs, and zoobs (all great toys too). It's not totally intuitive, so be prepared to spend some time teaching kids how to use it. But after a half hour of working together, he's sending it around the house telling everyone merry Christmas. I was skeptical, based on the price, worried that it might be flimsy. The keypad is a bit tough to use (sometimes over sensitive sometimes under sensitive). But for $60, that's not unreasonable. It works exactly as advertised and he LOVES it. If you have a kid who idolizes Grant Imahara, this toy is a must!!", "rating": 5.0, "upvotes": 16.0, "downvotes": 3.0, "helpfulness": 0.8421052631578947, "phelpindex": 0.9260773961452078},{"reviewtext": "Cool stickers, size is ok. They are a bit more darker than the photo posted here. They are squared trimming, i thought they were trimmed on the border of the image.. Nice anyway :)", "rating": 4.0, "upvotes": 18.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7478351863987178},{"reviewtext": "We purchased these cards because they were to have \"answers on the back.\"  Yes the answers are on the back, but so is another math problem.  The answer is in \"fine print\" in a corner.  The description is misleading.  Answers on the back should mean that 7+3 is on one side and 7+3=10 or 10 is on the reverse, not 8+4..These cards are not conducive to \"children checking their answers\" as claimed or to dividing up which problems are known since another problem is on the back.  Walmart carries similar cards with math problems on both sides and the \"answer on the back\"  like these.Also does not include all math facts to 12.  I pulled the +3's and only had about half the facts.  I assume the publisher is relying on someone explaining to child that 5+3 and 3+5 both equal 8.  The problem is that rather than being able to learn all the +3 facts one has to study a hodge podge and mentally learn two steps 5+3=3+5=8.  Very disappointing that this is not spelled out in description, other reviews or on box.I will not be buying other products from this publisher.", "rating": 1.0, "upvotes": 74.0, "downvotes": 13.0, "helpfulness": 0.8505747126436781, "phelpindex": 0.6075767463426511},{"reviewtext": "The non profit I head, Tools of Learning for Children has been helping preschoolers learn to read for 12 years. About 2000 kids a yer. We are expanding our scope by developing a program that will teach them the basics of math and numbers.  the abacus is essential in teaching numbers as quantities. I would like to review again a year from now after our pilot program is complete. About 300  4 year olds are participating in the pilot.. Initial responses of teachers has been excelent.", "rating": 5.0, "upvotes": 1.0, "downvotes": 12.0, "helpfulness": 0.07692307692307693, "phelpindex": 0.8810178061123981},{"reviewtext": "MoM has excellent looking pieces, clear rules and a modular system that should support replayability... but the core concept of players vs a DM just doesn't work. Simply put, it's very difficult to get invested when 1 player (the DM) has a turn on every players turn, plus his own, and generally has little trouble stomping out your hopes for victory. And there lies the problem (as best I can tell) that the DM isn't really supposed to try to win - his or her job is really just to flavor the story and lead the players along. Unfortunately, that's ill communicated in the rules and hard for most players to grasp and the result is a game where 2-4 players get to do very little while 1 player interrupts their turns and, after an hour or so, wins the game.Not a problem if your group goes in with the right mindset, but not really fun at all without that.", "rating": 2.0, "upvotes": 7.0, "downvotes": 6.0, "helpfulness": 0.5384615384615384, "phelpindex": 0.7205357530051554},{"reviewtext": "I was so excited for this but it is not as fun as i hoped it only comes with Dom,Baird,Cole,and Marcus where is carmine and hoffman?Plus there are not that many different missions where is versus?Plus where are the grenadiers,beast riders.50 dollars for this game dont buy, the lowest i would buy this game for is 30 dollars maybe only 25 dollars.Forgot to mention you need nose plugs, when I opened the box it smelt so bad and wierd (and it still does) it gives me a headache!!", "rating": 3.0, "upvotes": 1.0, "downvotes": 14.0, "helpfulness": 0.06666666666666667, "phelpindex": 0.7677914828975916},{"reviewtext": "For fans of Descent 1st Edition, be sure you know what you like about the first one before buying this one. There are significant changes, but overall, the game moves towards long term playability through shorter quests and fewer \"stuff\" to worry about. It's not that they have removed the core essence of the game, just that they have gone in a slightly different direction with the game.For those new to Descent or other \"dungeon crawl\" games, this game feels very much like a fast paced miniatures strategy game pitting the wits of the a group of heroes against the evil machinations of the \"Overlord\" player. With plenty of room for expansion but still providing enough quests to keep you occupied for some time, Descent 2nd Edition has a lot of fun packed into the box. I've been a fan of Fantasy Flight Games board games for quite some time and this is one of their top productions.The thing I like most is how fluidly the game plays. There are few times when the game has to stop to check rules or to figure out what the results of all the dice mean. I was skeptical of the new version, but the play style has definitely won me over.", "rating": 4.0, "upvotes": 59.0, "downvotes": 6.0, "helpfulness": 0.9076923076923077, "phelpindex": 0.8769617927161601},{"reviewtext": "A great retelling of the Talisman game engine, with the rich history and world of Warhammer 40K.Relic follows the same basic mechanic, but with additional factors like exploding dice, corruption, and a \"more cooperative\" approach (don't worry, you'll still undercut each other in great talisman faction).Gameplay is much faster than Talisman, about 2-3 hours for a first play though, and the level caps encourage players to get to the finale, instead of drifting about for longer and longer (as often happens in Talisman).I'd heartily recommend for any Talisman or Warhammer 40K fan, or even just for somebody interested in trying out a great new game!", "rating": 5.0, "upvotes": 17.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 1.0681071887083993},{"reviewtext": "Heads up to any Imperial Players getting into the X-Wings miniatures game - you are going to need a lot of these. While the starter is a bit of a better deal (2 Ties, and the additional X-Wing), you will want at least one of these Expansions for the new cards that are included.", "rating": 5.0, "upvotes": 11.0, "downvotes": 1.0, "helpfulness": 0.9166666666666666, "phelpindex": 0.8619328198641749},{"reviewtext": "I was excited to get my item in the mail to start playing as Darth Vadar. It finally arrive in its package only to have the wings broken off. This is a cheaply made plastic replica. The product looked great, but it was broken before it was ever opened. I would highly recommend buying this product from a comic book store or a board gaming store as that way you can inspect your product beforehand. It also would make exchanging the item much easier. But please note that the other pieces are also cheap plastic, so even after opening them you have to be very careful.", "rating": 1.0, "upvotes": 1.0, "downvotes": 31.0, "helpfulness": 0.03125, "phelpindex": 0.5979706264104564},{"reviewtext": "Would be a five star but game arrived used when it was listed as new. It game board was broken out the box.", "rating": 2.0, "upvotes": 0.0, "downvotes": 13.0, "helpfulness": 0.0, "phelpindex": 0.5752050990857526},{"reviewtext": "Many people will compare Android: Netrunner to Magic: The Gathering simply because they share the same creator. They would be right to compare the two, and ultimately Netrunner takes the cake as the best of the two. It is a great revamp of a classic, and there is nothing more fun than tricking your opponent into making a run on you.Really, I can't recommend this product enough. I'll take ten!", "rating": 5.0, "upvotes": 11.0, "downvotes": 4.0, "helpfulness": 0.7333333333333333, "phelpindex": 0.8723801610448875},{"reviewtext": "If you're looking for a light, family-friendly game, this isn't it. The atmosphere of this game is very dark and somewhat sadistic. It also contains material that some may find inappropriate and/or offensive. We can't comment on the actual game play, since we returned it after looking through the content.", "rating": 1.0, "upvotes": 9.0, "downvotes": 245.0, "helpfulness": 0.03543307086614173, "phelpindex": 0.5497785424110057},{"reviewtext": "This game started off fine with my group of 6 players. The combat and rolls are so difficult to understand (coming from a d20 style of gameplay) that after over an hour and 30 minutes of trying to figure out the nemesis fight, we gave up, packed the game up and instantly went and changed to playing the original wizards of the coast star wars rpg. This game LOOKS nice, but in all respects it is very overly complicated with the custom dice. It hinders the flow of the game pretty quickly. I would not recommend this role playing system to my worst enemy.", "rating": 1.0, "upvotes": 4.0, "downvotes": 19.0, "helpfulness": 0.17391304347826086, "phelpindex": 0.6030003944407818},{"reviewtext": "I'll keep this short. If you are a fan of Arkham, get this. If you've never played Arkham, get this. It's stream lined Arkham. The instructions (compared to Arkham) are fantastic. You get a quick (16 pages) rule book and also a reference book to bring to the table. During our first play through the reference book was a great asset (especially when rolling for assets:).Overall the game is great fun. It is Arkham on a global scale yet more manageable and easier to jump into. Also, the theme still holds up. And as always, Fantasy Flight components are top notch.Only word of warning: it comes with only four Ancient Ones. I'm assuming, like Arkham, there are many expansions forthcoming.", "rating": 4.0, "upvotes": 26.0, "downvotes": 5.0, "helpfulness": 0.8387096774193549, "phelpindex": 0.8475967366630812},{"reviewtext": "My 6 year old son loves this science kit. It contains some very well thought out activities with easy to follow instructions (although, for a 6 year old, you're oging to be helping along). Not just a toy...it really does teach some fundamental physics.Having purchased the Light kit, I'm going to get some more of them.Oh, and by the way, the grown-ups will probably like playing with this kit as well :-)For the rpice, you just can't go wrong in my opinion.", "rating": 5.0, "upvotes": 53.0, "downvotes": 2.0, "helpfulness": 0.9636363636363636, "phelpindex": 0.9030337454791928},{"reviewtext": "My 9 year old son was amazed at the results he got from each experiment.  He would just light up with each successful outcome- which is easy to achieve with the instructions.  This has been a great learning tool for him.", "rating": 5.0, "upvotes": 19.0, "downvotes": 1.0, "helpfulness": 0.95, "phelpindex": 0.8383016340654977},{"reviewtext": "This game is pretty lame.  There's not much strategy involved, you never know if you're close to winning or not.  So you might play a game for 15 minutes without having a clue as to who's doing well or not, and then all of the sudden you might win through no real effort on your part.", "rating": 1.0, "upvotes": 17.0, "downvotes": 38.0, "helpfulness": 0.3090909090909091, "phelpindex": 0.5552079534934805},{"reviewtext": "I played this game with a close family member and was in love with it at first sight.  Unlike Scrabble, you play somewhat independently and are able to rearrange words constantly to make your letters fit and to create new words.  You know that annoying friend or family who always takes your spot in scrabble??? They can't take the spot you wanted to use!  You're truly working against the clock to be the first to say \"Bananas!\"I've bought it for everyone I know as a gift since then.  It's original, super fun and portable.  A great game to travel with, play in hotel, at pool, on plane, keep kids busy at restaurant (or you and your friend/ spouse) while waiting for dinner!  Lots of ways to use this portable, simple game.I highly recommend and will continue to give this as a gift.Only negative I can conceive...durability.  Be careful of marking the letters somehow.  We hope no one cheats, but if you scratch them on a black table...well then...try to clean it off.", "rating": 5.0, "upvotes": 108.0, "downvotes": 7.0, "helpfulness": 0.9391304347826087, "phelpindex": 0.9605848538878027},{"reviewtext": "I honestly cannot believe that this game has so many good reviews!  We got it two years ago as a gift and my whole family (a family of game players) tried it.  Oh my goodness!  This is the most antisocial game of all time!  You don't talk to anyone or interact with anyone.  You just work by yourself until someone is done.  I guess in the age of facebook, e-mail, and twitter, this is the game for America.  You don't actually have to be social, yet you can feel good because you are sitting next to someone under the pretense of playing a game \"with\" them.  This game should be played by one person who has nothing better to do.  Don't waste your family time playing this game.  Find something that encourages your family to talk to each other.  That's what we need.", "rating": 1.0, "upvotes": 23.0, "downvotes": 26.0, "helpfulness": 0.46938775510204084, "phelpindex": 0.6302898173047162},{"reviewtext": "If you are a scrabble fan but don't like waiting around for your turn this is the game for you. Because everyone plays simultaneously there's none of that pesky waiting for slow pokes to figure out what word to make....YAWWWN (BORING!) Not this game! From the moment one person says \"SPLIT\" it's a race. I love that you can change words during play and you can get rid of that annoying Q when there's not a U in sight, of course it'll cost ya but sometimes it's well worth it. It can be a bit intimidating to people who don't think quick or have a quick grasp of words. It's very unpredictable. Things can change so quickly, that no 2 games are alike. And it doesn't always turn out the way you think it will. It keeps things interesting. I love this game and so does the rest of my family!!", "rating": 5.0, "upvotes": 9.0, "downvotes": 2.0, "helpfulness": 0.8181818181818182, "phelpindex": 0.9404910756553821},{"reviewtext": "I played this once and had to buy it for each of my grandchildren. Great game for all ages!", "rating": 5.0, "upvotes": 17.0, "downvotes": 1.0, "helpfulness": 0.9444444444444444, "phelpindex": 0.7954277930782399},{"reviewtext": "Perhaps it is just what others have liked about this game - freedom from scrabble's tyrannical board - is what I disliked about it the most in the end.I am a huge fan of word games but I think the crucial ingredient in making this particular one fun is the presence of kids/teens. Just adults will find this pretty much a waste of their time even if they are big on word games/crosswords/boggle/scrabble etc.", "rating": 1.0, "upvotes": 12.0, "downvotes": 33.0, "helpfulness": 0.26666666666666666, "phelpindex": 0.5916818444439494},{"reviewtext": "I was shopping for a Christmas gift for my niece last December, and came across all of these rave reviews for Bananagrams. So I bought one for us 50/60-somethings instead (she'll get one this year.) It lives on the kitchen table and we play a few games almost every morning before we go to work. GREAT GAME!!!!! No waiting around for your turn, no angst trying to achieve the triple-word-value square, no getting stuck with hopeless letters turn after turn, no arguments, no dictionary - just pure love of and fun with words. It's complete flexible and you can easily change the rules, for example if you are playing with a novice or child, or just for a change (try playing into and building onto your opponent's pattern.) It definitely gets tossed into my travel bag from now on.", "rating": 5.0, "upvotes": 32.0, "downvotes": 2.0, "helpfulness": 0.9411764705882353, "phelpindex": 0.9247327813327052},{"reviewtext": "All of the \"10 Days\" games are fun, and 10 Days in the Americas is no exception.  A new area to explore (North, Central & South America and the Caribbean) and a new twist (\"cruises\", in which you can string together sequences of oceans) make this a great addition to the series.", "rating": 5.0, "upvotes": 14.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8578649639449484},{"reviewtext": "Do not order this toy as you won't get what you ordered delivered to you! I ordered this for my nephew for christmas and instead he has sent a circuits toy that he already had.", "rating": 1.0, "upvotes": 0.0, "downvotes": 26.0, "helpfulness": 0.0, "phelpindex": 0.5258652569901769},{"reviewtext": "I was trying to find a game to play with a client who has dementia and ran across this in an article.  After I bought it I tested it out with my kids (25, 24, 19 and 11) and myself (47).  We had so much fun!! It is one of those games that can be played at different levels.  We started getting quite inventive on where and when to play to maximize our points and block our opponents.I then played with my client.  She and I did not keep score.  We just made the chains with either shapes or colors and added wherever she first recognized a play.  No trying to strategize where to build for future etc.  We also played with both of our tiles up so we could talk about the best places to play.  She likes this game and actually remembers having played before and wants to play again.  The 'rules' have to be re-learned but the fun remains.For one more note, we had a group of my daughters friends over and four of us played Quirkle.  They were all 19 - 22.  That got pretty cutthroat &lt;lol>  They all want to play again.I HIGHLY recommend this game.  I think I'm going to buy a 2nd one so more than 4 can play together (We played with 5 first night and it does work too).", "rating": 5.0, "upvotes": 330.0, "downvotes": 10.0, "helpfulness": 0.9705882352941176, "phelpindex": 0.9935455729075997},{"reviewtext": "I purchased this game after playing it a few times with friends. Their game, only 3 months old, has wooden pieces. The new version has cheap, hollow plastic pieces. You spend the entire game handling these pieces, and the sharp edged plastic pieces are not a substitute. I guess I'll get out the table saw and make new ones. Then I can donate the old ones to a thrift store.", "rating": 1.0, "upvotes": 8.0, "downvotes": 3.0, "helpfulness": 0.7272727272727273, "phelpindex": 0.5542467456669345},{"reviewtext": "Purchased this for our 6 year old.  tried to play it once.  the instructions were too difficult to understand and play.  getting rid of it today.", "rating": 1.0, "upvotes": 1.0, "downvotes": 12.0, "helpfulness": 0.07692307692307693, "phelpindex": 0.5084338495010318},{"reviewtext": "This is a fun game for two to four people and can be played by kids and adults.  We often get together with family groups and like to play games in the evening.  This is a game that the kids can get in on.  Also, once the kids have gone to sleep, some of the adults can become a little &lt;ahem> the worse for wear, and this is a game they can still manage!Though I like the gameplay for these reasons, I'm not at all impressed by the workmanship.  The tiles are made from very cheap, light wood.  When I unpacked the game for the first time, a tile fell on the floor and my dog picked it up and bit it in half with no effort at all.  Also, the red and orange colored tiles look too much alike.  If the table isn't very brightly lit, it's tough to tell those two colors apart.  These issues made me think about how you could easily make your own Qwirkle tiles, and better than the original.  I wish they'd come out with a version made from resin, like Mexican train domino sets.  That would make for much sturdier tiles and could solve the color problem.", "rating": 4.0, "upvotes": 12.0, "downvotes": 1.0, "helpfulness": 0.9230769230769231, "phelpindex": 0.8894775753457151},{"reviewtext": "I purchase this for a six year old nephew, and the whole family joined in to break in this game.  It was easy to understand, but challenging.  My nephew really enjoyed the game, but it was hard for  the adults not to be competitive when playing. The game is fun, and it makes you want to out-think the opponents.From what I hear, my brother's family has been playing the game almost daily since my nephew received it.  What better reception could there be for a game?This game is money well spent.  I believe that it will help my nephew develop logical thinking skills and strategy development.  The fact that he is smiling all the while, is icing on the cake.", "rating": 5.0, "upvotes": 382.0, "downvotes": 22.0, "helpfulness": 0.9455445544554455, "phelpindex": 0.8866998580259328},{"reviewtext": "This game looks very fun based on the instructions and other reviews. I would have liked to give it 5 stars. However, despite the price the manufacturer has elected to paint the pieces in the worst possible paint. I have never experienced anything like it. As a tutor, I have many games. Occasionally I buy one that must sit outside for a few weeks due to its toxic odor. I have brought this game in several times in the last year hoping it would finally be ready. It still smells! I am beginning to wonder if the toxic odor will ever disappear. Skip this game and try Blokus or Othello.", "rating": 2.0, "upvotes": 11.0, "downvotes": 10.0, "helpfulness": 0.5238095238095238, "phelpindex": 0.6804937813759894},{"reviewtext": "This was purchased for my husband for his birthday.  He is a huge Star Trek fan.  We played this with our adult children and he wiped the floor with us!  He still found the questions to be quite challenging and was impressed with the caliber of questions.  It was a good choice for him.", "rating": 4.0, "upvotes": 11.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7668116920469381},{"reviewtext": "I guess it was because I told the boys that girls liked Twilight because Edward was the 'perfect' boyfriend....but after that, my teen boys, 14 and 15, started studying the Twilight movies like they were some magickal text.  They swear that they HATE Twilight, but couldn't wait to dive into this game when I got it.The game is hard, but it's fun for them, and I play it too. I  really liked the books, and I'd think I'd have an advantage, but I don't seem to, as I never win. There's a lot about character names.  I'm bad with names.  The puzzles include putting the scenes in order. I really like those.There's a short version and a long version.  The short version takes the 3 of us an hour.  It's a well made game.  Our biggest complaint is the narrator's voice.  It is supposed to be \"Carlisle\" from Twilight but it just sounds like, as my son puts it, \"Some guy sounding fake English.\"I've had it 3 weeks now, and it's been played 5 times.  I've no doubt when we have company it will get pulled out again.  This would be GREAT for slumber parties.", "rating": 4.0, "upvotes": 12.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8973736652594699},{"reviewtext": "This game is Awesome!! Me and my daughter are major Twihards and we have a blast not only playing this together, but with all her friends. There are so many movie clips, puzzles, and you can also do your own charades with this game. Overall, it is a great game for tweens, teens, and even Twimoms like me!!", "rating": 5.0, "upvotes": 17.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8508152581585279},{"reviewtext": "A nice supplement, great quality, 72 words, but with one \"the,\" one \"and,\" and one \"s\" not a stand-alone pack.  Comes in a nice small metal re-usable box, so nicely portable.Contains: a*2, an, the; and, but, or, as; always; in, of, to, on, for, with; I*2, me, my, he, she, it, you, your, we, our, us;be, am, is, are, have, do, feel, like, will, bring*2, make, sing, happen, giggle, laugh, love, give, take, glow;anything, blue sky (one tile), day, friend, happiness, heart, laughter, rainbow,  smile, sunshine, vibration, warmth;good, better, brilliant, ecstatic, full, happy, jubilant, positive;s, ed, er, ing.", "rating": 4.0, "upvotes": 80.0, "downvotes": 1.0, "helpfulness": 0.9876543209876543, "phelpindex": 0.938522995453803},{"reviewtext": "Gave this as a fun Valentine's Day gift and my boyfriend loved it.  The words are playful, if not downright dirty.  Gave it only 3 stars because there just aren't enough pronouns and adverbs in this kit to easily make a few coherent sentences or long phrases at a time.  (Needs more repeats of \"basic\" words like his/hers/it/i/you/he/she/him/her/was/is/has/am/the/are in order to make it more practical.)  All in all, it's a fun addition to other magnetic poetry kits, but it can lose interest fast if these are the ONLY magnetic words you have to work with.I also wanted to mention that the item was much smaller in size than I imagined. It was hard to tell from the picture, but the case is about the size of a small box of matches.  Fortunately it wasn't a big deal in my situation, but it might be good to know if you're planning to give as a gift.", "rating": 3.0, "upvotes": 11.0, "downvotes": 3.0, "helpfulness": 0.7857142857142857, "phelpindex": 0.776741899263452},{"reviewtext": "My kids and I were intrigued by the idea of a hunger-games game. We have all read (and enjoyed) the books and we bought the game based upon our belief that the books are  well-written and entertaining.  The game, however, disappoints.Initially, the game has very little connection to the spirit of the books.  The premise of the game (gathering approval points) was an idea rejected by the main character (as was the act of participating in the hunger games - including training).Not only does the game miss the mark from an ideological point of view (as noted, if you identify with the main character of the books, you will likely be disappointed with the game's premise), it also fails to entertain.  Gameplay is tedious and mechanical. It is as if the game's creators intentionally set out to make the most tiresome game imaginable. My kids and I gave up after one round of play.I would not recommend this game.  If you hope to recapture the feeling that the books bring about by playing the game, you will, in my opinion, be disappointed. Notwithstanding this, the game itself lacks entertainment value.", "rating": 1.0, "upvotes": 7.0, "downvotes": 6.0, "helpfulness": 0.5384615384615384, "phelpindex": 0.605484833015219},{"reviewtext": "My friends and I like this version of Fluxx the most out of all of the ones we've played - I also have the Zombie and Stoner editions.  You can play Fluxx over and over because of how dynamic and varying the game is.  An earlier reviewer said that there isn't opportunity for strategy - not true at all; if you play enough times you can work out what people are planning to do, not to mention the variety of cards that can really be a disadvantage to others. In general, Fluxx (any version) is an amazing game that always changes, but the reason we like this Fluxx the most is because this edition holds \"Surprise\" cards; you might not understand what this means if you've never played Fluxx before but trust us veteran Fluxxers - its a complete game-changer!", "rating": 5.0, "upvotes": 11.0, "downvotes": 2.0, "helpfulness": 0.8461538461538461, "phelpindex": 0.9150909587558458},{"reviewtext": "Dungeon Roll is an addictive dice-based role-playing game. I picked this up via their original Kickstarter and am very impressed with the quality, art, and amount of fun I've had. Even people who have never played a role-playing game were able to quickly pick this up and start having some fun.That being said, this would be a 5-star review if the instruction manual was a little more thorough in explaining some things, like the use of scrolls and potions. Video examples of gameplay on YouTube are a big help, especially the WatchItPlayed series on the game.But don't let that detract from what is one of the most fun games I've played in the last year!", "rating": 4.0, "upvotes": 15.0, "downvotes": 2.0, "helpfulness": 0.8823529411764706, "phelpindex": 0.840988045237532},{"reviewtext": "I HAD TO REUTRN THIS ITEM DUE TO IT HAVING A PLASTIC TOTEM, I THEN CONTACTED THE COMPANY IN CANADA AND PURCHASED THE FRENCH VERSION SO I COULD HAVE A WOODEN TOTEM. TOO MANY PEOPLE IN THE USA COMPLAINED ABOUT HOW DANGEROUS THE WOODEN TOTEM WAS WHEN PEOPLE GRABBED FOR IT. SO THE USA REPACKAGED IT ALL WITH A CHEAP PLASTIC ONE. BUT THE GAME IS ONE OF THE BEST WE HAVE EVER PLAYED, I LIKED IT SO WELL I BOUGHT 2 OF THE FRENCH VERSIONS.", "rating": 5.0, "upvotes": 9.0, "downvotes": 4.0, "helpfulness": 0.6923076923076923, "phelpindex": 0.8573034563479115},{"reviewtext": "This is a perfect game: easy to learn for both the \"basic\" and \"advanced\" modes, fast to set up, really fun and very enjoyable for all family members.It is also very flexible in terms of game length, you can play a single lap in some 20 minutes, or can plan for a full racing season that may take a full day if you desire. Also it is very flexible in terms of number of players, as it can be 2-10. I have even played it solo (practice mode?) and even then is quite fun. You can also play with \"stock cars\" or can even make your custom ones.Worthily is to mention the top notch quality of all its components. I just wish the cars were bigger, but as it is the board is already big enough!", "rating": 5.0, "upvotes": 13.0, "downvotes": 2.0, "helpfulness": 0.8666666666666667, "phelpindex": 0.9129289148330615},{"reviewtext": "I had to return this edition because this is the cheap version, you all want the \"international\" version with the really cool board set for keeping count. This product is kind of misleading by only showing the cover and not describing what's inside the box. I don't get burned often on amazon, but this was an exception.", "rating": 1.0, "upvotes": 18.0, "downvotes": 9.0, "helpfulness": 0.6666666666666666, "phelpindex": 0.5663510691736708},{"reviewtext": "I bought this because it looked like a good game to play with my girlfriend.  Who knew her little brother, 8, would like it, she would love it, my casual gaming group call for it by name, and my hard core gaming group clamored enough that I bought the other 3 expansions.Though this is technically the second expansion of the base game, the Historical Events deck is the best introductory deck, followed by the original Timeline : Inventions deck.  The 2nd deck, Discoveries,  gets the most complaints from my casual group (lots of MBAs and doctorates in this group) due to dates, but all 3 current games are good and I've pre ordered the 4th.", "rating": 5.0, "upvotes": 11.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.9089153283273127},{"reviewtext": "I bought this figure originally because of how cute it was. Later I learned that they are called 'nendoroid' figures and that it is very hard to find the real versions. I then researched extensively the difference between bootleg version and the real versions. Once my figure arrived, I inspected it very carefully to find that it is in fact a bootleg. They eyes are shiny, the stand does not always work perfectly (you have to have it at the right angle), the cat figure falls out of his hands easily, and there is also a slight mis-coloring of the suit, and other small details. So if you are looking for the 'real' nedoroid this is not it.However, the figure is still well made even though it isn't the 'true' nendoroid. I still love it and it is adorable and perfect for displaying on my desk! If you just want a really cute Sebastian figure then I say buy it :) but do have in mind it is a bootleg and not the real nendoroid if you are looking to add it to your nendoroid collection! In the future, I think I will try to search for the real figure, but in the mean time this one is adorable and worth keeping.hope this helps~", "rating": 3.0, "upvotes": 28.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.759248385865738},{"reviewtext": "That was my first thought upon opening the package. Big head, with big expressive eyes, tiny body that can be ripped apart like the black knight from Monty Python and the Holy Grail... what's not to love? He currently stands on my desk judging my activities as I peruse the internet :3The little cat that he comes with is really cute too!", "rating": 5.0, "upvotes": 12.0, "downvotes": 2.0, "helpfulness": 0.8571428571428571, "phelpindex": 0.8805378365955869},{"reviewtext": "Out of the box never got enough rotor speed to even lift off the ground.  What a disappointment.  I was convinced that the other negative reviews with similar problems were just flukes (since there are so many positive ratings) but looks like other recent reviewers are having more of the same issue.  Purchase was on Amazon but through another merchant.  Will see how responsive they are with a defective return.  Buy with caution.Update - just realized from reading one of the other reviews that what was shipped to me was a 'knock off' and isn't even the Syma brand as advertised.  Purchased via More & Less on Amazon.  Beware when buying from this seller.", "rating": 1.0, "upvotes": 12.0, "downvotes": 4.0, "helpfulness": 0.75, "phelpindex": 0.6099307355330529},{"reviewtext": "This helicopter is rather educational for my 6 year old son who saved up his money over the past months to buy.Lessons Learned...1) Overcoming disappointment.2) Patience waiting for a different model to show up.3) Stay in school... so you learnt to right gooder InschructIONs then them that come in that S107. (and in this here review)4) Do not store up for yourselves treasure on earth, where moth and rust destroy.Other than that, I wouldn't recommend this helicopter.  You're rolling the dice on quality.  A miriad of \"QC Passed\" stickers holds this thing together.  But even so, the transmitter wouldn't sync up with the helicopter.  The green light on the transmitter justs blinks, but never goes to a steady green.  Tried switching between the different bands (it has an interesting 2-position switch - labeled \"A\", \"B\" & \"C\" - another educational moment in counting).  Also tried new batteries, same thing.  After searching RC forums, I found this is a common problem, only remedied by returning the unit and writing a 1-star review.", "rating": 1.0, "upvotes": 25.0, "downvotes": 12.0, "helpfulness": 0.6756756756756757, "phelpindex": 0.6636725567031478},{"reviewtext": "bought the s107 at a local mall here in NY for $41.00. Have had a bunch of cheap air hogs purchased at target.  This is a whole new category.  It's super easy to fly and has controllable forward and reverse motion and is very stable, you can really tell the difference with the gyro. I can hold a hover as long as the battery will last (about 5 minutes)  The helicopter is also very durable.  I have repeatedly crashed it into things, but there has been no damage except for some nicks on the leading edge of the rotors and a bent landing skid.  None of which effects performance.  The helicopter charges from a USB connection as well as the remote.  I only charge mine from the computer since the batteries in the remote seem to last much longer that way.  For thirty dollars here at amazon you can't beat the value.  I got bored quickly with the airhog helicopters, and once they received damage that was it.  Amazon and xheli sell replacement parts for the s107, so theoretically you could fly this thing forever.  You definitely won't get tired of it.", "rating": 5.0, "upvotes": 12.0, "downvotes": 2.0, "helpfulness": 0.8571428571428571, "phelpindex": 0.9770620352193425},{"reviewtext": "Flying this thing around my apartment is one of the most fun things ever. it is a little loud and sounds like a mini dirt devil.It is really really easy to fly and the remote control is easy to use as is the flight correction controls. Learning to fly it and even now i have crashed it ever which way and the copter still flies like the day it came out of the box. this is a well built toy i would be impressed if someone managed to crash it in such a way that it breaks.I am very satisfied with my purchase. Also before i purchased this copter at amazon i searched the web for it you wont find it anywhere any cheaper than you will here", "rating": 5.0, "upvotes": 14.0, "downvotes": 1.0, "helpfulness": 0.9333333333333333, "phelpindex": 0.8986289625573571},{"reviewtext": "This seems to be a very reasonably priced charger that has most of the features of my expensive charger.  The best things are that there is no fan, all metal construction, and can be plugged into your wall.  Very easy to use.  It takes about 72 minutes to charge up my 2200 mAH LiPO.", "rating": 5.0, "upvotes": 19.0, "downvotes": 1.0, "helpfulness": 0.95, "phelpindex": 0.8504239568933017},{"reviewtext": "This mahjong set is excellent because you can use it to play either the Chinese game or the Western game, due to the inclusion of Jokers! The pushers (or helping hands) are very convenient to \"curtsey\" the wall.  The instrustions are very clear, so beginner's will be able to play right away.", "rating": 5.0, "upvotes": 25.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.8519899001303316},{"reviewtext": "I am a new player.  Love the set.  My co-mah jonggers love it as well.  The pushers are so handy.  I received the merchandise in a very timely manner and in good shape.  Highly recommended.", "rating": 5.0, "upvotes": 13.0, "downvotes": 1.0, "helpfulness": 0.9285714285714286, "phelpindex": 0.8251158323424876},{"reviewtext": "When I received this order I found that I had two Rins instead of having a Len and then they expect me to pay for shipping to return this item when this was their mistake in the first place!!! Because of their mistake I am now stuck with an incomplete Vocaloid set! Besides from that the box was in terrible condition when I received it and some of the Vocaloid characters are terribly painted to where it looks like they are faded such as Luka's hair which is more of a lavender than a bright pink and Miko's hair was blonde instead of brown.Horrible customer service and horrible item; I will never buy from this company ever again and I recommend everyone to do the same.", "rating": 1.0, "upvotes": 47.0, "downvotes": 6.0, "helpfulness": 0.8867924528301887, "phelpindex": 0.621809330819221},{"reviewtext": "Do not listen to all the bad reviews. there's nothing wrong with this item or ateast its not near as bad as people are making it out to be. i bought them expecting ok figures, but they're better than ok. yes the ones with the headphones are definately messed up because they painted the tip the same color as the character's hair but that can be easily painted. they're are a few places where they either weren't painted well or had a small paint chip but yet again you can repaint it. you can expect figures for this cheap to not have some minor flaws. they're cute and great for any collection. so dont trust the negative reveiws and get them! you can't trust reviews alot of the time anyhow. i've gottem things that everyone said was good and it wasn't.", "rating": 5.0, "upvotes": 1.0, "downvotes": 13.0, "helpfulness": 0.07142857142857142, "phelpindex": 0.9198283635707122},{"reviewtext": "Dragonite is my favorite Pokemon so I wanted to buy the plush toy of it. Not gonna lie, it was a bit pricey, but hey, it was worth it. Good quality, so cute. Happy with the purchase. Might even buy more soon :D", "rating": 5.0, "upvotes": 9.0, "downvotes": 2.0, "helpfulness": 0.8181818181818182, "phelpindex": 0.8313045328066083},{"reviewtext": "Fun for everyone.  It's a great way for youngsters to develop their math and logic skills without even realizing it.  Games often go down to the wire, so there's plenty of excitment as well!  Easily portable, Battleship is perfect for long car trips or vacations, and finding the little white and red pegs under the sofa years later will remind you of the good old days.", "rating": 5.0, "upvotes": 16.0, "downvotes": 1.0, "helpfulness": 0.9411764705882353, "phelpindex": 0.8730529859104108},{"reviewtext": "We grew up playing this classic game and encouraged this as a gift for our 7 year old.  He loves the concept and the play.  And we remember fondly the red and blue games of old.But there are major issues with the build of this game.Fit:  The pins don't all fit into the space allocated for them.  You can't properly close the units with all the pins.Playing board - Bottom:  There is no \"floor\" under the pins.  If you try to play the game holding the units, or sitting them on your lap, you will push up any pins sticking through the floor of the unit.  Very annoying.Playing board - Top:  The pins do not securely fit into their holes.  Any slight jostle will cause the pins to tumble out of their holes destroying any record of where you have fired and what ships you have sunk.I also miss the 5 little holes in the old clasps of the old units.  We always placed red pins in the holes as visual bragging tags to remind our opponents how many ships we had sunk!  But that's not a functional issue, per se.I recommend searching out the real classic units before investing in this \"updated\" version.  We'll be returning this one to the store.", "rating": 2.0, "upvotes": 18.0, "downvotes": 0.0, "helpfulness": 1.0, "phelpindex": 0.7250552180742675},{"reviewtext": "I'm in my 50s and I've been playing this fun card game since I was just a kid.  It's great fun, and now my own kids are fans of the game as well. It's a card game in which you are traveling in a auto race across county. The object is to lay down distance cards to total 1000 miles before your opponents.  However, along the way, your opponents may try to slow you down by giving you a \"speed limit\" card or try to stop you with hazard cards such as a \"flat tire\", \"out of gas\", or \"accident\", and you must get the proper remedy card to resume play.  It's a fast moving game with a minor amount of strategy.  It's anyone's game to win right up to the end. A real classic that your family will enjoy for years to come, like mine!", "rating": 5.0, "upvotes": 14.0, "downvotes": 1.0, "helpfulness": 0.9333333333333333, "phelpindex": 0.9201103132962519},{"reviewtext": "Our family favorite game. We take this game on vacations///cruises/// and laugh so hard at the drawings that emerge. A word is picked from a certain catagory and there's only a certain amount of time allowed to draw and let your team mate guess the word. ANY age can play and everyone has a real good time. Sometimes the opposite team member gets so caught up in the drawings made and the fun and fast pace, that they will shout out what they think the drawing is and might be helping an opponent. I love this game.........IT&quot;S SUPER-DOOPER FUN!!!!!!!!!!", "rating": 5.0, "upvotes": 27.0, "downvotes": 2.0, "helpfulness": 0.9310344827586207, "phelpindex": 0.8985187377395072},{"reviewtext": "I was at a family event last week and we were all trying to figure out what to do. The suggestion for a movie came up. One of my cousins fought the idea saying he didn't come all the way to visit so we could all sit together in the dark to watch a film. So we went to Walmart and bought some games. Taboo, Cranium, and Pictionary. Well, we had such a great time together. We really laughed and bonded. That weekend as we rode around one cousin pulled out a singing lesson Cd and played it in the car, Voice Lessons To Go by Vaccarino, so we all sang together in our car like crazies- again having the best time. The rest of the weekend, we played more games and never thought about turning on the TV or watching a film. My niece even played the piano for us one night and we sang songs from a song book. These games really help bring back the communication our generation has lost.", "rating": 5.0, "upvotes": 13.0, "downvotes": 6.0, "helpfulness": 0.6842105263157895, "phelpindex": 0.9469999898279569},{"reviewtext": "This game is definitely a lot of fun, and for quick thinkers.  The plusses are well explained in other reviews.  A few other things to consider, however:1) Don't buy batteries (not included w/ the game).  Really, there isn't much use for the buzzer, &amp; it can be extremely annoying.  There's enough excitement with the gameplay itself.  The opposing team can just yell out &quot;buzz,&quot; if they so desire.2) Relatedly, the only things that you really need are the cards.  The rest is just fluff.  If you are familiar with the concept &amp; rules, save yourself some $ and buy a booster pack.  The booster is simply another stack of the cards with new words.3) As in a lot of newer games, there are the inevitable current event (or not so current) related topics.  If you don't know who Kenneth Starr or John Glenn are, you will be stymied on a few.4) The better you know your partner(s), the better you will do.  A lot of points come from saying stuff like: &quot;Remember when we...&quot;  Try mixing up the teams for a fairer game.Don't let these stop you from trying out this game, however.  It's a ton of fun &amp; has long-lasting appeal.", "rating": 5.0, "upvotes": 114.0, "downvotes": 3.0, "helpfulness": 0.9743589743589743, "phelpindex": 0.960198199966727}]